{
    "source": {
        "categories": [
            {
                "name": "Madyamika",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "The Way of the Boddhisattva",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Root text",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "The Way of the Boddhisattva",
                "enDesc": "",
                "enShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "The Way of the Boddhisattva",
                "language": "en",
                "versionSource": "",
                "completestatus": "in_progress",
                "content": [],
                "direction":"ltr"
            }
        ]
    },
    "target": {
        "categories": [
            {
                "name": "དབུ་མ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "སྤྱོད་འཇུག།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "རྩ་བ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "སྤྱོད་འཇུག།",
                "heDesc": "",
                "heShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "སྤྱོད་འཇུག།",
                "language": "bo",
                "versionSource": "",
                "completestatus": "in_progress",
                "content": [
                    [
                        "རྒྱ་གར་སྐད་དུ། བོ་དྷི་སཏྭ་ཙརྱ་ཨ་བ་ཏཱ་ར། <br>",
                        "བོད་སྐད་དུ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ། <br>",
                        "སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། ། <br> <br>",
                        "བདེ་གཤེགས་ཆོས་ཀྱི་སྐུ་མངའ་སྲས་བཅས་དང་། ། <br> ཕྱག་འོས་ཀུན་ལའང་གུས་པར་ཕྱག་འཚལ་ཏེ། ། <br> བདེ་གཤེགས་སྲས་ཀྱི་སྡོམ་ལ་འཇུག་པ་ནི། ། <br> ལུང་བཞིན་མདོར་བསྡུས་ནས་ནི་བརྗོད་པར་བྱ། ། <br> <br>",
                        "སྔོན་ཆད་མ་བྱུང་བ་ཡང་འདིར་བརྗོད་མེད། ། <br> སྡེབ་སྦྱོར་མཁས་པའང་བདག་ལ་ཡོད་མིན་ཏེ། ། <br> དེ་ཕྱིར་གཞན་དོན་བསམ་པ་བདག་ལ་མེད། ། <br> རང་གི་ཡིད་ལ་བསྒོམ་ཕྱིར་ངས་འདི་བརྩམས། ། <br> <br>",
                        "དགེ་བ་བསྒོམ་ཕྱིར་བདག་གི་དད་པའི་ཤུགས། ། <br> འདི་དག་གིས་ཀྱང་རེ་ཞིག་འཕེལ་འགྱུར་ལ། ། <br> བདག་དང་སྐལ་བ་མཉམ་པ་གཞན་གྱིས་ཀྱང་། ། <br> ཅི་སྟེ་འདི་དག་མཐོང་ན་དོན་ཡོད་འགྱུར། ། <br> <br>",
                        "དལ་འབྱོར་འདི་ནི་རྙེད་པར་ཤིན་ཏུ་དཀའ། ། <br> སྐྱེས་བུའི་དོན་སྒྲུབ་ཐོབ་པར་གྱུར་པ་ལ། ། <br> གལ་ཏེ་འདི་ལ་ཕན་པ་མ་བསྒྲུབས་ན། ། <br> ཕྱིས་འདི་ཡང་དག་འབྱོར་པར་ག་ལ་འགྱུར། ། <br> <br>",
                        "ཇི་ལྟར་མཚན་མོ་མུན་ནག་སྤྲིན་རུམ་ན། ། <br> གློག་འགྱུ་སྐད་ཅིག་བར་སྣང་སྟོན་པ་ལྟར། ། <br> དེ་བཞིན་སངས་རྒྱས་མཐུ་ཡིས་བརྒྱ་ལམ་ན། ། <br> འཇིག་རྟེན་བསོད་ནམས་བློ་གྲོས་ཐང་འགའ་འབྱུང་། ། <br> <br>",
                        "དེ་ལྟས་དགེ་བ་ཉམ་ཆུང་ཉིད་ལ་རྟག། <br>  ། <br> སྡིག་པ་སྟོབས་ཆེན་ཤིན་ཏུ་མི་བཟད་པ། ། <br> དེ་ནི་རྫོགས་པའི་བྱང་ཆུབ་སེམས་མིན་པ། ། <br> དགེ་གཞན་གང་གིས་ཟིལ་གྱིས་གནོན་པར་འགྱུར། ། <br> <br>",
                        "བསྐལ་པ་དུ་མར་རབ་དགོངས་མཛད་པ་ཡི། ། <br> ཐུབ་དབང་རྣམས་ཀྱིས་འདི་ཉིད་ཕན་པར་གཟིགས། ། <br> འདིས་ནི་ཚད་མེད་སྐྱེ་བོའི་ཚོགས་རྣམས་ཀྱིས། ། <br> བདེ་མཆོག་བདེ་བླག་ཉིད་དུ་ཐོབ་པར་བྱེད། ། <br> <br>",
                        "སྲིད་པའི་སྡུག་བསྔལ་བརྒྱ་ཕྲག་གཞོམ་འདོད་ཅིང་། ། <br> སེམས་ཅན་མི་བདེ་བསལ་བར་འདོད་པ་དང་། ། <br> བདེ་མང་བརྒྱ་ཕྲག་སྤྱོད་པར་འདོད་པས་ཀྱང་། ། <br> བྱང་ཆུབ་སེམས་ཉིད་རྟག་ཏུ་གཏང་མི་བྱ། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་སྐྱེས་གྱུར་ན་སྐད་ཅིག་གིས། ། <br> འཁོར་བའི་བཙོན་རར་བསྡམས་པའི་ཉམ་ཐག་རྣམས། ། <br> བདེ་གཤེགས་རྣམས་ཀྱི་སྲས་ཞེས་བརྗོད་བྱ་ཞིང་། ། <br> འཇིག་རྟེན་ལྷ་མིར་བཅས་པས་ཕྱག་བྱར་འགྱུར། ། <br> <br>",
                        "གསེར་འགྱུར་རྩི་ཡི་རྣམ་པ་མཆོག་ལྟ་བུ། ། <br> མི་གཙང་ལུས་འདི་བླངས་ནས་རྒྱལ་བའི་སྐུ། ། <br> རིན་ཆེན་རིང་ཐང་མེད་པར་བསྒྱུར་བས་ན། ། <br> བྱང་ཆུབ་སེམས་ཞེས་བྱ་བ་རབ་བརྟན་ཟུང་། ། <br> <br>",
                        "འགྲོ་བའི་དེད་དཔོན་གཅིག་པུ་ཚད་མེད་བློས། ། <br> ལེགས་པར་ཡོངས་སུ་བརྟགས་ན་རིན་ཆེ་བས། ། <br> འགྲོ་བའི་གནས་དང་བྲལ་བར་འདོད་པ་རྣམས། ། <br> རིན་ཆེན་བྱང་ཆུབ་སེམས་ལེགས་བརྟན་པར་ཟུང་། ། <br> <br>",
                        "དགེ་བ་གཞན་ཀུན་ཆུ་ཤིང་བཞིན་དུ་ནི། ། <br> འབྲས་བུ་བསྐྱེད་ནས་ཟད་པར་འགྱུར་བ་ཉིད། ། <br> བྱང་ཆུབ་སེམས་ཀྱི་ལྗོན་ཤིང་རྟག་པར་ཡང་། ། <br> འབྲས་བུ་འབྱིན་པས་མི་ཟད་འཕེལ་བར་འགྱུར། ། <br> <br>",
                        "སྡིག་པ་ཤིན་ཏུ་མི་བཟད་བྱས་ན་ཡང་། ། <br> དཔའ་ལ་བརྟེན་ནས་འཇིགས་པ་ཆེན་པོ་ལྟར། ། <br> གང་ལ་བརྟེན་ནས་ཡུད་ཀྱིས་སྒྲོལ་འགྱུར་བ། ། <br> དེ་ལ་བག་ཅན་རྣམས་ཀྱིས་ཅིས་མི་བརྟེན། ། <br> <br>",
                        "དེས་ནི་དུས་མཐའི་མེ་བཞིན་སྡིག་ཆེན་རྣམས། ། <br> སྐད་ཅིག་གཅིག་གིས་ངེས་པར་སྲེག་པར་བྱེད། ། <br> དེ་ཡི་ཕན་ཡོན་དཔག་ཏུ་མེད་པ་དག ། <br> བྱམས་མགོན་བློ་དང་ལྡན་པས་ནོར་བཟངས་བཤད། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དེ་མདོར་བསྡུས་ན། ། <br> རྣམ་པ་གཉིས་སུ་ཤེས་བྱ་སྟེ། ། <br> བྱང་ཆུབ་སྨོན་པའི་སེམས་དང་ནི། ། <br> བྱང་ཆུབ་འཇུག་པ་ཉིད་ཡིན་ནོ། ། <br> <br>",
                        "འགྲོ་བར་འདོད་དང་འགྲོ་བ་ཡི། ། <br> བྱེ་བྲག་ཇི་ལྟར་ཤེས་པ་ལྟར། ། <br> དེ་བཞིན་མཁས་པས་འདི་གཉིས་ཀྱི། ། <br> བྱེ་བྲག་རིམ་བཞིན་ཤེས་པར་བྱ། ། <br> <br>",
                        "བྱང་ཆུབ་སྨོན་པའི་སེམས་ལས་ནི། ། <br> འཁོར་ཚེ་འབྲས་བུ་ཆེ་འབྱུང་ཡང་། ། <br> ཇི་ལྟར་འཇུག་པའི་སེམས་བཞིན་དུ། ། <br> བསོད་ནམས་རྒྱུན་ཆགས་འབྱུང་བ་མིན། ། <br> <br>",
                        "གང་ནས་བཟུང་སྟེ་སེམས་ཅན་ཁམས། ། <br> མཐའ་ཡས་རབ་ཏུ་དགྲོལ་བའི་ཕྱིར། ། <br> མི་ལྡོག་པ་ཡི་སེམས་ཀྱིས་སུ། ། <br> སེམས་དེ་ཡང་དག་བླངས་གྱུར་པ། ། <br> <br>",
                        "དེང་ནས་བཟུང་སྟེ་གཉིད་ལོག་གམ། ། <br> བག་མེད་གྱུར་ཀྱང་བསོད་ནམས་ཤུགས། ། <br> རྒྱུན་མི་འཆད་པར་དུ་མ་ཞིག ། <br> ནམ་མཁའ་མཉམ་པར་རབ་ཏུ་འབྱུང་། ། <br> <br>",
                        "འདི་ནི་འཐད་པ་དང་བཅས་པར། ། <br> ལག་བཟང་གིས་ནི་ཞུས་པ་ལས། ། <br> དམན་མོས་སེམས་ཅན་དོན་གྱི་ཕྱིར། ། <br> དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་གསུངས། ། <br> <br>",
                        "སེམས་ཅན་རྣམས་ཀྱི་ཀླད་ནད་ཙམ། ། <br> བསལ་ལོ་སྙམ་དུ་བསམས་ན་ཡང་། ། <br> ཕན་འདོགས་བསམ་པ་དང་ལྡན་དེ། ། <br> བསོད་ནམས་དཔག་མེད་ལྡན་གྱུར་ན། ། <br> <br>",
                        "སེམས་ཅན་རེ་རེའི་མི་བདེ་བ། ། <br> དཔག་ཏུ་མེད་པ་བསལ་འདོད་ཅིང་། ། <br> རེ་རེའང་ཡོན་ཏན་དཔག་མེད་དུ། ། <br> བསྒྲུབ་པར་འདོད་པ་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "ཕའམ་ཡང་ན་མ་ཡང་རུང་། ། <br> སུ་ལ་འདི་འདྲའི་ཕན་སེམས་ཡོད། ། <br> ལྷ་དང་དྲང་སྲོང་རྣམས་ཀྱང་རུང་། ། <br> ཚངས་པ་ལ་ཡང་འདི་ཡོད་དམ། ། <br> <br>",
                        "སེམས་ཅན་དེ་དག་ཉིད་ལ་སྔོན། ། <br> རང་གི་དོན་དུ་འདི་འདྲའི་སེམས། ། <br> རྨི་ལམ་དུ་ཡང་མ་རྨིས་ན། ། <br> གཞན་གྱི་དོན་དུ་ག་ལ་སྐྱེ། ། <br> <br>",
                        "གཞན་དག་རང་གི་དོན་དུ་ཡང་། ། <br> མི་འབྱུང་སེམས་ཅན་དོན་སེམས་གང་། ། <br> སེམས་ཀྱི་རིན་ཆེན་ཁྱད་པར་འདི། ། <br> སྔ་ན་མེད་པའི་རྨད་ཅིག་འཁྲུངས། ། <br> <br>",
                        "འགྲོ་བ་ཀུན་གྱི་དགའ་བའི་རྒྱུ། ། <br> སེམས་ཅན་སྡུག་བསྔལ་རྩིར་གྱུར་པ། ། <br> རིན་ཆེན་སེམས་ཀྱི་བསོད་ནམས་གང་། ། <br> དེ་ལ་ཇི་ལྟར་གཞལ་གྱིས་ལང་། ། <br> <br>",
                        "ཕན་པར་བསམས་པ་ཙམ་གྱིས་ཀྱང་། ། <br> སངས་རྒྱས་མཆོད་ལས་ཁྱད་འཕགས་ན། ། <br> སེམས་ཅན་མ་ལུས་ཐམས་ཅད་ཀྱི། ། <br> བདེ་དོན་བརྩོན་པ་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "སྡུག་བསྔལ་འདོར་འདོད་སེམས་ཡོད་ཀྱང་། ། <br> སྡུག་བསྔལ་ཉིད་ལ་མངོན་པར་རྒྱུག ། <br> བདེ་བ་འདོད་ཀྱང་གཏི་མུག་པས། ། <br> རང་གི་བདེ་བ་དགྲ་ལྟར་འཇོམས། ། <br> <br>",
                        "གང་ཞིག་བདེ་བས་ཕོངས་པ་དང་། ། <br> སྡུག་བསྔལ་མང་ལྡན་དེ་དག་ལ། ། <br> བདེ་བ་ཀུན་གྱིས་ཚིམ་པ་དང་། ། <br> སྡུག་བསྔལ་ཐམས་ཅད་གཅོད་བྱེད་ཅིང་། ། <br> <br>",
                        "གཏི་མུག་ཀྱང་ནི་སེལ་བྱེད་པ། ། <br> དེ་དང་དགེ་མཚུངས་ག་ལ་ཡོད། ། <br> དེ་འདྲའི་བཤེས་ཀྱང་ག་ལ་ཡོད། ། <br> བསོད་ནམས་དེ་འདྲའང་ག་ལ་ཡོད། ། <br> <br>",
                        "ཕན་བཏགས་ལན་ལོན་གང་ཡིན་པ། ། <br> དེ་ཡང་རེ་ཞིག་བསྔགས་འོས་ན། ། <br> མ་བཅོལ་ལེགས་པར་བྱེད་པ་ཡི། ། <br> བྱང་ཆུབ་སེམས་དཔའ་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "འགྲོ་བ་ཉུང་ཟད་ནར་མའི་ཟས་སྦྱོར་བ། ། <br> སྐད་ཅིག་ཟས་ཙམ་སྦྱིན་པར་བྱེད་པ་དང་། ། <br> བརྙས་བཅས་ཉིན་ཕྱེད་འདྲངས་པར་བྱེད་པ་ཡང་། ། <br> དགེ་བ་བྱེད་པ་ཡིན་ཞེས་སྐྱེ་བོས་བཀུར། ། <br> <br>",
                        "སེམས་ཅན་གྲངས་མཐའ་ཡས་ལ་དུས་རིང་དུ། ། <br> བདེ་བར་གཤེགས་ཀྱི་བདེ་བ་བླ་ན་མེད། ། <br> ཡིད་ལ་བསམ་པ་མཐའ་དག་རྫོགས་བྱེད་པ། ། <br> རྟག་ཏུ་སྦྱིན་པ་ལྟ་ཞིག་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "གང་ཞིག་དེ་འདྲའི་རྒྱལ་སྲས་སྦྱིན་བདག་ལ། ། <br> གལ་ཏེ་ངན་སེམས་སྐྱེད་པར་བྱེད་ན་དེ། ། <br> ངན་སེམས་བསྐྱེད་པའི་གྲངས་བཞིན་བསྐལ་པར་ནི། ། <br> དམྱལ་བར་གནས་པར་འགྱུར་ཞེས་ཐུབ་པས་གསུངས། ། <br> <br>",
                        "འོན་ཏེ་གང་ཞིག་ཡིད་རབ་དང་བྱེད་ན། ། <br> དེ་ཡི་འབྲས་བུ་དེ་བས་ལྷག་པར་འཕེལ། ། <br> རྒྱལ་སྲས་རྣམས་ལ་དོ་གལ་ཆེན་པོས་ཀྱང་། ། <br> སྡིག་པ་མི་འབྱུང་དགེ་བ་ངང་གིས་འཕེལ། ། <br> <br>",
                        "གང་ལ་སེམས་ཀྱི་དམ་པ་རིན་ཆེན་དེ། ། <br> སྐྱེས་པ་དེ་ཡི་སྐུ་ལ་ཕྱག་འཚལ་ཞིང་། ། <br> གང་ལ་གནོད་པ་བྱས་ཀྱང་བདེ་འབྲེལ་བ། ། <br> བདེ་བའི་འབྱུང་གནས་དེ་ལ་སྐྱབས་སུ་མཆི། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས་བྱང་ཆུབ་སེམས་ཀྱི་ཕན་ཡོན་བཤད་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་དང་པོའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "རིན་ཆེན་སེམས་དེ་གཟུང་བར་བྱ་བའི་ཕྱིར། ། <br> དེ་བཞིན་གཤེགས་པ་རྣམས་དང་དམ་པའི་ཆོས། ། <br> དཀོན་མཆོག་དྲི་མ་མེད་དང་སངས་རྒྱས་སྲས། ། <br> ཡོན་ཏན་རྒྱ་མཚོ་རྣམས་ལ་ལེགས་པར་མཆོད། ། <br> <br>",
                        "མེ་ཏོག་འབྲས་བུ་ཇི་སྙེད་ཡོད་པ་དང་། ། <br> སྨན་གྱི་རྣམ་པ་གང་ཞིག་ཡོད་པ་དང་། ། <br> འཇིག་རྟེན་རིན་ཆེན་ཇི་སྙེད་ཡོད་པ་དང་། ། <br> ཆུ་གཙང་ཡིད་དུ་འོང་བ་ཅི་ཡོད་དང་། ། <br> <br>",
                        "རིན་ཆེན་རི་བོ་དང་ནི་དེ་བཞིན་དུ། ། <br> ནགས་ཚལ་ས་ཕྱོགས་དབེན་ཞིང་ཉམས་དགའ་དང་། ། <br> ལྗོན་ཤིང་མེ་ཏོག་རྒྱན་སྤྲས་སྤུད་པ་དང་། ། <br> ཤིང་གང་འབྲས་བཟང་ཡལ་ག་དུད་པ་དང་། ། <br> <br>",
                        "ལྷ་སོགས་འཇིག་རྟེན་ན་ཡང་དྲི་དང་ནི། ། <br> སྤོས་དང་དཔག་བསམ་ཤིང་དང་རིན་ཆེན་ཤིང་། ། <br> མ་རྨོས་འཁྲུངས་པའི་ལོ་ཏོག་རྣམ་པ་དང་། ། <br> གཞན་ཡང་མཆོད་པར་འོས་པའི་རྒྱན་རྣམས་ནི། ། <br> <br>",
                        "མཚོ་དང་རྫིང་བུ་པདྨས་བརྒྱན་པ་དག ། <br> ངང་པ་ཤིན་ཏུ་སྐད་སྙན་ཡིད་འོང་ལྡན། ། <br> ནམ་མཁའ་རབ་འབྱམས་ཁམས་ཀྱི་མཐས་གཏུགས་ན། ། <br> ཡོངས་སུ་གཟུང་བ་མེད་པ་དེ་དག་ཀུན། ། <br> <br>",
                        "བློ་ཡིས་བླངས་ནས་ཐུབ་པ་སྐྱེས་ཀྱི་མཆོག ། <br> སྲས་དང་བཅས་པ་རྣམས་ལ་ལེགས་འབུལ་ན། ། <br> ཡོན་གནས་དམ་པ་ཐུགས་རྗེ་ཆེ་རྣམས་ཀྱིས། ། <br> བདག་ལ་བརྩེར་དགོངས་བདག་གི་འདི་དག་བཞེས། ། <br> <br>",
                        "བདག་ནི་བསོད་ནམས་མི་ལྡན་བཀྲེན་ཆེན་ཏེ། ། <br> མཆོད་པའི་ནོར་གཞན་བདག་ལ་ཅང་མ་མཆིས། ། <br> དེས་ན་གཞན་དོན་དགོངས་པའི་མགོན་གྱིས་འདི། ། <br> བདག་གི་དོན་སླད་ཉིད་ཀྱི་མཐུས་བཞེས་ཤིག ། <br> <br>",
                        "རྒྱལ་དང་དེ་སྲས་རྣམས་ལ་བདག་གིས་ནི། ། <br> བདག་གི་ལུས་ཀུན་གཏན་དུ་དབུལ་བར་བགྱི། ། <br> སེམས་དཔའ་མཆོག་རྣམས་བདག་ནི་ཡོངས་བཞེས་ཤིག ། <br> གུས་པས་ཁྱེད་ཀྱི་འབངས་སུ་མཆི་བར་བགྱི། ། <br> <br>",
                        "བདག་ནི་ཁྱེད་ཀྱིས་ཡོངས་སུ་བཟུང་བས་ན། ། <br> སྲིད་ན་མི་འཇིགས་སེམས་ཅན་ཕན་པ་བགྱིད། ། <br> སྔོན་གྱི་སྡིག་ལས་ཡང་དག་འདའ་བགྱིད་ཅིང་། ། <br> སྡིག་པ་གཞན་ཡང་སླན་ཆད་མི་བགྱིད་དོ། ། <br> <br>",
                        "ཁྲུས་ཀྱི་ཁང་པ་ཤིན་ཏུ་དྲི་ཞིམ་པ། ། <br> ཤེལ་གྱི་ས་གཞི་གསལ་ཞིང་འཚེར་བ་ལྟར། ། <br> རིན་ཆེན་འབར་བའི་ཀ་བ་ཡིད་འོང་ལྡན། ། <br> མུ་ཏིག་འོད་ཆགས་བླ་རེ་བྲེས་པ་དེར། ། <br> <br>",
                        "དེ་བཞིན་གཤེགས་དང་དེ་ཡི་སྲས་རྣམས་ལ། ། <br> རིན་ཆེན་བུམ་པ་མང་པོ་སྤོས་ཀྱི་ཆུ། ། <br> ཡིད་འོང་ལེགས་པར་བཀང་བ་གླུ་དང་ནི། ། <br> རོལ་མོར་བཅས་པ་དུ་མས་སྐུ་ཁྲུས་གསོལ། ། <br> <br>",
                        "དེ་དག་སྐུ་ལ་མཚུངས་པ་མེད་པའི་གོས། ། <br> གཙང་ལ་དྲི་རབ་བསྒོས་པས་སྐུ་ཕྱིའོ། ། <br> དེ་ནས་དེ་ལ་ཁ་དོག་ལེགས་བསྒྱུར་བའི། ། <br> ན་བཟའ་ཤིན་ཏུ་དྲི་ཞིམ་དམ་པ་འབུལ། ། <br> <br>",
                        "གོས་བཟང་སྲབ་ལ་འཇམ་པ་སྣ་ཚོགས་དང་། ། <br> རྒྱན་མཆོག་བརྒྱ་ཕྲག་དེ་དང་དེ་དག་གིས། ། <br> འཕགས་པ་ཀུན་དུ་བཟང་དང་འཇམ་དབྱངས་དང་། ། <br> འཇིག་རྟེན་དབང་ཕྱུག་སོགས་ལའང་བརྒྱན་པར་བགྱི། ། <br> <br>",
                        "སྟོང་གསུམ་ཀུན་དུ་དྲི་ངད་ལྡང་བ་ཡི། ། <br> དྲི་མཆོག་རྣམས་ཀྱིས་ཐུབ་དབང་ཀུན་གྱི་སྐུ། ། <br> གསེར་སྦྱངས་བཙོ་མ་བྱི་དོར་བྱས་པ་ལྟར། ། <br> འོད་ཆགས་འབར་བ་དེ་དག་བྱུག་པར་བགྱི། ། <br> <br>",
                        "ཐུབ་དབང་མཆོད་གནས་མཆོག་ལ་ཡིད་འོང་བའི། ། <br> མེ་ཏོག་མནྡ་ར་དང་པདྨ་དང་། ། <br> ཨུཏྤལ་ལ་སོགས་དྲི་ཞིམ་ཐམས་ཅད་དང་། ། <br> ཕྲེང་བ་སྤེལ་ལེགས་ཡིད་འོང་རྣམས་ཀྱིས་མཆོད། ། <br> <br>",
                        "སྤོས་མཆོག་ཡིད་འཕྲོག་དྲི་ངད་ཁྱབ་པ་ཡི། ། <br> བདུག་པའི་སྤྲིན་ཚོགས་རྣམས་ཀྱང་དེ་ལ་དབུལ། ། <br> ཞལ་ཟས་བཟའ་བཏུང་སྣ་ཚོགས་བཅས་པ་ཡི། ། <br> ལྷ་བཤོས་རྣམས་ཀྱང་དེ་ལ་དབུལ་བར་བགྱི། ། <br> <br>",
                        "གསེར་གྱི་པདྨ་ཚར་དུ་དངར་བ་ཡི། ། <br> རིན་ཆེན་སྒྲོན་མ་རྣམས་ཀྱང་དབུལ་བར་བགྱི། ། <br> ས་གཞི་བསྟར་བ་སྤོས་ཀྱིས་བྱུགས་པ་དེར། ། <br> མེ་ཏོག་ཡིད་འོང་སིལ་མ་དགྲམ་པར་བྱ། ། <br> <br>",
                        "གཞལ་མེད་ཕོ་བྲང་བསྟོད་དབྱངས་ཡིད་འོང་ལྡན། ། <br> མུ་ཏིག་རིན་ཆེན་རྒྱན་འཕྱང་མཛེས་འབར་བ། ། <br> དཔག་ཡས་ནམ་མཁའི་རྒྱན་གྱུར་དེ་དག་ཀྱང་། ། <br> ཐུགས་རྗེའི་རང་བཞིན་ཅན་ལ་དབུལ་བར་བགྱི། ། <br> <br>",
                        "རིན་ཆེན་གདུགས་མཛེས་གསེར་གྱི་ཡུ་བ་ཅན། ། <br> ཁོར་ཡུག་རྒྱན་གྱི་རྣམ་པ་ཡིད་འོང་ལྡན། ། <br> དབྱིབས་ལེགས་བལྟ་ན་སྡུག་པ་བསྒྲེང་བ་ཡང་། ། <br> རྟག་ཏུ་ཐུབ་དབང་རྣམས་ལ་དབུལ་བར་བགྱི། ། <br> <br>",
                        "དེ་ལས་གཞན་ཡང་མཆོད་པའི་ཚོགས། ། <br> རོལ་མོ་དབྱངས་སྙན་ཡིད་འོང་ལྡན། ། <br> སེམས་ཅན་སྔག་བསྔལ་ཚིམ་བྱེད་པའི། ། <br> སྤྲིན་རྣམས་སོ་སོར་གནས་གྱུར་ཅིག ། <br> <br>",
                        "དམ་ཆོས་དཀོན་མཆོག་ཐམས་ཅད་དང་། ། <br> མཆོད་རྟེན་རྣམས་དང་སྐུ་གཟུགས་ལ། ། <br> རིན་ཆེན་མེ་ཏོག་ལ་སོགས་ཆར། ། <br> རྒྱུན་མི་འཆད་པར་འབབ་པར་ཤོག ། <br> <br>",
                        "ཇི་ལྟར་འཇམ་དབྱངས་ལ་སོགས་པས། ། <br> རྒྱལ་བ་རྣམས་ལ་མཆོད་མཛད་པ། ། <br> དེ་བཞིན་བདག་གིས་དེ་བཞིན་གཤེགས། ། <br> མགོན་པོ་སྲས་དང་བཅས་རྣམས་མཆོད། ། <br> <br>",
                        "ཡོན་ཏན་རྒྱ་མཚོ་རྣམས་ལ་བདག ། <br> བསྟོད་དབྱངས་ཡན་ལག་རྒྱ་མཚོས་བསྟོ།། <br> བསྟོད་དབྱངས་སྙན་སྤྲིན་དེ་དག་ལ། ། <br> ངེས་པར་ཀུན་དུ་འབྱུང་གྱུར་ཅིག ། <br> <br>",
                        "དུས་གསུམ་གཤེགས་པའི་སངས་རྒྱས་ཀུན། ། <br> ཆོས་དང་ཚོགས་ཀྱི་མཆོག་བཅས་ལ། ། <br> ཞིང་རྡུལ་ཀུན་གྱི་གྲངས་སྙེད་ཀྱི། ། <br> ལུས་བཏུད་པ་ཡིས་བདག་ཕྱག་འཚལ། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་ཀྱི་གཞི་རྣམས་དང་། ། <br> མཆོད་རྟེན་རྣམས་ལ་བདག་ཕྱག་འཚལ། ། <br> མཁན་པོ་དེ་བཞིན་སློབ་དཔོན་དང་། ། <br> བརྟུལ་ཞུགས་མཆོག་ལ་ཕྱག་འཚལ་ལོ། ། <br> <br>",
                        "བྱང་ཆུབ་སྙིང་པོར་མཆིས་ཀྱི་བར། ། <br> སངས་རྒྱས་རྣམས་ལ་སྐྱབས་སུ་མཆི། ། <br> ཆོས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཡི། ། <br> ཚོགས་ལའང་དེ་བཞིན་སྐྱབས་སུ་མཆི། ། <br> <br>",
                        "ཕྱོགས་རྣམས་ཀུན་ན་བཞུགས་པ་ཡི། ། <br> རྫོགས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས། ། <br> ཐུགས་རྗེ་ཆེན་པོ་མངའ་རྣམས་ལ། ། <br> ཐལ་མོ་སྦྱར་ཏེ་གསོལ་བ་ནི། ། <br> <br>",
                        "ཐོག་མ་མེད་ལྡན་འཁོར་བ་ནས། ། <br> ཚེ་རབས་འདི་འམ་གཞན་དག་ཏུ། ། <br> བདག་གིས་མ་འཚལ་སྡིག་བགྱིས་པའམ། ། <br> བགྱིད་དུ་སྩལ་བ་ཉིད་དང་ནི། ། <br> <br>",
                        "གཏི་མུག་འཁྲུལ་པས་བདག་ནོན་ཏེ། ། <br> རྗེས་སུ་ཡིད་རངས་གང་བགྱིས་པ། ། <br> ནོངས་པ་དེ་ནི་མཐོང་བགྱིས་ནས། ། <br> བསམ་པ་ཐག་པས་མགོན་ལ་བཤགས། ། <br> <br>",
                        "བདག་གིས་དཀོན་མཆོག་གསུམ་དང་ནི། ། <br> ཕ་མའམ་བླ་མ་གཞན་དག་ལ། ། <br> ཉོན་མོངས་སྒོ་ནས་ལུས་ངག་དང་། ། <br> ཡིད་ཀྱིས་གནོད་བགྱིས་གང་ལགས་དང་། ། <br> <br>",
                        "ཉེས་པ་དུ་མས་སྐྱོན་ཆགས་པའི། ། <br> སྡིག་ཅན་བདག་གིས་སྡིག་པ་གང་། ། <br> ཤིན་ཏུ་མི་བཟད་བགྱིས་པ་དེ། ། <br> ཐམས་ཅད་འདྲེན་པ་རྣམས་ལ་བཤགས། ། <br> <br>",
                        "བདག་ནི་སྡིག་པ་མ་བྱང་བར། ། <br> སྔོན་དུ་འགུམ་པར་འགྱུར་དུ་མཆི། ། <br> ཇི་ལྟར་འདི་ལས་ངེས་ཐར་བར། ། <br> མྱུར་བའི་ཚུལ་གྱིས་བསྐྱབ་ཏུ་གསོལ། ། <br> <br>",
                        "ཡིད་བརྟན་མི་རུང་འཆི་བདག་འདི། ། <br> བྱས་དང་མ་བྱས་མི་སྡོད་པས། ། <br> ན་དང་མི་ན་ཀུན་གྱིས་ཀྱང་། ། <br> གློ་བུར་ཚེ་ལ་ཡིད་མི་བརྟན། ། <br> <br>",
                        "ཐམས་ཅད་བོར་ཏེ་ཆས་དགོས་པར། ། <br> བདག་གིས་དེ་ལྟར་མ་ཤེས་ནས། ། <br> མཛའ་དང་མི་མཛའི་དོན་གྱི་ཕྱིར། ། <br> སྡིག་པ་རྣམ་པ་སྣ་ཚོགས་བྱས། ། <br> <br>",
                        "མི་མཛའ་རྣམས་ཀྱང་མེད་འགྱུར་ཞིང་། ། <br> མཛའ་བ་རྣམས་ཀྱང་མེད་པར་འགྱུར། ། <br> བདག་ཀྱང་མེད་པར་འགྱུར་བ་སྟེ། ། <br> དེ་བཞིན་ཐམས་ཅད་མེད་པར་འགྱུར། ། <br> <br>",
                        "རྨི་ལམ་ཉམས་སུ་མྱོང་བ་བཞིན། ། <br> དངོས་པོ་གང་དང་གང་སྤྱད་པ། ། <br> དེ་དེ་དྲན་པའི་ཡུལ་དུ་འགྱུར། ། <br> འདས་པ་ཐམས་ཅད་མཐོང་མི་འགྱུར། ། <br> <br>",
                        "རེ་ཞིག་གསོན་ཚེ་འདི་ཉིད་ལ། ། <br> མཛའ་དང་མི་མཛའ་དུ་མ་འདས། ། <br> དེ་དག་དོན་དུ་བྱས་པའི་སྡིག ། <br> མི་བཟད་གང་ཡིན་མདུན་ན་གནས། ། <br> <br>",
                        "དེ་ལྟར་བདག་ནི་གློ་བུར་ཞེས། ། <br> བདག་གིས་རྟོགས་པར་མ་གྱུར་པས། ། <br> གཏི་མུག་ཆགས་དང་ཞེ་སྡང་གིས། ། <br> སྡིག་པ་རྣམ་པ་དུ་མ་བྱས། ། <br> <br>",
                        "ཉིན་མཚན་སྡོད་པ་ཡོད་མེད་པར། ། <br> ཚེ་འདི་རྟག་ཏུ་གོད་འགྱུར་ཞིང་། ། <br> སྣོན་པ་གུད་ནས་འོང་མེད་ན། ། <br> བདག་ལྟ་འཆི་བར་ཅིས་མི་འགྱུར། ། <br> <br>",
                        "བདག་ནི་མལ་ན་འདུག་བཞིན་དུ། ། <br> གཉེན་བཤེས་ཀུན་གྱིས་མཐའ་བསྐོར་ཀྱང་། ། <br> སྲོག་འཆད་པ་ཡི་ཚོར་བ་དག ། <br> བདག་ཉིད་གཅིག་པུས་མྱོང་བར་འགྱུར། ། <br> <br>",
                        "གཤིན་རྗེའི་ཕོ་ཉས་ཟིན་པ་ལ། ། <br> གཉེན་གྱིས་ཅི་ཕན་བཤེས་ཅི་ཕན། ། <br> དེ་ཚེ་བསོད་ནམས་གཅིག་བསྐྱབས་ན། ། <br> དེ་ཡང་བདག་གིས་མ་བསྟེན་ཏོ། ། <br> <br>",
                        "མགོན་པོ་བག་མེད་བདག་གིས་ནི། ། <br> འཇིགས་པ་འདི་འདྲ་མ་འཚལ་ནས། ། <br> མི་རྟག་ཚེ་འདིའི་ཆེད་དག་ཏུ། ། <br> སྡིག་པ་མང་པོ་ཉེ་བར་བསྒྲུབས། ། <br> <br>",
                        "སྐྱེ་བོ་ཡན་ལག་བཅད་པའི་སར། ། <br> དི་རིང་ཁྲིད་པའང་བྲེད་འགྱུར་ཏེ། ། <br> ཁ་སྐམས་མིག་རྩ་ངན་ལ་སོགས། ། <br> སྔ་ལས་གཞན་དུ་འགྱུར་སྣང་ན། ། <br> <br>",
                        "གཤིན་རྗེའི་ཕོ་ཉ་འཇིགས་འཇིགས་ལྟའི། ། <br> ཤ་ཚུགས་ཅན་གྱིས་བཟུང་གྱུར་ཅིང་། ། <br> འཇིགས་ཆེན་ནད་ཀྱིས་ཐེབས་གྱུར་པ། ། <br> རབ་ཏུ་ཉམ་ཐག་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "སུ་ཞིག་འཇིགས་ཆེན་འདི་ལས་བདག ། <br> ལེགས་པར་སྐྱོབ་པར་བྱེད་འགྱུར་ཞེས། ། <br> བྲེད་ཤ་ཐོན་པའི་མིག་བགྲད་ནས། ། <br> ཕྱོགས་བཞིར་སྐྱབས་དག་ཚོལ་བར་བྱེད། ། <br> <br>",
                        "ཕྱོགས་བཞིར་སྐྱབས་མེད་མཐོང་ནས་ནི། ། <br> དེ་ནས་ཀུན་དུ་ཡི་མུག་འགྱུར། ། <br> གནས་དེར་སྐྱབས་ཡོད་མ་ཡིན་ན། ། <br> དེ་ཚེ་བདག་གིས་ཇི་ལྟར་བྱ། ། <br> <br>",
                        "དེ་བས་རྒྱལ་བ་འགྲོ་བའི་མགོན། ། <br> འགྲོ་བ་སྐྱོབ་པའི་དོན་བརྩོན་པ། ། <br> སྟོབས་ཆེན་འཇིགས་པ་ཀུན་སེལ་ལ། ། <br> དི་རིང་ཉིད་ནས་སྐྱབས་སུ་མཆི། ། <br> <br>",
                        "དེ་ཡི་ཐུགས་སུ་ཆུད་པའི་ཆོས། ། <br> འཁོར་བའི་འཇིགས་པ་སེལ་བ་དང་། ། <br> བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ལ་ཡང་། ། <br> དེ་བཞིན་ཡང་དག་སྐྱབས་སུ་མཆི། ། <br> <br>",
                        "བདག་ནི་འཇིགས་པས་རྣམ་སྐྲག་པས། ། <br> ཀུན་དུ་བཟང་ལ་བདག་ཉིད་འབུལ། ། <br> འཇམ་པའི་དབྱངས་ལ་བདག་ཉིད་ཀྱིས། ། <br> བདག་གི་ལུས་ནི་དབུལ་བར་བགྱི། ། <br> <br>",
                        "ཐུགས་རྗེས་སྤྱོད་པ་མ་འཁྲུལ་བ། ། <br> སྤྱན་རས་གཟིགས་མགོན་དེ་ལ་ཡང་། ། <br> ཉམ་ཐག་ང་རོས་འོ་དོད་འབོད། ། <br> སྡིག་ལྡན་བདག་ལ་བསྐྱབ་ཏུ་གསོལ། ། <br> <br>",
                        "འཕགས་པ་ནམ་མཁའི་སྙིང་པོ་དང་། ། <br> ས་ཡི་སྙིང་པོ་དག་དང་ནི། ། <br> ཐུགས་རྗེ་ཆེ་མགོན་ཐམས་ཅད་ལ། ། <br> སྐྱབས་ཚོལ་སྙིང་ནས་འོ་དོད་འབོད། ། <br> <br>",
                        "གང་ཞིག་མཐོང་ནས་གཤིན་རྗེ་ཡི། ། <br> ཕོ་ཉ་ལ་སོགས་སྡང་བ་རྣམས། ། <br> སྐྲག་ནས་ཕྱོགས་བཞིར་འབྱེར་བྱེད་པ། ། <br> རྡོ་རྗེ་ཅན་ལ་སྐྱབས་སུ་མཆི། ། <br> <br>",
                        "སྔོན་ཆད་ཁྱེད་ཀྱི་བཀའ་ལས་འདས། ། <br> ད་ནི་འཇིགས་པ་ཆེ་མཐོང་ནས། ། <br> ཁྱེད་ལ་སྐྱབས་སུ་མཆི་ལགས་ཀྱིས། ། <br> འཇིགས་པ་མྱུར་དུ་བསལ་དུ་གསོལ། ། <br> <br>",
                        "ཐ་མལ་ནད་ཀྱིས་འཇིགས་ན་ཡང་། ། <br> སྨན་པའི་ངག་བཞིན་བྱ་དགོས་ན། ། <br> འདོད་ཆགས་ལ་སོགས་ཉེས་པ་བརྒྱའི། ། <br> ནད་ཀྱིས་རྟག་བཏབ་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "དེ་གཅིག་གིས་ཀྱང་འཛམ་གླིང་ན། ། <br> གནས་པའི་མི་ཀུན་བརླག་བྱེད་ལ། ། <br> དེ་དག་གསོ་བའི་སྨན་གཞན་ནི། ། <br> ཕྱོགས་རྣམས་ཀུན་ནས་མི་རྙེད་ན། ། <br> <br>",
                        "དེ་ལ་སྨན་པ་ཐམས་ཅད་མཁྱེན། ། <br> ཟུག་རྔུ་ཐམས་ཅད་འབྱིན་པ་ཡི། ། <br> བཀའ་ལྟར་མི་བྱེད་སེམས་པ་ནི། ། <br> ཤིན་ཏུ་གཏི་མུག་སྨད་པའི་གནས། ། <br> <br>",
                        "གཡང་ས་ཐ་མལ་ཆུང་ངུ་ལའང་། ། <br> བག་ཡོད་གནས་པར་བྱ་དགོས་ན། ། <br> དཔག་ཚད་སྟོང་དུ་ལྷུང་བ་ཡི། ། <br> ཡུན་རིང་གཡང་སར་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "དི་རིང་ཁོ་ན་མི་འཆི་ཞེས། ། <br> བདེ་བར་འདུག་པ་རིགས་མ་ཡིན། ། <br> བདག་ནི་མེད་པར་འགྱུར་བའི་དུས། ། <br> དེ་ནི་གདོན་མི་ཟ་བར་འབྱུང་། ། <br> <br>",
                        "བདག་ལ་མི་འཇིགས་སུ་ཡིས་བྱིན། ། <br> འདི་ལས་ཇི་ལྟར་ངེས་ཐར་ཞེས། ། <br> གདོན་མི་ཟ་བར་མེད་འགྱུར་ན། ། <br> ཇི་ལྟར་བདག་ཡིད་བདེ་བར་འདུག ། <br> <br>",
                        "སྔོན་ཆད་མྱོང་སྟེ་ཞིག་པ་ལས། ། <br> བདག་ལ་ལྷག་པ་ཅི་ཡོད་ན། ། <br> བདག་ནི་དེ་ལ་མངོན་ཞེན་ནས། ། <br> བླ་མའི་བཀའ་དང་འགལ་བར་བྱས། ། <br> <br>",
                        "གསོན་ཚེ་འདི་དང་དེ་བཞིན་དུ། ། <br> གཉེན་དང་བཤེས་པ་རྣམ་སྤངས་ནས། ། <br> གཅིག་པུ་ག་ཤེད་འགྲོ་དགོས་ན། ། <br> མཛའ་དང་མི་མཛའ་ཀུན་ཅི་རུང་། ། <br> <br>",
                        "མི་དགེ་བ་ལས་སྡུག་བསྔལ་འབྱུང་། ། <br> དེ་ལས་ཇི་ལྟར་ངེས་ཐར་ཞེས། ། <br> ཉིན་མཚན་རྟག་ཏུ་བདག་གིས་ནི། ། <br> འདི་ཉིད་འབའ་ཞིག་བསམ་པའི་རིགས། ། <br> <br>",
                        "བདག་ནི་མི་ཤེས་གཏི་མུག་པས། ། <br> རང་བཞིན་ཁ་ན་མ་ཐོའམ། ། <br> བཅས་པའི་སྡིག་པ་གང་ཡིན་ལས། ། <br> གང་ཡང་རུང་བ་བགྱིས་པ་རྣམས། ། <br> <br>",
                        "མགོན་པོའི་སྤྱན་སྔར་མངོན་སུམ་དུ། ། <br> ཐལ་སྦྱར་སྡུག་བསྔལ་འཇིགས་སེམས་ཀྱིས། ། <br> ཡང་དང་ཡང་དུ་ཕྱག་འཚལ་ཏེ། ། <br> དེ་དག་ཐམས་ཅད་བཤགས་པར་བགྱི། ། <br> <br>",
                        "འདྲེན་པ་རྣམས་ཀྱིས་བདག་གི་སྡིག ། <br> ནོངས་པ་ལགས་པར་གཟུང་དུ་གསོལ། ། <br> འདི་ནི་བཟང་པོ་མ་ལགས་པས། ། <br> སླན་ཆད་བདག་ནི་ཡོང་མི་བགྱིད། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། སྡིག་པ་བཤགས་པའི་ལེའུ་སྟེ་གཉིས་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "སེམས་ཅན་ཀུན་གྱི་ངན་སོང་གི །སྡུག་བསྔལ་ངལ་སོའི་དགེ་བ་དང་། ། <br> སྡུག་བསྔལ་ཅན་དག་བདེར་གནས་ལ། ། <br> དགའ་བས་རྗེས་སུ་ཡི་རང་ངོ་། ། <br> <br>",
                        "བྱང་ཆུབ་རྒྱུར་གྱུར་དགེ་བསགས་པ། ། <br> དེ་ལ་རྗེས་སུ་ཡི་རང་ངོ་། ། <br> ལུས་ཅན་འཁོར་བའི་སྡུག་བསྔལ་ལས། ། <br> ངེས་པར་ཐར་ལ་ཡི་རང་ངོ་། ། <br> <br>",
                        "སྐྱོབ་པ་རྣམས་ཀྱི་བྱང་ཆུབ་དང་། ། <br> རྒྱལ་སྲས་ས་ལའང་ཡི་རང་ངོ་། ། <br> སེམས་ཅན་ཐམས་ཅད་བདེ་མཛད་པའི། ། <br> ཐུགས་བསྐྱེད་དགེ་བ་རྒྱ་མཚོ་དང་། ། <br> སེམས་ཅན་ཕན་པ་མཛད་པ་ལ། ། <br> དགའ་བས་རྗེས་སུ་ཡི་རང་ངོ་། ། <br> <br>",
                        "ཕྱོགས་རྣམས་ཀུན་གྱི་སངས་རྒྱས་ལ། ། <br> ཐལ་མོ་སྦྱར་ཏེ་གསོལ་བ་ནི། ། <br> སེམས་ཅན་སྡུག་བསྔལ་མུན་འཐོམས་ལ། ། <br> ཆོས་ཀྱི་སྒྲོན་མ་སྤར་དུ་གསོལ། ། <br> <br>",
                        "རྒྱལ་བ་མྱ་ངན་འདའ་བཞེད་ལ། ། <br> ཐལ་མོ་སྦྱར་ཏེ་གསོལ་བ་ནི། ། <br> འགྲོ་འདི་ལྡོངས་པར་མི་དགོད་ཅིང་། ། <br> བསྐལ་པ་གྲངས་མེད་བཞུགས་པར་གསོལ། ། <br> <br>",
                        "དེ་ལྟར་འདི་དག་ཀུན་བྱས་ཏེ། ། <br> དགེ་བ་བདག་གིས་བསགས་པ་གང་། ། <br> དེས་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི། ། <br> སྡུག་བསྔལ་ཐམས་ཅད་བསལ་བར་ཤོག ། <br> <br>",
                        "འགྲོ་བ་ནད་པ་ཇི་སྲིད་དུ། ། <br> ནད་སོས་གྱུར་གྱི་བར་དུ་ནི། ། <br> སྨན་དང་སྨན་པ་ཉིད་དག་དང་། ། <br> དེ་ཡི་ནད་གཡོག་བྱེད་པར་ཤོག ། <br> <br>",
                        "ཟས་དང་སྐོམ་གྱི་ཆར་ཕབ་སྟེ། ། <br> བཀྲེས་དང་སྐོམ་པའི་སྡུག་བསྔལ་བསལ། ། <br> མུ་གེའི་བསྐལ་པ་བར་མའི་ཚེ། ། <br> བདག་ནི་ཟས་དང་སྐོམ་དུ་གྱུར། ། <br> <br>",
                        "སེམས་ཅན་ཕོངས་ཤིང་དབུལ་བ་ལ། ། <br> བདག་ནི་མི་ཟད་གཏེར་གྱུར་ཏེ། ། <br> ཡོ་བྱད་མཁོ་དགུ་སྣ་ཚོགས་སུ། ། <br> མདུན་དུ་ཉེ་བར་གནས་གྱུར་ཅིག ། <br> <br>",
                        "ལུས་དང་དེ་བཞིན་ལོངས་སྤྱོད་དང་། ། <br> དུས་གསུམ་དགེ་བ་ཐམས་ཅད་ཀྱང་། ། <br> སེམས་ཅན་ཀུན་གྱི་དོན་སྒྲུབ་ཕྱིར། ། <br> ཕོངས་བ་མེད་པར་གཏང་བར་བྱ། ། <br> <br>",
                        "ཐམས་ཅད་བཏང་བས་མྱ་ངན་འདའ། ། <br> བདག་བློ་མྱ་ངན་འདས་པ་སྒྲུབ། ། <br> ཐམས་ཅད་གཏོང་བར་ཆབས་གཅིག་ལ། ། <br> སེམས་ཅན་རྣམས་ལ་བཏང་བ་མཆོག ། <br> <br>",
                        "བདག་གིས་ལུས་ཅན་ཐམས་ཅད་ལ། ། <br> ལུས་འདི་ཅི་བདེར་བྱིན་ཟིན་གྱིས། ། <br> རྟག་ཏུ་གསོད་དང་སྨོད་པའམ། ། <br> བརྡེག་སོགས་ཅི་དགར་བྱེད་ལ་རག ། <br> <br>",
                        "བདག་གི་ལུས་ལ་རྩེ་བྱེད་དམ། ། <br> ཅོ་འདྲི་ག་ཞའི་རྒྱུ་བྱེད་ཀྱང་། ། <br> བདག་གི་ལུས་འདི་བྱིན་ཟིན་གྱིས། ། <br> འདི་ཡི་ཁ་ཏས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "དེ་ལ་གནོད་པར་མི་འགྱུར་བའི། ། <br> ལས་གང་ཡིན་པའང་བྱེད་དུ་ཆུག ། <br> བདག་ལ་དམིགས་ནས་ནམ་དུ་ཡང་། ། <br> འགའ་ཡང་དོན་མེད་མ་གྱུར་ཅིག ། <br> <br>",
                        "བདག་ལ་དམིགས་ནས་གང་དག་གི །ཁྲོའམ་དད་པའི་སེམས་བྱུང་བ། ། <br> དེ་ཉིད་རྟག་ཏུ་དེ་དག་གི །དོན་ཀུན་འགྲུབ་པའི་རྒྱུར་གྱུར་ཅིག ། <br> <br>",
                        "གང་དག་བདག་ལ་ཁ་ཟེར་རམ། ། <br> གཞན་དག་གནོད་པ་བྱེད་པའམ། ། <br> དེ་བཞིན་ཕྱར་ཀ་གཏོང་ཡང་རུང་། ། <br> ཐམས་ཅད་བྱང་ཆུབ་སྐལ་ལྡན་གྱུར། ། <br> <br>",
                        "བདག་ནི་མགོན་མེད་རྣམས་ཀྱི་མགོན། ། <br> ལམ་ཞུགས་རྣམས་ཀྱི་དེད་དཔོན་དང་། ། <br> བརྒལ་འདོད་རྣམས་ཀྱི་གྲུ་དང་ནི། ། <br> གཟིངས་དང་ཟམ་པ་ཉིད་དུ་གྱུར། ། <br> <br>",
                        "གླིང་དོན་གཉེར་ལ་གླིང་དང་ནི། ། <br> གནས་མལ་འདོད་ལ་གནས་མལ་དང་། ། <br> བདག་ནི་ལུས་ཅན་བྲན་འདོད་པ། ། <br> ཀུན་གྱི་བྲན་དུ་གྱུར་པར་ཤོག ། <br> <br>",
                        "ཡིད་བཞིན་ནོར་དང་བུམ་པ་བཟང་། ། <br> རིག་སྔགས་གྲུབ་དང་སྨན་ཆེན་དང་། ། <br> དཔག་བསམ་གྱི་ནི་ཤིང་དག་དང་། ། <br> ལུས་ཅན་རྣམས་ཀྱི་འདོད་འཇོར་གྱུར། ། <br> <br>",
                        "ས་སོགས་འབྱུང་བ་ཆེན་པོ་དང་། ། <br> ནམ་མཁའ་བཞིན་དུ་རྟག་པར་ཡང་། ། <br> སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡི། ། <br> རྣམ་མང་ཉེར་འཚོའི་གཞིར་ཡང་ཤོག ། <br> <br>",
                        "དེ་བཞིན་ནམ་མཁའི་མཐས་གཏུགས་པའི། ། <br> སེམས་ཅན་ཁམས་ལ་རྣམ་ཀུན་དུ། ། <br> ཐམས་ཅད་མྱ་ངན་འདས་བར་དུ། ། <br> བདག་ནི་ཉེར་འཚོའི་རྒྱུར་ཡང་ཤོག ། <br> <br>",
                        "ཇི་ལྟར་སྔོན་གྱི་བདེ་གཤེགས་ཀྱིས། ། <br> བྱང་ཆུབ་ཐུགས་ནི་བསྐྱེད་པ་དང་། ། <br> བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ། ། <br> དེ་དག་རིམ་བཞིན་གནས་པ་ལྟར། ། <br> <br>",
                        "དེ་བཞིན་འགྲོ་ལ་ཕན་དོན་དུ། ། <br> བྱང་ཆུབ་སེམས་ནི་བསྐྱེད་བགྱི་ཞིང་། ། <br> དེ་བཞིན་དུ་ནི་བསླབ་པ་ལའང་། ། <br> རིམ་པ་བཞིན་དུ་བསླབ་པར་བགྱི། ། <br> <br>",
                        "དེ་ལྟར་བློ་དང་ལྡན་པ་ཡིས། ། <br> རབ་དང་བྱང་ཆུབ་སེམས་བཟུང་ནས། ། <br> མཇུག་ཀྱང་རྒྱས་པར་བྱ་བའི་ཕྱིར། ། <br> སེམས་ནི་འདི་ལྟར་གཟེངས་བསྟོད་དོ། ། <br> <br>",
                        "དེང་དུ་བདག་ཚེ་འབྲས་བུ་ཡོད། ། <br> མི་ཡི་སྲིད་པ་ལེགས་པར་ཐོབ། ། <br> དི་རིང་སངས་རྒྱས་རིགས་སུ་སྐྱེས། ། <br> སངས་རྒྱས་སྲས་སུ་བདག་དེང་གྱུར། ། <br> <br>",
                        "ད་ནི་བདག་གིས་ཅི་ནས་ཀྱང་། ། <br> རིགས་དང་མཐུན་པའི་ལས་བརྩམས་ཏེ། ། <br> སྐྱོན་མེད་བཙུན་པའི་རིགས་འདི་ལ། ། <br> རྙོག་པར་མི་འགྱུར་དེ་ལྟར་བྱ། ། <br> <br>",
                        "ལོང་བས་ཕྱག་དང་ཕུང་པོ་ལས། ། <br> ཇི་ལྟར་རིན་ཆེན་རྙེད་པ་ལྟར། ། <br> དེ་བཞིན་ཇི་ཞིག་ལྟར་སྟེས་ནས། ། <br> བྱང་ཆུབ་སེམས་འདི་བདག་ལ་སྐྱེས། ། <br> <br>",
                        "འགྲོ་བའི་འཆི་བདག་འཇོམས་བྱེད་པའི། ། <br> བདུད་རྩི་མཆོག་ཀྱང་འདི་ཡིན་ནོ། ། <br> འགྲོ་བའི་དབུལ་བ་སེལ་བ་ཡི། ། <br> མི་ཟད་གཏེར་ཡང་འདི་ཡིན་ནོ། ། <br> <br>",
                        "འགྲོ་བའི་ནད་རབ་ཞི་བྱེད་པའི། ། <br> སྨན་གྱི་མཆོག་ཀྱང་འདི་ཡིན་ནོ། ། <br> སྲིད་ལམ་འཁྱམ་ཞིང་དུབ་པ་ཡི། ། <br> འགྲོ་བའི་ངལ་སོ་ལྗོན་ཤིང་ཡིན། ། <br> <br>",
                        "འགྲོ་བ་ཐམས་ཅད་ངན་འགྲོ་ལས། ། <br> སྒྲོལ་བར་བྱེད་པའི་སྤྱི་སྟེགས་ཡིན། ། <br> འགྲོ་བའི་ཉོན་མོངས་གདུང་སེལ་བའི། ། <br> སེམས་ཀྱི་ཟླ་བ་ཤར་བ་ཡིན། ། <br> <br>",
                        "འགྲོ་བའི་མི་ཤེས་རབ་རིབ་དག ། <br> དཔྱིས་འབྱིན་ཉི་མ་ཆེན་པོ་ཡིན། ། <br> དམ་ཆོས་འོ་མ་བསྲུབས་པ་ལས། ། <br> མར་གྱི་ཉིང་ཁུ་བྱུང་བ་ཡིན། ། <br> <br>",
                        "འགྲོ་བའི་མགྲོན་པོ་སྲིད་པའི་ལམ་རྒྱུ་ཞིང་། ། <br> བདེ་བའི་ལོངས་སྤྱོད་སྤྱད་པར་འདོད་པ་ལ། ། <br> འདི་ནི་བདེ་བའི་མཆོག་ཏུ་ཉེར་གནས་ཏེ། ། <br> སེམས་ཅན་མགྲོན་ཆེན་ཚིམ་པར་བྱེད་པ་ཡིན། ། <br> <br>",
                        "བདག་གིས་དེ་རིང་སྐྱོབ་པ་ཐམས་ཅད་ཀྱི། ། <br> སྤྱན་སྔར་འགྲོ་བ་བདེ་གཤེགས་ཉིད་དང་ནི། ། <br> བར་དུ་བདེ་ལ་མགྲོན་དུ་བོས་ཟིན་གྱིས། ། <br> ལྷ་དང་ལྷ་མིན་ལ་སོགས་དགའ་བར་གྱིས། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་གཟུང་བ་ཞེས་བྱ་བ་སྟེ་ལེའུ་གསུམ་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "རྒྱལ་བའི་སྲས་ཀྱིས་དེ་ལྟ་བུར། ། <br> བྱང་ཆུབ་སེམས་རབ་བརྟན་བཟུང་ནས། ། <br> གཡེལ་བ་མེད་པར་རྟག་ཏུ་ཡང་། ། <br> བསླབ་ལས་མི་འདའ་འབད་པར་བྱ། ། <br> <br>",
                        "བབ་ཅོལ་བརྩམས་པ་གང་ཡིན་པའམ། ། <br> གང་ཞིག་ལེགས་པར་མ་བརྟགས་པ། ། <br> དེ་ནི་དམ་བཅས་བྱས་གྱུར་ཀྱང་། ། <br> བྱའམ་བཏང་ཞེས་བརྟགས་པའི་རིགས། ། <br> <br>",
                        "སངས་རྒྱས་རྣམས་དང་དེ་ཡི་སྲས། ། <br> ཤེས་རབ་ཆེན་པོས་གང་བརྟགས་ཤིང་། ། <br> བདག་ཉིད་ཀྱིས་ཀྱང་བརྟག་བརྟགས་པ། ། <br> དེ་ལ་བཤོལ་དུ་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "གལ་ཏེ་དེ་ལྟར་དམ་བཅས་ནས། ། <br> ལས་ཀྱིས་བསྒྲུབ་པ་མ་བྱས་ན། ། <br> སེམས་ཅན་དེ་དག་ཀུན་བསླུས་པས། ། <br> བདག་གི་འགྲོ་བ་ཅི་འདྲར་འགྱུར། ། <br> <br>",
                        "དངོས་པོ་ཕལ་པ་ཅུང་ཟད་ལའང་། ། <br> ཡིད་ཀྱིས་སྦྱིན་པར་བསམ་བྱས་ནས། ། <br> མི་གང་སྦྱིན་པར་མི་བྱེད་པ། ། <br> དེ་ཡང་ཡི་དགས་འགྱུར་གསུངས་ན། ། <br> <br>",
                        "བླ་ན་མེད་པའི་བདེ་བ་ལ། ། <br> བསམ་པ་ཐག་པས་མགྲོན་གཉེར་ནས། ། <br> འགྲོ་བ་ཐམས་ཅད་བསླུ་བྱས་ན། ། <br> བདེ་འགྲོར་ཇི་ག་འགྲོ་འགྱུར་རམ། ། <br> <br>",
                        "མི་གང་བྱང་ཆུབ་སེམས་བཏང་ཡང་། ། <br> དེ་དག་ཐར་བར་བྱེད་པ་ནི། ། <br> ལས་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་སྟེ། ། <br> ཐམས་ཅད་མཁྱེན་པ་ཁོ་ནས་མཁྱེན། ། <br> <br>",
                        "དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལ། ། <br> ལྟུང་བའི་ནང་ན་ལྕི་བ་སྟེ། ། <br> འདི་ལྟར་དེ་ནི་བྱུང་གྱུར་ན། ། <br> སེམས་ཅན་ཀུན་གྱི་དོན་ལ་དམན། ། <br> <br>",
                        "གང་གཞན་སྐད་ཅིག་ཙམ་ཡང་འདིའི། ། <br> བསོད་ནམས་བར་ཆད་གེགས་བྱེད་པ། ། <br> སེམས་ཅན་དོན་ལ་དམན་གྱུར་པས། ། <br> དེ་ཡི་ངན་འགྲོ་མུ་མཐའ་མེད། ། <br> <br>",
                        "སེམས་ཅན་གཅིག་གི་བདེ་བ་ཡང་། ། <br> བཤིག་ན་བདག་ཉིད་ཉམས་འགྱུར་ན། ། <br> ནམ་མཁའ་མ་ལུས་མཐའ་ཀླས་པའི། ། <br> ལུས་ཅན་བདེ་བཤིག་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "དེ་ལྟར་ལྟུང་བ་སྟོབས་ལྡན་དང་། ། <br> བྱང་ཆུབ་སེམས་སྟོབས་ལྡན་པ་དག ། <br> འཁོར་བར་རེས་ཀྱིས་འདྲེ་བྱེད་ན། ། <br> ས་ཐོབ་པ་ལ་ཡུན་རིང་ཐོགས། ། <br> <br>",
                        "དེ་ལྟས་ཇི་ལྟར་དམ་བཅས་བཞིན། ། <br> བདག་གིས་གུས་པར་བསྒྲུབ་པར་བྱ། ། <br> དེང་ནས་བརྩོན་པར་མ་བྱས་ན། ། <br> འོག་ནས་འོག་ཏུ་འགྲོ་བར་འགྱུར། ། <br> <br>",
                        "སེམས་ཅན་ཐམས་ཅད་ཕན་མཛད་པའི། ། <br> སངས་རྒྱས་གྲངས་མེད་འདས་གྱུར་ཀྱང་། ། <br> བདག་ནི་རང་གི་ཉེས་པས་དེའི། ། <br> གསོ་བའི་སྤྱོད་ཡུལ་མ་གྱུར་ཏོ། ། <br> <br>",
                        "ད་དུང་དེ་བཞིན་བདག་བྱེད་ན། ། <br> ཡང་དང་ཡང་དུའང་དེ་བཞིན་ཏེ། ། <br> ངན་འགྲོར་ནད་དང་འཆིང་བ་དང་། ། <br> བཅད་དང་གཤེག་སོགས་མྱོང་བར་འགྱུར། ། <br> <br>",
                        "དེ་བཞིན་གཤེགས་པ་འབྱུང་བ་དང་། ། <br> དད་དང་མི་ལུས་ཐོབ་པ་དང་། ། <br> དགེ་གོམས་རུང་བ་དེ་ལྟ་བུ། ། <br> དཀོན་པ་ནམ་ཞིག་ཐོབ་པར་འགྱུར། ། <br> <br>",
                        "ནད་མེད་ཉི་མ་འདི་ལྟ་བུ། ། <br> ཟས་བཅས་འཚེ་བ་མེད་ཀྱང་ནི། ། <br> ཚེ་ནི་སྐད་ཅིག་བསླུ་བ་སྟེ། ། <br> ལུས་ནི་ཐང་ཅིག་བརྙན་པོ་བཞིན། ། <br> <br>",
                        "བདག་གི་སྤྱོད་པ་འདི་འདྲས་ནི། ། <br> མི་ཡི་ལུས་ཀྱང་འཐོབ་མི་འགྱུར། ། <br> མི་ལུས་ཐོབ་པར་མ་གྱུར་ན། ། <br> སྡིག་པ་འབའ་ཞིག་དགེ་བ་མེད། ། <br> <br>",
                        "གང་ཚེ་དགེ་སྤྱད་སྐལ་ལྡན་ཡང་། ། <br> དགེ་བ་བདག་གིས་མ་བྱས་ན། ། <br> ངན་སོང་སྡུག་བསྔལ་ཀུན་རྨོངས་པ། ། <br> དེ་ཚེ་བདག་གིས་ཅི་བྱར་ཡོད། ། <br> <br>",
                        "དགེ་བ་དག་ཀྱང་མ་བྱས་ལ། ། <br> སྡིག་པ་དག་ཀྱང་ཉེར་བསགས་ན། ། <br> བསྐལ་པ་བྱེ་བ་བརྒྱར་ཡང་ནི། ། <br> བདེ་འགྲོའི་སྒྲ་ཡང་ཐོས་མི་འགྱུར། ། <br> <br>",
                        "དེ་ཉིད་ཕྱིར་ན་བཅོམ་ལྡན་གྱིས། ། <br> རྒྱ་མཚོ་ཆེར་གཡེངས་གཉའ་ཤིང་གི། ། <br> བུ་གར་རུས་སྦལ་མགྲིན་ཆུད་ལྟར། ། <br> མི་ཉིད་ཤིན་ཏུ་ཐོབ་དཀར་གསུངས། ། <br> <br>",
                        "སྐད་ཅིག་གཅིག་བྱས་སྡིག་པས་ཀྱང་། ། <br> བསྐལ་པར་མནར་མེད་གནས་འགྱུར་ན། ། <br> ཐོག་མེད་འཁོར་བར་བསགས་སྡིག་གིས། ། <br> བདེ་འགྲོར་མི་འགྲོ་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "དེ་ཙམ་ཁོ་ན་མྱོང་གྱུར་ནས། ། <br> དེ་ནི་རྣམ་ཐར་མི་འགྱུར་ཏེ། ། <br> འདི་ལྟར་དེ་ནི་མྱོང་བཞིན་དུ། ། <br> སྡིག་པ་གཞན་དག་རབ་ཏུ་སྐྱེ། ། <br> <br>",
                        "འདི་འདྲའི་དལ་བ་རྙེད་གྱུར་ནས། ། <br> བདག་གིས་དགེ་གོམས་མ་བྱས་ན། ། <br> འདི་ལས་བསླུས་པ་གཞན་མེད་དེ། ། <br> འདི་ལས་རྨོངས་པའང་གཞན་མེད་དོ། ། <br> <br>",
                        "གལ་ཏེ་བདག་གིས་དེ་རྟོགས་ནས། ། <br> རྨོངས་པས་ཕྱིས་ཀྱང་སྒྱིད་ལུག་ན། ། <br> འཆི་བར་འགྱུར་བའི་དུས་ཀྱི་ཚེ། ། <br> མྱ་ངན་ཆེན་པོ་ལྡང་བར་འགྱུར། ། <br> <br>",
                        "དམྱལ་མེ་བཟོད་དཀས་དུས་རིང་དུ། ། <br> བདག་གི་ལུས་ལ་བསྲེགས་གྱུར་ན། ། <br> འགྱོད་པ་མི་བཟད་མེ་འབར་བས། ། <br> སེམས་གདུང་འགྱུར་བ་གདོན་མི་ཟ། ། <br> <br>",
                        "ཤིན་ཏུ་རྙེད་དཀའ་ཕན་པའི་ས། ། <br> ཇི་ཞིག་ལྟར་ཏེ་རྙེད་གྱུར་ནས། ། <br> བདག་ཉིད་ཤེས་དང་ལྡན་བཞིན་དུ། ། <br> ཕྱིར་ཡང་དམྱལ་བ་དེར་ཁྲིད་ན། ། <br> <br>",
                        "སྔགས་ཀྱིས་རྨོངས་པར་བྱས་པ་བཞིན། ། <br> བདག་ལ་འདིར་སེམས་མེད་དུ་ཟད། ། <br> ཅིས་རྨོངས་བདག་ཀྱང་མ་ཤེས་ཏེ། ། <br> བདག་གི་ཁོང་ན་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "ཞེ་སྡང་སྲེད་སོགས་དགྲ་རྣམས་ནི། ། <br> རྐང་ལག་ལ་སོགས་ཡོད་མིན་ལ། ། <br> དཔའ་མཛངས་མིན་ཡང་ཇི་ཞིག་ལྟར། ། <br> དེ་དག་གིས་བདག་བྲན་བཞིན་བྱས། ། <br> <br>",
                        "བདག་གི་སེམས་ལ་གནས་བཞིན་དུ། ། <br> དགའ་མགུར་བདག་ལ་གནོད་བྱེད་པ། ། <br> དེ་ལའང་མི་ཁྲོ་བཟོད་པ་ནི། ། <br> གནས་མིན་བཟོད་པ་སྨད་པའི་གནས། ། <br> <br>",
                        "གལ་ཏེ་ལྷ་དང་ལྷ་མིན་རྣམས། ། <br> ཐམས་ཅད་བདག་ལ་དགྲར་ལངས་ཀྱང་། ། <br> དེ་དག་གིས་ཀྱང་མནར་མེད་པའི། ། <br> མེ་ནང་ཁྲིད་ཅིང་འཇུག་མི་ནུས། ། <br> <br>",
                        "ཉོན་མོངས་སྟོབས་ཅན་དགྲ་འདིས་ནི། ། <br> གང་དང་ཕྲད་ན་རི་རབ་ཀྱང་། ། <br> ཐལ་བ་ཡང་ནི་མི་ལུས་པ། ། <br> དེར་བདག་སྐད་ཅིག་གཅིག་ལ་འདོར། ། <br> <br>",
                        "བདག་གི་ཉོན་མོངས་དགྲ་བོ་གང་། ། <br> དུས་རིང་ཐོག་མཐའ་མེད་པ་ལྟར། ། <br> དགྲ་གཞན་ཀུན་ཀྱང་དེ་ལྟ་བུར། ། <br> ཡུན་རིང་ཐུབ་པ་མ་ཡིན་ནོ། ། <br> <br>",
                        "མཐུན་པར་རིམ་གྲོ་བསྟེན་བྱས་ན། ། <br> ཐམས་ཅད་ཕན་དང་བདེ་བྱེད་ལ། ། <br> ཉོན་མོངས་རྣམས་ནི་བསྟེན་བྱས་ན། ། <br> ཕྱིར་ཞིང་སྡུག་བསྔལ་གནོད་པ་བྱེད། ། <br> <br>",
                        "དེ་ལྟར་ཡུན་རིང་རྒྱུན་ཆགས་དགྲར་གྱུར་པ། ། <br> གནོད་པའི་ཚོགས་རབ་འཕེལ་བའི་རྒྱུ་གཅིག་པུ། ། <br> བདག་གི་སྙིང་ལ་ངེས་པར་གནས་འཆའ་ན། ། <br> འཁོར་བར་འཇིགས་མེད་དགའ་བར་ག་ལ་འགྱུར། ། <br> <br>",
                        "འཁོར་བའི་བཙོན་རའི་སྲུང་མས་དམྱལ་སོགས་སུ། ། <br> གསོད་བྱེད་གཤེད་མར་གྱུར་པ་འདི་དག་ནི། ། <br> གལ་ཏེ་བློ་གནས་ཆགས་པའི་དྲ་བ་ན། ། <br> གནས་ན་བདག་ལ་བདེ་བ་ག་ལ་ཡོད། ། <br> <br>",
                        "དེ་ལྟར་ཇི་སྲིད་བདག་གིས་དགྲ་འདི་མངོན་སུམ་དུ། ། <br> ངེས་པར་མ་བཅོམ་དེ་སྲིད་བདག་འདིར་བརྩོན་མི་འདོར། ། <br> རེ་ཞིག་གནོད་བྱེད་ཆུང་ངུ་ལ་ཡང་ཁྲོས་གྱུར་པ། ། <br> ང་རྒྱལ་བདོ་རྣམས་དེ་མ་བཅོམ་པར་གཉིད་མི་འོང་། ། <br> <br>",
                        "རང་བཞིན་འཆི་བས་སྡུག་བསྔལ་གྱུར་པའི་ཉོན་མོངས་དག ། <br> གཡུལ་ངོར་མདར་ཚེ་ནན་གྱིས་གཞོམ་པར་འདོད་པ་ཡང་། ། <br> མདའ་མདུང་མཚོན་གྱིས་ཕོག་པའི་སྡུག་བསྔལ་ཁྱད་བསད་ནས། ། <br> དོན་མ་གྲུབ་པར་ཕྱིར་ཕྱོགས་འབྱེར་བར་མི་བྱེད་ན། ། <br> <br>",
                        "རྟག་ཏུ་སྡུག་བསྔལ་ཀུན་གྱི་རྒྱུར་གྱུར་པ། ། <br> རང་བཞིན་དགྲ་དེས་གཞོམ་བརྩོན་བདག་ལ་དེང་། ། <br> སྡུག་བསྔལ་བརྒྱ་ཕྲག་རྒྱུར་གྱུར་གང་གིས་ཀྱང་། ། <br> ཡི་ཆད་སྒྱིད་ལུག་མི་འགྱུར་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "དོན་མེད་དགྲ་ཡིས་རྨ་སྲོལ་བཏོད་པ་ཡང་། ། <br> ལུས་ལ་རྒྱན་དང་འདྲ་བར་སྲེལ་བྱེད་ན། ། <br> དོན་ཆེན་སྒྲུབ་ཕྱིར་ཡང་དག་བརྩོན་གྱུར་པ། ། <br> བདག་ལ་སྡུག་བསྔལ་ཅི་ཕྱིར་གནོད་བྱེད་ཡིན། ། <br> <br>",
                        "ཉ་པ་གདོལ་པ་ཞིང་པ་ལ་སོགས་པ། ། <br> རང་གི་འཚོ་བ་ཙམ་ཞིག་སེམས་པ་ཡང་། ། <br> གྲང་དང་ཚལ་སོགས་པའི་གནོད་བཟོད་ན། ། <br> འགྲོ་བ་བདེ་ཕྱིར་བདག་ལྟ་ཅིས་མི་བཟོད། ། <br> <br>",
                        "ཕྱོགས་བཅུ་ནམ་མཁའི་མཐས་གཏུགས་པའི། ། <br> འགྲོ་བ་ཉོན་མོངས་ལས་བསྒྲལ་བར། ། <br> དམ་བཅས་གང་ཚེ་བདག་ཉིད་ཀྱང་། ། <br> ཉོན་མོངས་རྣམས་ལས་མ་གྲོལ་བ། ། <br> <br>",
                        "བདག་གི་ཚོད་ཀྱང་མི་ཤེས་པར། ། <br> སྨྲ་བ་ཇི་ལྟར་སྨྱོན་པ་མིན། ། <br> དེ་ལྟར་ཉོན་མོངས་གཞོམ་པ་ལ། ། <br> རྟག་ཏུ་ཕྱིར་མི་ལྡོག་པར་བྱ། ། <br> <br>",
                        "འདི་ལ་བདག་གིས་ཞེན་བྱ་ཞིང་། ། <br> ཁོན་དུ་བཟུང་ནས་གཡུལ་སྤྲད་དེ། ། <br> རྣམ་པ་དེ་འདྲའི་ཉོན་མོངས་པ། ། <br> ཉོན་མོངས་འཇོམས་བྱེད་མ་གཏོགས་སོ། ། <br> <br>",
                        "བདག་ནི་བསྲེགས་ཏེ་བསད་གྱུར་ཏམ། ། <br> བདག་གི་མགོ་བོ་བཅད་ཀྱང་བླའི། ། <br> རྣམ་པ་ཀུན་དུ་ཉོན་མོངས་པའི། ། <br> དགྲ་ལ་མདུད་པར་མི་བྱའོ། ། <br> <br>",
                        "ཐ་མལ་དགྲ་བོ་ཡུལ་ནས་ཕྱུང་ཡང་ནི། ། <br> ཡུལ་གཞན་དག་ཏུ་གནས་ཤིང་ཡོངས་བཟུང་ནས། ། <br> ནུས་པ་བརྟས་ནས་དེ་ནས་ཕྱིར་ལྡོག་གི །ཉོན་མོངས་དགྲ་ཚུལ་དེ་དང་འདྲ་མ་ཡིན། ། <br> <br>",
                        "ཉོན་མོངས་ཉོན་མོངས་ཤེས་རབ་མིག་གིས་སྤང་། ། <br> བདག་ཡིད་ལས་བསལ་གང་དུ་འགྲོ་བར་འགྱུར། ། <br> གང་དུ་གནས་ནས་བདག་གནོད་བྱ་ཕྱིར་འོང་། ། <br> བློ་ཞེན་བདག་ལ་བརྩོན་པ་མེད་པར་ཟད། ། <br> <br>",
                        "ཉོན་མོངས་རྣམས་ནི་ཡུལ་ན་མི་གནས་དབང་ཚོགས་ལ་མིན་པར་ནའང་མིན། ། <br> དེ་ལས་གཞན་ནའང་མིན་ན་འདི་དག་གར་གནས་འགྲོ་བ་ཀུན་གནོད་བྱེད། ། <br> འདི་ནི་སྒྱུ་འདྲ་དེ་ཕྱིར་སྙིང་ལ་འཇིགས་སྤོངས་ཤེས་ཕྱིར་བརྩོན་པ་བསྟེན། ། <br> དོན་མེད་ཉིད་དུ་བདག་ལ་དམྱལ་སོགས་རྣམས་སུ་ཅི་སྟེ་གནོད་པ་བྱེད། ། <br> <br>",
                        "དེ་ལྟར་རྣམ་བསམས་ཇི་སྐད་བཤད་པ་ཡི། ། <br> བསླབ་པ་བསྒྲུབ་པའི་ཆེད་དུ་འབད་པར་བྱ། ། <br> སྨན་པའི་ངག་མ་མཉན་ན་སྨན་དག་གིས། ། <br> བཅོས་དགོས་ནད་པ་སོས་པ་ག་ལ་ཡོད། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། བག་ཡོད་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བཞི་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "བསླབ་པ་བསྲུང་བར་འདོད་པ་ཡིས། ། <br> རབ་ཏུ་བསྒྲིམས་ནས་སེམས་བསྲུང་སྟེ། ། <br> སེམས་འདི་བསྲུང་བར་མ་བྱས་ན། ། <br> བསླབ་པ་བསྲུང་བར་ཡོང་མི་ནུས། ། <br> <br>",
                        "སེམས་ཀྱི་གླང་པོ་ཡན་བཏང་བས། ། <br> མནར་མེད་གནོད་པ་བྱེད་པ་ལྟར། ། <br> གླང་ཆེན་མ་ཐུལ་མྱོས་པ་ཡིས། ། <br> འདི་ན་དེ་འདྲའི་གནོད་མི་བྱེད། ། <br> <br>",
                        "ཀུན་ནས་དྲན་པའི་ཐག་པ་ཡིས། ། <br> སེམས་ཀྱི་གླང་པོ་དམ་བཏགས་ན། ། <br> འཇིགས་པ་ཐམས་ཅད་མེད་འགྱུར་ཞིང་། ། <br> དགེ་བ་ཐམས་ཅད་ལག་ཏུ་འོང་། ། <br> <br>",
                        "སྟག་དང་སེང་གེ་གླང་ཆེན་དྲེད། ། <br> སྦྲུལ་དང་དགྲ་རྣམས་ཐམས་ཅད་དང་། ། <br> སེམས་ཅན་དམྱལ་བའི་སྲུང་མ་དང་། ། <br> བྱད་མ་དེ་བཞིན་སྲིན་པོ་རྣམས། ། <br> <br>",
                        "སེམས་འདི་གཅིག་པུ་བཏགས་པ་ཡིས། ། <br> དེ་དག་ཐམས་ཅད་བཏགས་པར་འགྱུར། ། <br> སེམས་འདི་གཅིག་པུ་བཏུལ་བས་ན། ། <br> དེ་དག་ཐམས་ཅད་ཐུལ་བར་འགྱུར། ། <br> <br>",
                        "འདི་ལྟར་འཇིགས་པ་ཐམས་ཅད་དང་། ། <br> སྡུག་བསྔལ་དཔག་ཏུ་མེད་པ་ཡང་། ། <br> སེམས་ལས་བྱུང་བ་ཡིན་ནོ་ཞེས། ། <br> ཡང་དག་གསུང་བ་ཉིད་ཀྱིས་བསྟན། ། <br> <br>",
                        "སེམས་ཅན་དམྱལ་བའི་མཚོན་ཆ་རྣམས། ། <br> སུ་ཞིག་གིས་ནི་ཆེད་དུ་བྱས། ། <br> ལྕགས་སྲེག་ས་གཞི་སུ་ཡིས་བྱས། ། <br> མེ་ཚོགས་དེ་དག་ཅི་ལས་བྱུང་། ། <br> <br>",
                        "དེ་འདྲ་དེ་དག་ཐམས་ཅད་ཀྱང་། ། <br> སྡིག་སེམས་ཡིན་པར་ཐུབ་པས་གསུངས། ། <br> དེ་ལྟར་འཇིག་རྟེན་གསུམ་པོ་ན། ། <br> སེམས་ལས་འཇིགས་པ་གཞན་འགའ་མེད། ། <br> <br>",
                        "གལ་ཏེ་འགྲོ་བ་དབུལ་བོར་ནས། ། <br> སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་ཡིན་ན། ། <br> ད་རུང་འགྲོ་བཀྲེན་ཡོད་ན་སྔོན། ། <br> སྐྱོབ་པ་ཇི་ལྟར་ཕ་རོལ་ཕྱིན། ། <br> <br>",
                        "བདོག་པ་ཐམས་ཅད་འབྲས་བཅས་ཏེ། ། <br> སྐྱེ་བོ་ཀུན་ལ་བཏང་སེམས་ཀྱིས། ། <br> སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་གསུངས་ཏེ། ། <br> དེ་ལྟས་དེ་ནི་སེམས་ཉིད་དོ། ། <br> <br>",
                        "ཉ་ལ་སོགས་པ་གང་ཞིག་ཏུ། ། <br> དེ་དག་གསོད་མི་འགྱུར་བར་བསྐྲད། ། <br> སྤོང་བའི་སེམས་ནི་ཐོབ་པ་ལས། ། <br> ཚུལ་ཁྲིམས་ཕ་རོལ་ཕྱིན་པར་བཤད། ། <br> <br>",
                        "སེམས་ཅན་མི་སྲུན་ནམ་མཁའ་བཞིན། ། <br> དེ་དག་གཞོམ་གྱིས་ཡོང་མི་ལང་། ། <br> ཁྲོ་བའི་སེམས་འདི་གཅིག་བཅོམ་ན། ། <br> དགྲ་དེ་ཐམས་ཅད་ཆོམས་དང་འདྲ། ། <br> <br>",
                        "ས་སྟེངས་འདི་དག་ཀོས་གཡོགས་སུ། ། <br> དེ་སྙེད་ཀོ་བས་ག་ལ་ལང་། ། <br> ལྷམ་མཐིལ་ཙམ་གྱི་ཀོ་བས་ནི། ། <br> ས་སྟེངས་ཐམས་ཅད་གཡོགས་དང་འདྲ། ། <br> <br>",
                        "དེ་བཞིན་ཕྱི་རོལ་དངོས་པོ་ཡང་། ། <br> བདག་གིས་ཕྱིར་བཟློག་མི་ལང་གི། ། <br> བདག་གི་སེམས་འདི་ཕྱིར་བཟློག་བྱའི། ། <br> གཞན་རྣམས་བཟློག་གོ་ཅི་ཞིག་དགོས། ། <br> <br>",
                        "སེམས་གསལ་གཅིག་བསྐྱེད་འབྲས་བུ་གང་། ། <br> ཚངས་ལ་སོགས་པ་ཡིན་པ་ལྟར། ། <br> ལུས་ངག་བཅས་པའི་འབྲས་བུ་མང་། ། <br> སྤྱོད་པ་ཞན་པས་དེ་ལྟ་མིན། ། <br> <br>",
                        "བཟླས་བརྗོད་དང་ནི་དཀའ་ཐུབ་ཀུན། ། <br> ཡུན་རིང་དུས་སུ་སྤྱད་བྱས་ཀྱང་། ། <br> སེམས་གཞན་གཡེངས་པས་བྱས་པ་ནི། ། <br> དེ་ཉིད་རིག་པས་དོན་མེད་གསུངས། ། <br> <br>",
                        "གང་གིས་ཆོས་ཀྱི་གཙོ་བོ་མཆོག ། <br> སེམས་ཀྱི་གསང་འདི་མ་ཤེས་ན། ། <br> བདེ་ཐོབ་སྡུག་བསྔལ་གཞོམ་འདོད་ཀྱང་། ། <br> དེ་དག་དོན་མེད་གྱི་ནར་འཁྱམ། ། <br> <br>",
                        "དེ་ལྟས་བདག་གི་སེམས་འདི་ནི། ། <br> ལེགས་གཟུང་ལེགས་པར་བསྲུང་བར་བྱ། ། <br> སེམས་བསྲུང་བརྟུལ་ཞུགས་མ་གཏོགས་པ། ། <br> བརྟུལ་ཞུགས་མང་པོས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "མ་གྲངས་དྲོལ་བའི་ཁྲོད་གནས་ན། ། <br> སྒྲིམས་ཏེ་རྨ་ཡི་བག་བྱེད་བཞིན། ། <br> སྐྱེ་བོ་ངན་ཁྲོད་གནས་པས་ཀྱང་། ། <br> སེམས་ཀྱི་རྨ་འདི་རྟག་ཏུ་བསྲུང་། ། <br> <br>",
                        "རྨ་ཡི་སྡུག་བསྔལ་ཆུང་ངུ་ཡིས། ། <br> སྐྲག་པའང་རྨ་ཡི་བག་བྱེད་ན། ། <br> བསྡུས་འཇོམས་རིས་འཇོམས་སྐྲག་པ་དག ། <br> སེམས་ཀྱི་རྨ་ལྟ་ཅིས་མི་སྲུང་། ། <br> <br>",
                        "སྤྱོད་པ་འདི་འདྲས་གནས་བྱེད་ན། ། <br> སྐྱེ་བོ་ངན་པའི་ཁྲོད་གནས་སམ། ། <br> བུད་མེད་ཁྲོད་ན་གནས་ཀྱང་རུང་། ། <br> སྡོམ་བརྩོན་བརྟན་པ་ཉམས་མི་འགྱུར། ། <br> <br>",
                        "བདག་གི་རྙེད་དང་བཀུར་སྟི་དང་། ། <br> ལུས་དང་འཚོ་བ་མེད་བླ་ཞིང་། ། <br> དགེ་བ་གཞན་ཡང་ཉམས་བླ་ཡི། ། <br> སེམས་ནི་ནམས་ཀྱང་ཉམས་མི་བྱ། ། <br> <br>",
                        "སེམས་བསྲུང་འདོད་པ་རྣམས་ལ་ནི། ། <br> དྲན་པ་དང་ནི་ཤེས་བཞིན་དག ། <br> ཐམས་ཅད་འབད་པས་སྲུངས་ཤིག་ཅེས། ། <br> བདག་ནི་དེ་ལྟར་ཐལ་མོ་སྦྱོར། ། <br> <br>",
                        "ནད་ཀྱིས་དཀྲུགས་པའི་མི་དག་ནི། ། <br> ལས་རྣམས་ཀུན་ལ་མཐུ་མེད་པ། ། <br> དེ་བཞིན་རྨོངས་པས་སེམས་དཀྲུགས་པ། ། <br> ལས་རྣམས་ཀུན་ལ་མཐུ་མེད་དོ། ། <br> <br>",
                        "ཤེས་བཞིན་མེད་པའི་སེམས་ལྡན་པའི། ། <br> ཐོས་དང་བསམས་དང་བསྒོམས་པ་ཡང་། ། <br> གློ་རྡོལ་བུམ་པའི་ཆུ་བཞིན་དུ། ། <br> དྲན་པ་ལ་ནི་དེ་མི་གནས། ། <br> <br>",
                        "ཐོས་ལྡན་དད་པ་ཅན་དང་ནི། ། <br> བརྩོན་པ་ལྷུར་ལེན་དུ་མ་ཡང་། ། <br> ཤེས་བཞིན་མེད་པའི་སྐྱོན་ཆགས་པས། ། <br> ལྟུང་བའི་རྙོག་དང་བཅས་པར་འགྱུར། ། <br> <br>",
                        "ཤེས་བཞིན་མེད་པའི་ཆོམ་རྐུན་དག ། <br> དྲན་པ་ཉམས་པའི་རྗེས་འབྲང་བས། ། <br> བསོད་ནམས་དག་ནི་ཉེར་བསགས་ཀྱང་། ། <br> རྐུན་པོས་ཕྲོགས་བཞིན་ངན་འགྲོར་འགྲོ། ། <br> <br>",
                        "ཉོན་མོངས་ཆོམ་རྐུན་ཚོགས་འདི་ནི། ། <br> གླགས་སྐབས་ཚོལ་བར་བྱེད་པ་སྟེ། ། <br> གླགས་རྙེད་གྱུར་ནས་དགེ་འཕྲོག་ཅིང་། ། <br> བདེ་འགྲོའི་སྲོག་ཀྱང་འཇོམས་པར་བྱེད། ། <br> <br>",
                        "དེ་བས་དྲན་པ་ཡིད་སྒོ་ནས། ། <br> གུད་དུ་ནམ་ཡང་མི་གཏོང་ངོ་། ། <br> སོང་ནའང་ངན་འགྲོ་གནོད་པ་དག ། <br> དྲན་པར་བྱས་ཏེ་ཉེ་བར་བཞག ། <br> <br>",
                        "བླ་མ་དང་ནི་འགྲོགས་པ་ལས། ། <br> མཁན་པོས་རྗེས་སུ་བརྟན་པ་དང་། ། <br> འཇིགས་པས་སྐལ་ལྡན་གུས་བྱེད་ལ། ། <br> དྲན་པ་བདེ་བླག་ཉིད་དུ་སྐྱེ། ། <br> <br>",
                        "སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་དག ། <br> ཀུན་དུ་ཐོགས་མེད་གཟིགས་པར་ལྡན། ། <br> དེ་དག་ཐམས་ཅད་སྤྱན་སྔ་ན། ། <br> རྟག་པར་བདག་ནི་གནས་སོ་ཞེས། ། <br> <br>",
                        "དེ་ལྟར་བསམས་ནས་ངོ་ཚ་དང་། ། <br> གུས་དང་འཇིགས་ལྡན་དེ་བཞིན་གནོས་། ། <br> དེས་ན་སངས་རྒྱས་རྗེས་དྲན་པའང་། ། <br> དེ་ལ་ཡང་དང་ཡང་དུ་འབྱུང་། ། <br> <br>",
                        "གང་ཚེ་དྲན་པ་ཡིད་སྒོ་ནས། ། <br> བསྲུང་བའི་དོན་དུ་གནས་གྱུར་པ། ། <br> དེ་ཚེ་ཤེས་བཞིན་འོང་འགྱུར་ཞིང་། ། <br> སོང་བ་དག་ཀྱང་འོང་བར་འགྱུར། ། <br> <br>",
                        "རེ་ཞིག་དང་པོ་འདི་འདྲའི་སེམས། ། <br> འདི་ནི་སྐྱོན་བཅས་ཤེས་བྱས་ནས། ། <br> དེ་ཚེ་བདག་གིས་ཤིང་བཞིན་དུ། ། <br> ཟུངས་ཐུབ་པར་ནི་གནས་པར་བྱ། ། <br> <br>",
                        "དོན་མེད་གཡེང་བར་ལྟ་བ་ནི། ། <br> ནམ་ཡང་བདག་གིས་མི་བྱ་སྟེ། ། <br> ངེས་པར་སེམས་པས་རྟག་ཏུ་ནི། ། <br> མིག་ནི་ཕབ་སྟེ་བལྟ་བར་བྱ། ། <br> <br>",
                        "ལྟ་བ་ངལ་བསོའི་ཆེད་དུ་ནི། ། <br> རེས་འགའ་ཕྱོགས་སུ་བལྟ་བར་བྱ། ། <br> འགའ་ཞིག་མིག་ལམ་སྣང་གྱུར་ན། ། <br> བལྟས་ནས་འོངས་པ་ལེགས་ཞེས་བརྗོད། ། <br> <br>",
                        "ལམ་སོགས་འཇིགས་པ་བརྟག་པའི་ཕྱིར། ། <br> ཡང་དང་ཡང་དུ་ཕྱོགས་བཞིར་ལྟ། ། <br> ངལ་བསོས་ཁ་ནི་ཕྱིར་བལྟས་ནས། ། <br> རྒྱབ་ཀྱི་ཕྱོགས་སུ་བལྟ་བར་བྱ། ། <br> <br>",
                        "མདུན་དང་རྒྱབ་ཏུ་བརྟག་བྱས་ནས། ། <br> འགྲོའམ་ཡང་ན་འོང་བྱ་སྟེ། ། <br> དེ་ལྟར་གནས་སྐབས་ཐམས་ཅད་དུ། ། <br> དགོས་པ་ཤེས་ནས་སྤྱད་པར་བྱ། ། <br> <br>",
                        "ལུས་ཀྱིས་འདི་ལྟར་གནས་བྱ་ཞེས། ། <br> བྱ་བ་བསྡོགས་ནས་དེ་ནས་ནི། ། <br> སྐབས་སུ་ལུས་འདི་ཇི་ལྟ་བུར། ། <br> གནས་པ་ཡིན་ཞེས་བལྟ་བར་བྱ། ། <br> <br>",
                        "སེམས་ཀྱི་གླང་ཆེན་མྱོས་པ་ནི། ། <br> ཆོས་ལ་སེམས་པའི་ཀ་ཆེན་ལ། ། <br> ཇི་ལྟར་བཏགས་པ་མི་འཆོར་བར། ། <br> དེ་ལྟར་འབད་པ་ཀུན་གྱིས་བརྟག ། <br> <br>",
                        "ཅི་ནས་ཏིང་འཛིན་བརྩོན་པ་ནི། ། <br> སྐད་ཅིག་གཅིག་ཀྱང་མི་འཆོར་བར། ། <br> བདག་གི་ཡིད་འདི་གར་སྤྱོད་ཅེས། ། <br> དེ་ལྟར་ཡིད་ལ་སོ་སོར་བརྟག ། <br> <br>",
                        "འཇིགས་དང་དགའ་སྟོན་སོགས་འབྲེལ་བར། ། <br> གལ་ཏེ་མི་ནུས་ཅི་བདེར་བྱ། ། <br> འདི་ལྟར་སྦྱིན་པའི་དུས་དག་ཏུ། ། <br> ཚུལ་ཁྲིམས་བཏང་སྙོམས་བྱ་བར་གསུངས། ། <br> <br>",
                        "གང་ཞིག་བསམས་ཏེ་བྱར་བརྩམས་པ། ། <br> དེ་ལས་གཞན་དུ་མི་བསམ་སྟེ། ། <br> དེར་གཏང་བ་ཡི་བསམ་པ་ཡིས། ། <br> དེ་ཉིད་རེ་ཞིག་བསྒྲུབ་པར་བྱ། ། <br> <br>",
                        "དེ་ལྟ་ན་ནི་ཀུན་ལེགས་བྱས། ། <br> གཞན་དུ་གཉི་གར་མི་འགྱུར་རོ། ། <br> ཤེས་བཞིན་མ་ཡིན་ཉེ་ཉོན་མོངས། ། <br> དེ་ལྟ་ན་ནི་འཕེལ་མི་འགྱུར། ། <br> <br>",
                        "བྲེ་མོའི་གཏམ་ནི་སྣ་ཚོགས་དང་། ། <br> ངོ་མཚར་ལྟད་མོ་རྣམ་མང་པོ། ། <br> ཀུན་ལ་འཇུག་པར་གྱུར་པ་ན། ། <br> དེ་ལ་ཆགས་པ་སྤང་བར་བྱ། ། <br> <br>",
                        "དོན་མེད་ས་རྐོ་རྩྭ་གཅོད་དང་། ། <br> ས་རིས་འདྲི་སོགས་བྱེད་གྱུར་ན། ། <br> བདེ་གཤེགས་བསླབ་པ་དྲན་བྱས་ནས། ། <br> སྐྲག་པས་དེ་ཡི་མོད་ལ་དོར། ། <br> <br>",
                        "གང་ཚེ་བསྐྱོད་པར་འདོད་གྱུར་ཏམ། ། <br> སྨྲ་བར་འདོད་པར་གྱུར་ན་ཡང་། ། <br> དང་པོར་རང་གི་སེམས་བརྟགས་ནས། ། <br> བརྟན་པས་རིག་པ་ལྡན་པར་བྱ། ། <br> <br>",
                        "གང་ཚེ་རང་ཡིད་ཆགས་པ་དང་། ། <br> ཁྲོ་བར་འདོད་པ་དེ་ཡི་ཚེ། ། <br> ལས་སུ་མི་བྱ་སྨྲ་མི་བྱ། ། <br> ཤིང་བཞིན་དུ་ནི་གནས་པར་བྱ། ། <br> <br>",
                        "དགོད་དང་ག་ཞར་བཅས་པའམ། ། <br> གལ་ཏེ་ང་རྒྱལ་རྒྱགས་ལྡན་པའམ། ། <br> མཚང་འབྲུ་བ་ཡི་བསམ་པ་དང་། ། <br> གལ་ཏེ་སྐྱོར་འབྱིན་སླུ་སེམས་སམ། ། <br> <br>",
                        "གང་ཚེ་བདག་བསྟོད་ལྷུར་ལེན་པའམ། ། <br> གཞན་ལ་སྨོད་པ་ཉིད་དང་ནི། ། <br> གཤེ་བཅས་འགྱོད་དང་བཅས་གྱུར་པ། ། <br> དེ་ཚེ་ཤིང་བཞིན་གནས་པར་བྱ། ། <br> <br>",
                        "རྙེད་དང་བཀུར་སྟི་གྲགས་འདོད་པའམ། ། <br> གཡོག་འཁོར་དོན་དུ་གཉེར་འདོད་པའམ། ། <br> བདག་སེམས་རིམ་གྲོ་འདོད་གྱུར་ན། ། <br> དེ་ཚེ་ཤིང་བཞིན་གནས་པར་བྱ། ། <br> <br>",
                        "གཞན་དོན་ཡལ་བར་འདོར་བ་དང་། ། <br> རང་དོན་གཉེར་བར་འདོད་པ་དང་། ། <br> སྨྲ་བར་འདོད་པའི་སེམས་བྱུང་ན། ། <br> དེས་ནི་ཤིང་བཞིན་གནས་པར་བྱ། ། <br> <br>",
                        "མི་བཟོད་ལེ་ལོ་འཇིགས་པ་དང་། ། <br> དེ་བཞིན་སྤྱི་རྟོལ་མུ་ཅོར་དང་། ། <br> རང་གི་ཕྱོགས་ཞེན་སེམས་བྱུང་ན། ། <br> དེ་ཚེ་ཤིང་བཞིན་གནས་པར་བྱ། ། <br> <br>",
                        "དེ་ལྟར་ཀུན་ནས་ཉོན་མོངས་དང་། ། <br> དོན་མེད་བརྩོན་པའི་ཡིད་བརྟགས་ནས། ། <br> དེ་ཚེ་དཔའ་བོས་གཉེན་པོ་ཡིས། ། <br> དེ་ནི་བརྟན་པོར་གཟུང་བར་བྱ། ། <br> <br>",
                        "ཤིན་ཏུ་ངེས་དང་རབ་དད་དང་། ། <br> བརྟན་དང་གུས་དང་ཞེ་སར་བཅས། ། <br> ངོ་ཚ་ཤེས་དང་འཇིགས་བཅས་དང་། ། <br> ཞི་ཞིང་གཞན་དགའ་བྱེད་ལ་བརྩོན། ། <br> <br>",
                        "ཕན་ཚུན་མི་མཐུན་བྱིས་པ་ཡི། ། <br> འདོད་པ་རྣམས་ཀྱིས་མི་སྐྱོ་ཞིང་། ། <br> ཉོན་མོངས་སྐྱེས་པ་འདི་དག་གི། ། <br> སེམས་འདི་བྱུང་སྙམ་བརྩེར་ལྡན་དང་། ། <br> <br>",
                        "ཁ་ན་མ་ཐོ་མེད་དངོས་ལ། ། <br> བདག་དང་སེམས་ཅན་དབང་བྱས་ཤིང་། ། <br> སྤྲུལ་པ་བཞིན་དུ་ང་མེད་པར། ། <br> ཡིད་འདི་རྟག་ཏུ་གཟུང་བར་བྱ། ། <br> <br>",
                        "རིང་ཞིག་ལོན་ནས་དལ་བའི་མཆོག ། <br> ཐོབ་པ་ཡང་དང་ཡང་བསམས་ནས། ། <br> སེམས་དེ་ལྟ་བུར་རི་རབ་ལྟར། ། <br> རབ་ཏུ་མི་གཡོ་གཟུང་བར་བྱ། ། <br> <br>",
                        "བྱ་རྒོད་ཤ་ལ་ཆགས་པ་ཡིས། ། <br> ཕན་ཚུན་ཀུན་དུ་བཤལ་ཁྲིད་ཀྱང་། ། <br> ཡིད་ཁྱོད་མི་དགར་མི་བྱེད་ན། ། <br> ད་ལྟ་ཅི་ཕྱིར་ཁ་ཏ་བྱེད། ། <br> <br>",
                        "ལུས་འདི་བདག་གིར་གཟུང་བྱས་ནས། ། <br> ཡིད་ཁྱོད་ཅི་ཕྱིར་སྲུང་བར་བྱེད། ། <br> ཁྱོད་དང་འདི་གཉིས་སོ་སོ་ན། ། <br> དེས་ཀོ་ཁྱོད་ལ་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "རྨོངས་པའི་ཡིད་ཁྱོད་ཅི་ཡི་ཕྱིར། ། <br> ཤིང་གཟུགས་གཙང་མ་གཟུང་མི་བྱེད། ། <br> མི་གཙང་ཚོགས་ཀྱི་འཁྲུལ་འཁོར་འདི། ། <br> རུལ་བ་བསྲུངས་ཏེ་ཅི་ཞིག་རུང་། ། <br> <br>",
                        "ཐོག་མར་པགས་པའི་རིམ་པ་འདི། ། <br> རང་གི་བློ་ཡིས་ཐ་དད་ཕྱེ། ། <br> ཤ་ཡང་རུས་པའི་དྲ་བ་ལས། ། <br> ཤེས་རབ་མཚོན་གྱིས་གུད་དུ་ཕྱེ། ། <br> <br>",
                        "རུས་པ་རྣམས་ཀྱང་དབྱེ་བྱས་ནས། ། <br> རྐང་གི་བར་དུ་བལྟ་བྱ་ཞིང་། ། <br> འདི་ལ་སྙིང་པོ་ཅི་ཡོད་ཅེས། ། <br> བདག་ཉིད་ཀྱིས་ནི་བརྟག་པར་གྱིས། ། <br> <br>",
                        "དེ་ལྟར་འབད་དེ་བཙལ་ཀྱང་དེར། ། <br> ཁྱོད་ཀྱིས་སྙིང་པོ་མ་མཐོང་ན། ། <br> ད་དུང་ཅི་ཕྱིར་ཆགས་ཚུལ་གྱིས། ། <br> ཁྱོད་ནི་ལུས་འདི་སྲུང་བར་བྱེད། ། <br> <br>",
                        "ཁྱོད་ཀྱིས་མི་གཙང་བཟར་མི་རུང་། ། <br> ཁྲག་ཀྱང་བཏུང་དུ་མི་རུང་ལ། ། <br> རྒྱུ་ལྟོའང་གཞིབ་ཏུ་མི་རུང་ན། ། <br> ལུས་ཀྱིས་ཁྱོད་ལ་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "ཉིས་ན་ཝ་དང་བྱ་རྒོད་ཀྱིས། ། <br> ཟས་ཀྱི་དོན་དུ་འདི་བསྲུང་རིགས། ། <br> མི་འོ་ཅོག་གི་ལུས་འདི་ནི། ། <br> བཀོལ་བར་བྱ་བ་ཉིད་དུ་ཟད། ། <br> <br>",
                        "འདི་ལྟར་ཁྱོད་ཀྱིས་བསྲུངས་ཀྱང་ནི། ། <br> འཆི་བདག་བརྩེ་བ་མེད་པ་ཡིས། ། <br> ཕྲོགས་ཏེ་བྱ་དང་ཁྱིར་བྱིན་ན། ། <br> དེ་ཚེ་ཁྱོད་ཀྱིས་ཅི་བྱར་ཡོད། ། <br> <br>",
                        "བྲན་གཡོག་བཀོལ་དུ་མི་བཏུབ་ལའང་། ། <br> གོས་ལ་སོགས་པ་མི་སྦྱིན་ན། ། <br> ལུས་འདི་བསྙོད་ཀྱང་གཞན་འགྲོ་ན། ། <br> ཁྱོད་ཀོ་ཅི་སྟེ་ཤ་ཐང་གསོ། ། <br> <br>",
                        "འདི་ལ་གླ་རྔན་བྱིན་ནས་ནི། ། <br> ད་ནི་རང་གི་དོན་བྱེད་ཆུག ། <br> ཕན་པ་མེད་པར་འདི་ལ་ནི། ། <br> ཐམས་ཅད་སྦྱིན་པར་མི་བྱའོ། ། <br> <br>",
                        "འགྲོ་དང་འོང་བའི་རྟེན་ཙམ་དུ། ། <br> ལུས་ལ་གྲུ་ཡི་བློ་བཞག་སྟེ། ། <br> སེམས་ཅན་རྣམས་དོན་བསྒྲུབ་པའི་ཕྱིར། ། <br> ཡིད་བཞིན་གྱི་ནི་ལུས་སུ་བསྒྱུར། ། <br> <br>",
                        "དེ་ལྟར་རང་དབང་ཡོད་ཀྱིས་དེ། ། <br> རྟག་ཏུ་འཛུམ་པའི་བཞིན་དུ་གྱིས། ། <br> ཁྲོ་གཉེར་ངོ་ཟུམ་ཡོངས་ཐོང་སྟེ། ། <br> འགྲོ་བའི་བཤེས་དང་གསོང་པོར་གྱིས། ། <br> <br>",
                        "ཁྲི་ལ་སོགས་པ་བབ་ཅོལ་དུ། ། <br> སྒྲ་དང་བཅས་པར་མི་དོར་རོ། ། <br> སྒོ་ཡང་དྲག་ཏུ་མི་དབྱེ་སྟེ། ། <br> རྟག་ཏུ་གཅོམ་བསྐྱུངས་དགའ་བར་བྱ། ། <br> <br>",
                        "ཆུ་སྐྱར་བྱི་ལ་ཆོམ་རྐུན་དག ། <br> སྒྲ་མེད་འཇབ་ཅིང་འགྲོ་བ་ཡིས། ། <br> མངོན་པར་འདོད་པའི་དོན་སྒྲུབ་པ། ། <br> ཐུབ་པས་རྟག་ཏུ་དེ་བཞིན་སྤྱད། ། <br> <br>",
                        "གཞན་ལ་བཞེན་བསྐུལ་འདེབས་མཁས་ཤིང་། ། <br> མ་བཅོལ་ཕན་པ་བྱེད་པའི་ངག ། <br> གུས་པས་སྤྱི་བོས་བླང་གྱིས་ཏེ། ། <br> རྟག་ཏུ་ཀུན་གྱི་སློབ་མར་གྱུར། ། <br> <br>",
                        "ལེགས་པར་སྨས་པ་ཐམས་ཅད་ལ། ། <br> དགེ་བར་གསུངས་ཞེས་བརྗོད་པར་བྱ། ། <br> བསོད་ནམས་བྱེད་པ་མཐོང་གྱུར་ན། ། <br> བསྟོད་པས་ལེགས་པར་དགའ་བ་བསྐྱེད། ། <br> <br>",
                        "ལྐོག་ན་ཡོན་ཏན་བརྗོད་བྱ་ཞིང་། ། <br> ཡོན་ཏན་བརྗོད་ན་རྗེས་སུ་བརྗོད། ། <br> རང་གི་ཡོན་ཏན་བརྗོད་ན་དེ། ། <br> ཡོན་ཏན་ཤེས་པར་རིག་པར་བྱ། ། <br> <br>",
                        "རྩོམ་པ་ཐམས་ཅད་དགའ་ཕྱིར་ཏེ། ། <br> དེ་ནི་རིན་གྱིས་ཉོ་ནའང་དཀོན། ། <br> དེ་ལྟས་གཞན་བྱས་ཡོན་ཏན་གྱིས། ། <br> དགའ་བའི་བདེ་བ་སྤྱད་པར་བྱ། ། <br> <br>",
                        "བདག་ལ་འདིར་གོང་ཡོང་མེད་ལ། ། <br> ཕ་རོལ་དུ་ཡང་བདེ་བ་ཆེ། ། <br> ཉེས་པས་མི་དགའ་སྡུག་བསྔལ་ཞིང་། ། <br> ཕ་རོལ་དུ་ཡང་སྡུག་བསྔལ་ཆེ། ། <br> <br>",
                        "སྨྲ་ན་ཡིད་ཕེབས་འབྲེལ་པ་དང་། ། <br> དོན་གསལ་ཡིད་དུ་འོང་བ་དང་། ། <br> ཆགས་དང་ཞེ་སྡང་སྤངས་པ་དང་། ། <br> འཇམ་ཞིང་རན་པར་སྨྲ་བར་བྱ། ། <br> <br>",
                        "མིག་གིས་སེམས་ཅན་ལྟ་ན་ཡང་། ། <br> འདི་དག་ཉིད་ལ་བརྟེན་ནས་བདག ། <br> སངས་རྒྱས་ཉིད་དུ་འགྱུར་རོ་ཞེས། ། <br> དྲང་ཞིང་བྱམས་པའི་ཚུལ་གྱིས་བལྟ། ། <br> <br>",
                        "རྟག་པར་མངོན་ཞེན་གྱིས་བསླང་བའམ། ། <br> གཉེན་པོ་ཡིས་ནི་བསླང་བ་ཉིད། ། <br> ཡོན་ཏན་དང་ནི་ཕན་འདོགས་ཞིང་། ། <br> སྡུག་བསྔལ་བ་ལ་དགེ་ཆེན་འགྱུར། ། <br> <br>",
                        "མཁས་ཤིང་ལྡང་དང་ལྡན་བྱས་ནས། ། <br> ལས་རྣམས་བདག་གིས་རྟག་ཏུ་བྱ། ། <br> ལས་རྣམས་ཀུན་ལ་སུ་ལ་ཡང་། ། <br> ལྟོས་པར་བྱ་བ་མ་ཡིན་ནོ། ། <br> <br>",
                        "སྦྱིན་པའི་ཕ་རོལ་ཕྱིན་ལ་སོགས། ། <br> གོང་ནས་གོང་དུ་ཁྱད་ཞུགས་སྤྱད། ། <br> ཆུང་ངུའི་ཕྱིར་ནི་ཆེ་མི་གཏང་། ། <br> གཙོ་ཆེར་གཞན་གྱི་དོན་བསམ་མོ། ། <br> <br>",
                        "དེ་ལྟར་རིག་བྱས་གཞན་དོན་ལ། ། <br> རྟག་ཏུ་བརྩོན་པར་གནས་པར་བྱ། ། <br> ཐུགས་རྗེ་མངའ་བ་རིང་གཟིགས་པས། ། <br> བཀག་པ་རྣམས་ཀྱང་དེ་ལ་གནང་། ། <br> <br>",
                        "ལོག་པར་ལྷུང་དང་མགོན་མེད་དང་། ། <br> བརྟུལ་ཞུགས་གནས་ལ་བགོ་བྱ་ཞིང་། ། <br> རན་པ་ཙམ་དུ་བཟའ་བྱ་སྟེ། ། <br> ཆོས་གོས་གསུམ་མ་གཏོགས་པ་སྦྱིན། ། <br> <br>",
                        "དམ་པའི་ཆོས་ནི་སྤྱོད་པའི་ལུས། ། <br> ཕྲན་ཚེགས་ཆེད་དུ་གནོད་མི་བྱ། ། <br> དེ་ལྟར་བྱས་ན་སེམས་ཅན་གྱི། ། <br> བསམ་པ་མྱུར་དུ་རྫོགས་པར་འགྱུར། ། <br> <br>",
                        "སྙིང་རྗེའི་བསམ་པ་མ་དག་པར། ། <br> ལུས་འདི་གཏང་བར་མི་བྱ་སྟེ། ། <br> ཅི་ནས་འདི་དང་གཞན་དུ་ཡང་། ། <br> དོན་ཆེན་སྒྲུབ་པའི་རྒྱུར་གཏང་ངོ་། ། <br> <br>",
                        "མ་གུས་པ་ལ་ཆོས་མི་བཤད། ། <br> མི་ན་བཞིན་དུ་མགོ་དཀྲིས་དང་། ། <br> གདུགས་དང་འཁར་བ་མཚོན་ཐོགས་དང་། ། <br> མགོ་བོ་གཡོགས་པ་དག་ལ་མིན། ། <br> <br>",
                        "དམན་ལ་ཟབ་དང་རྒྱ་ཆེ་དང་། ། <br> སྐྱེས་པ་མེད་པར་བུད་མེད་མིན། ། <br> དམན་དང་མཆོག་གི་ཆོས་རྣམས་ལ། ། <br> མཚུངས་པར་གུས་པས་ཀུན་དུ་སྤྱད། ། <br> <br>",
                        "རྒྱ་ཆེན་ཆོས་ཀྱི་སྣོད་གྱུར་པ། ། <br> དམན་པའི་ཆོས་ལ་སྦྱར་མི་བྱ། ། <br> སྤྱོད་པ་ཡོངས་སུ་དོར་མི་བྱ། ། <br> མདོ་དང་སྔགས་ཀྱིས་འདྲིད་མི་བྱ། ། <br> <br>",
                        "སོ་ཤིང་དང་ནི་མཆིལ་མ་དག ། <br> དོར་བ་ན་ནི་དགབ་པར་བྱ། ། <br> གཅི་ལ་སོགས་པའང་ལོངས་སྤྱོད་པའི། ། <br> ཆུ་དང་ཐང་ལ་དོར་བ་སྨད། ། <br> <br>",
                        "ཁ་བཀང་བ་དང་སྒྲ་བཅས་དང་། ། <br> ཁ་གདངས་ནས་ནི་བཟའ་མི་བྱ། ། <br> རྐང་པ་བརྐྱང་སྟེ་མི་འདུག་ཅིང་། ། <br> ལག་པ་མཉམ་པར་མི་མཉེའོ། ། <br> <br>",
                        "བཞོན་པ་མལ་སྟན་གནས་དག་ཏུ། ། <br> བུད་མེད་གཞན་དང་གཅིག་མི་བྱ། ། <br> འཇིག་རྟེན་མ་དད་གྱུར་པ་ཀུན། ། <br> མཐོང་དང་དྲིས་ཏེ་སྤང་བར་བྱ། ། <br> <br>",
                        "སོར་མོས་བརྡ་ནི་མི་བྱ་སྟེ། ། <br> གུས་དང་བཅས་པས་གཡས་པ་ཡི། ། <br> ལག་པ་དག་ནི་ཀུན་གྱིས་ཀྱང་། ། <br> ལམ་ཡང་དེ་ལྟར་བསྟན་པར་བྱ། ། <br> <br>",
                        "ལག་པ་ཤས་ཆེར་བསྐྱོད་མིན་ཏེ། ། <br> ཅུང་ཟད་བསྐྱོད་ལ་སྒྲ་བསྒྲགས་པ། ། <br> སེ་གོལ་ལ་སོགས་བརྡ་བྱས་ཏེ། ། <br> གཞན་དུ་མ་བསྡམས་པར་འགྱུར་རོ། ། <br> <br>",
                        "མགོན་པོ་མྱ་ངན་འདས་གཟིམས་ལྟར། ། <br> འདོད་པའི་ཕྱོགས་སུ་ཉལ་བར་བྱ། ། <br> ཤེས་བཞིན་མྱུར་དུ་ལྡང་སེམས་ལ། ། <br> ཐོག་མ་ཉིད་དུ་ངེས་པར་སྦྱར། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དག ། <br> ཚད་མེད་པར་ནི་གསུངས་པ་ལས། ། <br> སེམས་སྦྱང་བ་ཡི་སྤྱོད་པ་ནི། ། <br> ངེས་པར་དེ་སྲིད་སྤྱད་པར་བྱ། ། <br> <br>",
                        "ཉིན་དང་མཚན་མོ་ལན་གསུམ་དུ། ། <br> ཕུང་པོ་གསུམ་པ་གདོན་བྱ་ཞིང་། ། <br> རྒྱལ་དང་བྱང་ཆུབ་སེམས་བརྟེན་པས། ། <br> ལྟུང་བའི་ལྷག་མ་དེས་ཞི་བྱ། ། <br> <br>",
                        "རང་ངམ་གཞན་གྱི་དབང་ཡང་རུང་། ། <br> གནས་སྐབས་གང་དུ་ཅི་སྤྱོད་ཀྱང་། ། <br> བསླབ་པར་གསུངས་པ་གང་ཡིན་པའི། ། <br> གནས་སྐབས་དེ་ལ་འབད་དེ་བསླབ། ། <br> <br>",
                        "རྒྱལ་སྲས་རྣམས་ཀྱིས་མི་བསླབ་པ། ། <br> དེ་ནི་གང་ཡང་ཡོད་མིན་ཏེ། ། <br> དེ་ལྟར་གནས་པའི་མཁས་པ་ལ། ། <br> བསོད་ནམས་མི་འགྱུར་གང་ཡང་མེད། ། <br> <br>",
                        "དངོས་སམ་ཡང་ན་བརྒྱུད་ཀྱང་རུང་། ། <br> སེམས་ཅན་དོན་ལས་གཞན་མི་སྤྱད། ། <br> སེམས་ཅན་ཁོ་ནའི་དོན་གྱི་ཕྱིར། ། <br> ཐམས་ཅད་བྱང་ཆུབ་ཕྱིར་བསྔོའོ། ། <br> <br>",
                        "རྟག་པར་དགེ་བའི་བཤེས་གཉེན་ནི། ། <br> ཐེག་ཆེན་དོན་ལ་མཁས་པ་དང་། ། <br> བྱང་ཆུབ་སེམས་དཔའི་བརྟུལ་ཞུགས་མཆོག ། <br> སྲོག་གི་ཕྱིར་ཡང་མི་བཏང་ངོ་། ། <br> <br>",
                        "དཔལ་འབྱུང་བ་ཡི་རྣམ་ཐར་ལས། ། <br> བླ་མ་བསྟེན་པའི་ཚུལ་ལྟར་བསླབ། ། <br> འདི་དང་སངས་རྒྱས་བཀའ་སྩལ་གཞན། ། <br> མདོ་སྡེ་བཀླགས་ནས་ཤེས་པར་བྱ། ། <br> <br>",
                        "མདོ་སྡེ་རྣམས་ལས་བསླབ་པ་སྣང་། ། <br> དེ་བས་མདོ་སྡེ་བཀླག་པར་བྱ། ། <br> ནམ་མཁའི་སྙིང་པོའི་མདོ་སྡེ་ནི། ། <br> ཐོག་མ་ཉིད་དུ་བལྟ་བར་བྱ། ། <br> <br>",
                        "གང་ཕྱིར་རྟག་ཏུ་སྤྱད་པ་ནི། ། <br> དེ་ལས་རྒྱ་ཆེར་རབ་སྟོན་པས། ། <br> བསླབ་པ་ཀུན་ལས་བཏུས་པ་ཡང་། ། <br> ངེས་པར་ཡང་དང་ཡང་དུ་བལྟ། ། <br> <br>",
                        "ཡང་ན་རེ་ཞིག་མདོར་བསྡུས་པའི། ། <br> མདོ་རྣམས་ཀུན་ལས་བཏུས་པ་བལྟ། ། <br> འཕགས་པ་ཀླུ་སྒྲུབ་ཀྱིས་མཛད་པའི། ། <br> གཉིས་པོ་འང་འབད་པས་བལྟ་བར་བྱ། ། <br> <br>",
                        "གང་ལས་གང་ནི་མ་བཀག་པ། ། <br> དེ་ཉིད་སྤྱད་པར་བྱ་བ་སྟེ། ། <br> འཇིག་རྟེན་སེམས་ནི་བསྲུང་བའི་ཕྱིར། ། <br> བསླབ་པ་མཐོང་ནས་ཡང་དག་སྤྱད། ། <br> <br>",
                        "ལུས་དང་སེམས་ཀྱི་གནས་སྐབས་ལ། ། <br> ཡང་དང་ཡང་དུ་བརྟག་བྱ་བ། ། <br> དེ་ཉིད་ཁོ་ན་མདོར་ན་ནི། ། <br> ཤེས་བཞིན་བསྲུང་བའི་མཚན་ཉིད་དོ། ། <br> <br>",
                        "ལུས་ཀྱིས་འདི་དག་སྤྱད་པར་བྱ། ། <br> ཚིག་ཙམ་བརྗོད་པས་ཅི་ཞིག་འགྲུབ། ། <br> སྨན་དཔྱད་བཀླགས་པ་ཙམ་གྱིས་ནི། ། <br> ནད་པ་དག་ལ་ཕན་འགྱུར་རམ། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། ཤེས་བཞིན་བསྲུང་བར་བྱ་བ་སྟེ་ལེའུ་ལྔ་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "བསྐལ་པ་སྟོང་དུ་བསགས་པ་ཡི། ། <br> སྦྱིན་དང་བདེ་གཤེགས་མཆོད་ལ་སོགས། ། <br> ལེགས་སྤྱད་གང་ཡིན་དེ་ཀུན་ཡང་། ། <br> ཁོང་ཁྲོ་གཅིག་གིས་འཇོམས་པར་བྱེད། ། <br> <br>",
                        "ཞེ་སྡང་ལྟ་བུའི་སྡིག་པ་མེད། ། <br> བཟོད་པ་ལྟ་བུའི་དཀའ་ཐུབ་མེད། ། <br> དེ་བས་བཟོད་ལ་ནན་ཏན་དུ། ། <br> སྣ་ཚོགས་ཚུལ་དུ་བསྒོམ་པར་བྱ། ། <br> <br>",
                        "ཞེ་སྡང་ཟུག་རྔུའི་སེམས་འཆང་ན། ། <br> ཡིད་ནི་ཞི་བ་ཉམས་མི་མྱོང་། ། <br> དགའ་དང་བདེ་བའང་མི་འཐོབ་ལ། ། <br> གཉིད་མི་འོང་ཞིང་བརྟན་མེད་འགྱུར། ། <br> <br>",
                        "གང་དག་ནོར་དང་བཀུར་སྟི་ཡིས། ། <br> དྲིན་བྱིན་དེ་ལ་བརྟེན་གྱུར་པ། ། <br> དེ་དག་ཀྱང་ནི་སྡང་ལྡན་པའི། ། <br> རྗེ་དཔོན་དེ་ལ་གསོད་པར་རྒོལ། ། <br> <br>",
                        "དེ་ཡིས་མཛའ་བཤེས་སྐྱོ་བར་འགྱུར། ། <br> སྦྱིན་པས་བསྡུས་ཀྱང་བསྟེན་མི་བྱེད། ། <br> མདོར་ན་ཁྲོ་བ་བདེར་གནས་པ། ། <br> དེ་ནི་འགའ་ཡང་ཡོད་མ་ཡིན། ། <br> <br>",
                        "ཁྲོ་བའི་དགྲ་ཡིས་དེ་ལ་སོགས། ། <br> སྡུག་བསྔལ་དག་ནི་བྱེད་པར་འགྱུར། ། <br> གང་ཞིག་བསྒྲིམས་ཏེ་ཁྲོ་འཇོམས་པ། ། <br> དེ་ནི་འདི་དང་གཞན་དུ་བདེ། ། <br> <br>",
                        "མི་འདོད་བྱས་དང་འདོད་པ་ཡི། ། <br> གེགས་བྱས་པ་ལ་བྱུང་གྱུར་པ། ། <br> ཡིད་མི་བདེ་བའི་ཟས་རྙེད་ནས། ། <br> ཞེ་སྡང་བརྟས་ཏེ་བདག་འཇོམས་སོ། ། <br> <br>",
                        "དེ་ལྟས་བདག་གིས་དགྲ་བོ་དེའི། ། <br> ཟས་ནི་རྣམ་པར་གཞོམ་པར་བྱ། ། <br> འདི་ལྟར་བདག་ལ་གནོད་པ་ལས། ། <br> དགྲ་འདི་ལ་ནི་ལས་གཞན་མེད། ། <br> <br>",
                        "ཅི་ལ་བབ་ཀྱང་བདག་གིས་ནི། ། <br> དགའ་བའི་ཡིད་ནི་དཀྲུགས་མི་བྱ། ། <br> མི་དགའ་བྱས་ཀྱང་འདོད་མི་འགྲུབ། ། <br> དགེ་བ་དག་ནི་ཉམས་པར་འགྱུར། ། <br> <br>",
                        "གལ་ཏེ་བཅོས་སུ་ཡོད་ན་ནི། ། <br> དེ་ལ་མི་དགར་ཅི་ཞིག་ཡོད། ། <br> གལ་ཏེ་བཅོས་སུ་མེད་ན་ནི། ། <br> དེ་ལ་མི་དགའ་བྱས་ཅི་ཕན། ། <br> <br>",
                        "བདག་གམ་བདག་གི་བཤེས་རྣམས་ལ། ། <br> སྡུག་བསྔལ་བརྙས་དང་ཚིག་རྩུབ་དང་། ། <br> མི་སྙན་ཞེས་བྱ་མི་འདོད་དེ། ། <br> དགྲ་ལ་དེ་ལས་བཟློག་པས་སོ། ། <br> <br>",
                        "བདེ་བའི་རྒྱུ་ནི་རེས་འགའ་འབྱུང་། ། <br> སྡུག་བསྔལ་རྒྱུ་ནི་ཤིན་ཏུ་མང་། ། <br> སྡུག་བསྔལ་མེད་པར་ངེས་འབྱུང་མེད། ། <br> དེ་བས་སེམས་ཁྱོད་བརྟན་པར་མནོས། ། <br> <br>",
                        "དཀའ་ཟློག་དད་དང་ཀརྣ་པ། ། <br> བསྲེག་དང་བཅད་སོགས་ཚོར་བ་ནི། ། <br> དོན་མེད་བཟོད་བྱེད་ཐར་པ་ཡི། ། <br> དོན་དུ་བདག་གོ་ཅི་ཕྱིར་སྔར། ། <br> <br>",
                        "གོམས་ནི་སླ་བར་མི་འགྱུར་བའི། ། <br> དངོས་དེ་གང་ཡང་ཡོད་མ་ཡིན། ། <br> དེ་བས་གནོད་པ་ཆུང་གོམས་པས། ། <br> གནོད་པ་ཆེན་པོ་བཟོད་པར་བྱོས། ། <br> <br>",
                        "སྦྲུལ་དང་ཤ་སྦྲང་དག་དང་ནི། ། <br> བཀྲེས་སྐོམ་ལ་སོགས་ཚོར་བ་དང་། ། <br> གཡན་པ་ལ་སོགས་བཅས་པ་ཡི། ། <br> དོན་མེད་སྡུག་བསྔལ་ཅིས་མ་མཐོང་། ། <br> <br>",
                        "ཚ་གྲང་ཆར་དང་རླུང་སོགས་དང་། ། <br> ནད་དང་འཆིང་དང་རྡེག་སོགས་ལ། ། <br> བདག་གིས་བཟེ་རེ་མི་བྱ་སྟེ། ། <br> དེ་ལྟར་བྱས་ན་གནོད་པ་འཕེལ། ། <br> <br>",
                        "ལ་ལ་བདག་གི་ཁྲག་མཐོང་ན། ། <br> དཔའ་བརྟན་ལྷག་པར་སྐྱེ་འགྱུར་ཡོད། ། <br> ལ་ལ་གཞན་གྱི་ཁྲག་མཐོང་ན། ། <br> བོག་ཅིང་བརྒྱལ་བར་འགྱུར་བ་ཡོད། ། <br> <br>",
                        "དེ་ནི་སེམས་ཀྱི་ངང་བརྟན་དང་། ། <br> སྡར་མའི་ཚུལ་ལས་གྱུར་པ་ཡིན། ། <br> དེ་བས་གནོད་པ་ཁྱད་བསད་ཅིང་། ། <br> སྡུག་བསྔལ་རྣམས་ཀྱིས་མི་ཚུགས་བྱོས། ། <br> <br>",
                        "མཁས་པས་སྡུག་བསྔལ་བྱུང་ཡང་ནི། ། <br> སེམས་ཀྱི་རབ་དང་རྙོག་མི་བྱ། ། <br> ཉོན་མོངས་རྣམས་དང་གཡུལ་འགྱེད་ལ། ། <br> གཡུལ་འགྱེད་ཚེ་ན་གནོད་པ་མང་། ། <br> <br>",
                        "སྡུག་བསྔལ་ཐམས་ཅད་ཁྱད་བསད་ནས། ། <br> ཞེ་སྡང་ལ་སོགས་དགྲ་འཇོམས་པ། ། <br> དེ་དག་རྒྱལ་བྱེད་དཔའ་བོ་སྟེ། ། <br> ལྷག་མ་རོ་ལ་གསོད་པའོ། ། <br> <br>",
                        "གཞན་ཡང་སྡུག་བསྔལ་ཡོན་ཏན་ནི། ། <br> སྐྱོ་བས་དྲེགས་པ་སེལ་བར་བྱེད། ། <br> འཁོར་བ་པ་ལ་སྙིང་རྗེ་སྐྱེ། ། <br> སྡིག་ལ་འཛེམ་དང་དགེ་ལ་དགའ། ། <br> <br>",
                        "མཁྲིས་པ་ལ་སོགས་སྡུག་བསྔལ་གྱི། ། <br> འབྱུང་གནས་ཆེ་ལ་མི་ཁྲོ་བར། ། <br> སེམས་ཡོད་རྣམས་ལ་ཅི་སྟེ་ཁྲོ། ། <br> དེ་དག་ཀུན་ཀྱང་རྐྱེན་གྱིས་བསྐུལ། ། <br> <br>",
                        "དཔེར་ན་མི་འདོད་བཞིན་དུ་ཡང་། ། <br> ནད་འདི་འབྱུང་བར་འགྱུར་བ་ལྟར། ། <br> དེ་བཞིན་མི་འདོད་བཞིན་དུ་ཡང་། ། <br> ནན་གྱིས་ཉོན་མོངས་འབྱུང་བར་འགྱུར། ། <br> <br>",
                        "ཁྲོ་བར་བྱ་ཞེས་མ་བསམས་ཀྱང་། ། <br> སྐྱེ་བོ་རྣམས་ནི་གྱི་ནར་ཁྲོ། ། <br> བསྐྱེད་པར་བྱ་ཞེས་མ་བསམས་ཀྱང་། ། <br> ཁྲོ་བ་དེ་བཞིན་སྐྱེ་བར་འགྱུར། ། <br> <br>",
                        "ཉེས་པ་ཇི་སྙེད་ཐམས་ཅད་དང་། ། <br> སྡིག་པ་རྣམ་པ་སྣ་ཚོགས་པ། ། <br> དེ་ཀུན་རྐྱེན་གྱི་སྟོབས་ལས་བྱུང་། ། <br> རང་དབང་ཡོད་པ་མ་ཡིན་ནོ། ། <br> <br>",
                        "རྐྱེན་རྣམས་ཚོགས་པ་དེ་དག་ཀྱང་། ། <br> བསྐྱེད་པར་བྱ་ཞེས་སེམས་པ་མེད། ། <br> དེས་བསྐྱེད་དེ་ཡང་བདག་བསྐྱེད་ཅེས། ། <br> སེམས་པ་ཡོད་པ་མ་ཡིན་ནོ། ། <br> <br>",
                        "གཙོ་བོ་ཞེས་བྱར་གང་འདོད་དང་། ། <br> བདག་ཅེས་བརྟགས་པ་གང་ཡིན་པ། ། <br> དེ་ཉིད་བདག་ནི་འབྱུང་བྱ་ཞེས། ། <br> ཆེད་དུ་བསམས་ཤིང་འབྱུང་བ་མེད། ། <br> <br>",
                        "མ་སྐྱེས་པར་ནི་དེ་མེད་ན། ། <br> དེ་ཚེ་སྐྱེ་བར་འདོད་པ་གང་། ། <br> ཡུལ་ལ་རྟག་ཏུ་གཡེང་འགྱུར་བ། ། <br> འགག་པར་འགྱུར་བའང་མ་ཡིན་ནོ། ། <br> <br>",
                        "ཅི་སྟེ་བདག་དེ་རྟག་ན་ནི། ། <br> མཁའ་བཞིན་བྱེད་པ་མེད་པར་མངོན། ། <br> རྐྱེན་རྣམས་གཞན་དང་ཕྲད་ན་ཡང་། ། <br> འགྱུར་བ་མེད་ལ་ཅི་བྱར་ཡོད། ། <br> <br>",
                        "བྱེད་པའི་ཚེ་ཡང་སྔོན་བཞིན་ན། ། <br> བྱེད་པས་དེ་ལ་ཅི་ཞིག་བྱས། ། <br> དེ་ཡི་བྱེད་པ་འདི་ཡིན་ཞེས། ། <br> འབྲེལ་པར་འགྱུར་བ་གང་ཞིག་ཡོད། ། <br> <br>",
                        "དེ་ལྟར་ཐམས་ཅད་གཞན་གྱི་དབང་། ། <br> དེ་ཡི་དབང་གིས་དེ་དབང་མེད། ། <br> དེ་ལྟར་ཤེས་ན་སྦྲུལ་ལྟ་བུའི། ། <br> དངོས་པོ་ཀུན་ལ་ཁྲོ་མི་འགྱུར། ། <br> <br>",
                        "གང་གིས་གང་ཞིག་བཟློག་བྱ་སྟེ། ། <br> བཟློག་པའང་རིགས་པ་མིན་ཞེ་ན། ། <br> དེ་ལ་བརྟེན་ནས་སྡུག་བསྔལ་རྣམས། ། <br> རྒྱུན་ཆད་འགྱུར་འདོད་མི་རིགས་མེད། ། <br> <br>",
                        "དེ་བས་དགྲའམ་མཛའ་ཡང་རུང་། ། <br> མི་རིགས་བྱེད་པ་མཐོང་གྱུར་ན། ། <br> འདི་འདྲའི་རྐྱེན་ལས་གྱུར་ཏོ་ཞེས། ། <br> དེ་ལྟར་སོམས་ཏེ་བདེ་བར་མནོས། ། <br> <br>",
                        "གལ་ཏེ་རང་དགས་འགྲུབ་འགྱུར་ན། ། <br> འགའ་ཡང་སྡུག་བསྔལ་མི་འདོད་པས། ། <br> ལུས་ཅན་དག་ནི་ཐམས་ཅད་ཀྱང་། ། <br> སུ་ལའང་སྡུག་བསྔལ་འབྱུང་མི་འགྱུར། ། <br> <br>",
                        "བག་མེད་པས་ནི་བདག་ལའང་བདག ། <br> ཚེར་མ་ལ་སོགས་གནོད་པ་བྱེད། ། <br> བུད་མེད་ལ་སོགས་ཐོབ་བྱའི་ཕྱིར། ། <br> རྔམ་ཞིང་ཟས་གཅོད་ལ་སོགས་བྱེད། ། <br> <br>",
                        "ཁ་ཅིག་འགག་ཅིང་གཡང་སར་མཆོང་། ། <br> དུག་དང་མི་འཕྲོད་ཟ་བ་དང་། ། <br> བསོད་ནམས་མ་ཡིན་སྤྱོད་པ་ཡིས། ། <br> རང་ལ་གནོད་པ་བྱེད་པ་ཡོད། ། <br> <br>",
                        "གང་ཚེ་ཉོན་མོངས་དབང་གྱུར་པས། ། <br> བདག་སྡུག་ཉིད་ཀྱང་གསོད་བྱེད་པ། ། <br> དེ་ཚེ་དེ་དག་གཞན་ལུས་ལ། ། <br> གནོད་མི་བྱེད་པར་ཇི་ལྟར་འགྱུར། ། <br> <br>",
                        "ཉོན་མོངས་སྐྱེས་པས་དེ་ལྟ་བུར། ། <br> བདག་གསོད་ལ་སོགས་ཞུགས་པ་ལ། ། <br> སྙིང་རྗེ་རྒྱ་ལ་མ་སྐྱེས་ན། ། <br> ཁྲོ་བར་འགྱུར་བ་ཅི་ཐ་ཚིག ། <br> <br>",
                        "གལ་ཏེ་གཞན་ལ་འཚེ་བྱེད་པ། ། <br> བྱིས་པ་རྣམས་ཀྱི་རང་བཞིན་ནི། ། <br> དེ་ལ་ཁྲོ་བ་མི་རིགས་ཏེ། ། <br> སྲེག་པའི་རང་བཞིན་མེ་བཀོན་འདྲ། ། <br> <br>",
                        "འོན་ཏེ་སྐྱོན་དེ་གློ་བུར་ལ། ། <br> སེམས་ཅན་རང་བཞིན་དེས་པ་ནའང་། ། <br> འོ་ནའང་ཁྲོ་བ་མི་རིགས་ཏེ། ། <br> མཁའ་ལ་དུད་འཐུལ་དཀོན་པ་བཞིན། ། <br> <br>",
                        "དབྱུག་པ་ལ་སོགས་དངོས་བཀོལ་ཏེ། ། <br> གལ་ཏེ་འཕེན་པ་ལ་ཁྲོ་ན། ། <br> དེ་ཡང་ཞེ་སྡང་གིས་སྦད་པས། ། <br> ཉེས་ན་ཞེ་སྡང་ལ་ཁྲོ་རིགས། ། <br> <br>",
                        "བདག་གིས་སྔོན་ཆད་སེམས་ཅན་ལ། ། <br> འདི་འདྲ་བ་ཡི་གནོད་པ་བྱས། ། <br> དེ་བས་སེམས་ཅན་འཚེ་བྱེད་པ། ། <br> བདག་ལ་གནོད་པ་འདི་འབྱུང་རིགས། ། <br> <br>",
                        "དེ་ཡི་མཚོན་དང་བདག་གི་ལུས། ། <br> གཉི་ག་སྡུག་བསྔལ་རྒྱུ་ཡིན་ཏེ། ། <br> དེས་མཚོན་བདག་གི་ལུས་ཕྱུང་ན། ། <br> གང་ཞིག་ལ་ནི་ཁྲོ་བར་བྱ། ། <br> <br>",
                        "ཤུ་བ་མི་ཡི་གཟུགས་འདྲ་བ། ། <br> རེག་ཏུ་མི་བཟོད་སྡུག་བསྔལ་ཅན། ། <br> སྲེད་མདོངས་བདག་གིས་བཟུང་གྱུར་ན། ། <br> དེ་ལ་གནོད་པ་སུ་ལ་ཁྲོ། ། <br> <br>",
                        "བྱིས་པ་སྡུག་བསྔལ་མི་འདོད་ཅིང་། ། <br> སྡུག་བསྔལ་རྒྱུ་ལ་བརྐམ་པས་ན། ། <br> རང་གི་ཉེས་པས་གནོད་གྱུར་པ། ། <br> གཞན་ལ་བཀོན་དུ་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "དཔེར་ན་དམྱལ་བའི་སྲུང་མ་དང་། ། <br> རལ་གྲི་ལོ་མའི་ནགས་ཚལ་ལྟར། ། <br> རང་གི་ལས་ཀྱིས་འདི་བསྐྱེད་པ། ། <br> གང་ཞིག་ལ་ནི་ཁྲོ་བར་བྱ། ། <br> <br>",
                        "བདག་གི་ལས་ཀྱིས་བསྐུལ་བྱས་ནས། ། <br> བདག་ལ་གནོད་བྱེད་རྣམས་འབྱུང་སྟེ། ། <br> དེས་ནི་སེམས་ཅན་དམྱལ་དོང་ན། ། <br> བདག་གིས་དེ་དག་མ་བརླག་གམ། ། <br> <br>",
                        "འདི་དག་ལ་ནི་རྟེན་བཅས་ནས། ། <br> བཟོད་པས་བདག་སྡིག་མང་དུ་འབྱུང་། ། <br> བདག་ལ་བརྟེན་ནས་དེ་དག་ནི། ། <br> ཡུན་རིང་སྡུག་བསྔལ་དམྱལ་བར་འདོང་། ། <br> <br>",
                        "བདག་ནི་དེ་ལ་གནོད་བྱེད་ལ། ། <br> དེ་དག་བདག་ལ་ཕན་འདོགས་ན། ། <br> ཕྱིན་ཅི་ལོག་ཏུ་ཅི་ཡི་ཕྱིར། ། <br> མ་རུངས་སེམས་ཁྱོད་ཁྲོ་བར་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་བདག་ལ་བསམ་པ་ཡི། ། <br> ཡོན་ཏན་ཡོད་ན་དམྱལ་མི་འགྲོ། ། <br> གལ་ཏེ་བདག་གིས་བདག་བསྲུངས་ན། ། <br> དེ་དག་ལ་འདིར་ཅི་ཞིག་བྱུང་། ། <br> <br>",
                        "འོན་ཏེ་ལན་དུ་གནོད་བྱས་ན། ། <br> དེ་དག་བསྲུངས་པར་མ་གྱུར་ལ། ། <br> བདག་གི་སྤྱོད་པའང་ཉམས་པར་འགྱུར། ། <br> དེས་ན་དཀའ་ཐུབ་ཞིག་པར་འགྱུར། ། <br> <br>",
                        "ཡིད་ནི་ལུས་ཅན་མ་ཡིན་པས། ། <br> སུས་ཀྱང་གང་དུའང་གཞོམ་མི་ནུས། ། <br> ལུས་ལ་མངོན་པར་ཞེན་པས་ན། ། <br> ལུས་ནི་སྡུག་བསྔལ་དག་གིས་གནོད། ། <br> <br>",
                        "བརྙས་དང་ཚིག་རྩུབ་སྨྲ་བ་དང་། ། <br> མི་སྙན་པ་ཡི་ཚིག་དེ་ཡིས། ། <br> ལུས་ལ་གནོད་པར་མི་འགྱུར་ན། ། <br> སེམས་ཁྱོད་ཅི་ཕྱིར་རབ་ཏུ་ཁྲོ། ། <br> <br>",
                        "གཞན་དག་བདག་ལ་མི་དགའ་བ། ། <br> དེས་ནི་ཚེ་འདིའམ་ཚེ་གཞན་ལ། ། <br> བདག་ལ་ཟ་བར་མི་བྱེད་ན། ། <br> བདག་ནི་ཅི་ཕྱིར་དེ་མི་འདོད། ། <br> <br>",
                        "རྙེད་པའི་བར་ཆད་བྱེད་པའི་ཕྱིར། ། <br> གལ་ཏེ་འདི་བདག་མི་འདོད་ན། ། <br> བདག་གི་རྙེད་པ་འདིར་འདོར་གྱི། ། <br> སྡིག་པ་དག་ནི་བརྟན་པར་གནས། ། <br> <br>",
                        "བདག་ནི་དེང་ཉིད་ཤི་ཡང་བླའི། ། <br> ལོག་འཚོས་ཡུན་རིང་གསོན་མི་རུང་། ། <br> བདག་ལྟ་ཡུན་རིང་གནས་གྱུར་ཀྱང་། ། <br> འཆི་བའི་སྡུག་བསྔལ་དེ་ཉིད་ཡིན། ། <br> <br>",
                        "རྨི་ལམ་ལོ་བརྒྱར་བདེ་མྱོང་ནས། ། <br> སད་པར་གྱུར་པ་གང་ཡིན་དང་། ། <br> གཞན་ཞིག་ཡུད་ཙམ་བདེ་མྱོང་ནས། ། <br> སད་པར་གྱུར་པ་གང་ཡིན་པ། ། <br> <br>",
                        "སད་པ་དེ་དག་གཉི་ག་ལའང་། ། <br> བདེ་བ་དེ་ནི་ཕྱིར་འོང་མེད། ། <br> ཚེ་རིང་ཚེ་ཐུང་གཉི་ག་ཡང་། ། <br> འཆི་བའི་དུས་སུ་དེ་འདྲར་ཟད། ། <br> <br>",
                        "རྙེད་པ་མང་པོ་ཐོབ་གྱུར་ཏེ། ། <br> ཡུན་རིང་དུས་སུ་བདེ་སྤྱད་ཀྱང་། ། <br> ཆོམ་པོས་ཕྲོགས་པ་ཇི་བཞིན་དུ། ། <br> སྒྲེན་མོ་ལག་པ་སྟོང་པར་འགྲོ། ། <br> <br>",
                        "གལ་ཏེ་རྙེད་པས་གསོན་གྱུར་ན། ། <br> སྡིག་ཟད་བསོད་ནམས་བྱ་ཞེ་ན། ། <br> རྙེད་པའི་དོན་དུ་ཁྲོས་གྱུར་ན། ། <br> བསོད་ནམས་ཟད་སྡིག་མི་འགྱུར་རམ། ། <br> <br>",
                        "གང་གི་དོན་དུ་བདག་གསོན་པ། ། <br> དེ་ཉིད་གལ་ཏེ་ཉམས་གྱུར་ན། ། <br> སྡིག་པ་འབའ་ཞིག་བྱེད་པ་ཡི། ། <br> གསོན་པ་དེས་ཀོ་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "གལ་ཏེ་སེམས་ཅན་ཉམས་བྱེད་པས། ། <br> མི་སྙན་སྨྲ་ལ་ཁྲོ་ཞེ་ན། ། <br> གཞན་ལ་མི་སྙན་བརྗོད་ལའང་ཁྱོད། ། <br> དེ་བཞིན་ཅི་སྟེ་ཁྲོ་མི་བྱེད། ། <br> <br>",
                        "མ་དད་གཞན་ལ་རག་ལས་པས། ། <br> དད་པ་མེད་ལ་ཁྱོད་བཟོད་ན། ། <br> ཉོན་མོངས་སྐྱེ་ལ་རག་ལས་པས། ། <br> མི་སྙན་སྨྲ་ལ་ཅིས་མི་བཟོད། ། <br> <br>",
                        "སྐུ་གཟུགས་མཆོད་རྟེན་དམ་ཆོས་ལ། ། <br> འཁྱལ་ཞིང་འཇིག་པར་བྱེད་པ་ལའང་། ། <br> བདག་གིས་ཞེ་སྡང་མི་རིགས་ཏེ། ། <br> སངས་རྒྱས་སོགས་ལ་གནོད་མི་མངའ། ། <br> <br>",
                        "བླ་མ་གཉེན་ལ་སོགས་པ་དང་། ། <br> བཤེས་ལ་གནོད་པ་བྱེད་རྣམས་ལའང་། ། <br> སྔ་མའི་ཚུལ་གྱིས་རྐྱེན་དག་ལས། ། <br> འགྱུར་བར་མཐོང་ནས་ཁྲོ་བ་བཟློག ། <br> <br>",
                        "ལུས་ཅན་རྣམས་ལ་སེམས་ཡོད་དང་། ། <br> སེམས་མེད་གཉི་གས་གནོད་བྱས་ན། ། <br> སེམས་ཡོད་ཅི་སྟེ་བཀར་ཏེ་བཀོན། ། <br> དེ་བས་གནོད་པ་བཟོད་པར་གྱིས། ། <br> <br>",
                        "ལ་ལ་རྨོངས་པས་ཉེས་པ་བྱེད། ། <br> ལ་ལ་རྨོངས་ཏེ་ཁྲོས་གྱུར་ན། ། <br> དེ་ལ་སྐྱོན་མེད་གང་གིས་བྱ། ། <br> སྐྱོན་དང་བཅས་ཏེ་གང་ཞིག་ཡིན། ། <br> <br>",
                        "གང་གིས་གཞན་དག་གནོད་བྱེད་པའི། ། <br> ལས་དེ་སྔོན་ཆད་ཅི་ཕྱིར་བྱས། ། <br> ཐམས་ཅད་ལས་ལ་རག་ལས་ན། ། <br> བདག་གིས་འདི་ལ་ཅི་སྟེ་བཀོན། ། <br> <br>",
                        "དེ་ལྟར་མཐོང་ནས་ཅི་ནས་ཀྱང་། ། <br> ཐམས་ཅད་ཕན་ཚུན་བྱམས་སེམས་སུ། ། <br> འགྱུར་བ་དེ་ལྟར་བདག་གིས་ནི། ། <br> བསོད་ནམས་དག་ལ་བསྒྲིམས་ཏེ་བྱ། ། <br> <br>",
                        "དཔེར་ན་ཁྱིམ་ཚིག་གྱུར་པའི་མེ། ། <br> ཁྱིམ་གཞན་ཞིག་ཏུ་སོང་ནས་ནི། ། <br> རྩྭ་སོགས་གང་ལ་མཆེད་བྱེད་པ། ། <br> དེ་ནི་ཕྱུང་སྟེ་དོར་བ་ཡིན། ། <br> <br>",
                        "དེ་བཞིན་གང་ལ་སེམས་ཆགས་ན། ། <br> ཞེ་སྡང་མེ་ནི་མཆེད་གྱུར་པ། ། <br> བསོད་ནམས་ཚིག་པར་དོགས་པ་ཡིས། ། <br> དེ་ནི་དེ་ཡི་མོད་ལ་དོར། ། <br> <br>",
                        "གསད་བྱའི་མི་ཞིག་ལག་བཅད་དེ། ། <br> གལ་ཏེ་ཐར་ན་ཅིས་མ་ལེགས། ། <br> གལ་ཏེ་མི་ཡི་སྡུག་བསྔལ་གྱིས། ། <br> དམྱལ་བ་བྲལ་ན་ཅིས་མ་ལེགས། ། <br> <br>",
                        "ད་ལྟའི་སྡུག་བསྔལ་འདི་ཙམ་ལའང་། ། <br> བདག་གིས་བཟོད་པར་མི་ནུས་ན། ། <br> དེས་ན་དམྱལ་བའི་སྡུག་བསྔལ་རྒྱུ། ། <br> ཁྲོ་བ་ཅི་སྟེ་བཟློག་མི་བྱེད། ། <br> <br>",
                        "འདོད་པའི་དོན་དུ་སྲེག་ལ་སོགས། ། <br> དམྱལ་བར་སྟོང་ཕྲག་མྱོང་གྱུར་ཡང་། ། <br> བདག་གིས་རང་གི་དོན་དང་ནི། ། <br> གཞན་གྱི་དོན་ཡང་མ་བྱས་སོ། ། <br> <br>",
                        "འདི་ནི་དེ་ཙམ་གནོད་མིན་ལ། ། <br> དོན་ཆེན་དག་ཀྱང་འགྲུབ་འགྱུར་བས། ། <br> འགྲོ་བའི་གནོད་སེལ་སྡུག་བསྔལ་ལ། ། <br> དགའ་བ་འབའ་ཞིག་འདིར་བྱ་རིགས། ། <br> <br>",
                        "གཞན་གྱིས་ཡོན་ཏན་ལྡན་བསྟོད་ནས། ། <br> གལ་ཏེ་དགའ་བའི་བདེ་ཐོབ་ན། ། <br> ཡིད་ཁྱོད་ཀྱང་ནི་དེ་བསྟོད་ནས། ། <br> ཅི་ཕྱིར་དེ་ལྟར་དགའ་མི་བྱེད། ། <br> <br>",
                        "ཁྱོད་ཀྱི་དགའ་བའི་བདེ་བ་འདི། ། <br> བདེ་འབྱུང་ཁ་ན་མ་ཐོ་མེད། ། <br> ཡོན་ཏན་ལྡན་པ་རྣམས་ཀྱིས་གནང་། ། <br> གཞན་སྡུད་པ་ཡི་མཆོག་ཀྱང་ཡིན། ། <br> <br>",
                        "གཞན་ཡང་དེ་ལྟར་བདེ་འགྱུར་ཞེས། ། <br> གལ་ཏེ་ཁྱོད་བདེ་འདི་མི་འདོད། ། <br> གླ་རྔན་སྦྱིན་སོགས་སྤངས་པའི་ཕྱིར། ། <br> མཐོང་དང་མ་མཐོང་ཉམས་པར་འགྱུར། ། <br> <br>",
                        "རང་གི་ཡོན་ཏན་བརྗོད་པའི་ཚེ། ། <br> གཞན་ལ་བདེ་བའང་འདོད་པར་བྱེད། ། <br> གཞན་གྱི་ཡོན་ཏན་བརྗོད་པའི་ཚེ། ། <br> རང་ལའང་བདེ་བ་མི་འདོད་བྱེད། ། <br> <br>",
                        "སེམས་ཅན་ཐམས་ཅད་བདེ་འདོད་པས། ། <br> བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་ནས། ། <br> སེམས་ཅན་རང་གིས་བདེ་རྙེད་ན། ། <br> དེས་ཀོ་ཅི་སྟེ་ཁྲོ་བར་བྱེད། ། <br> <br>",
                        "འཇིག་རྟེན་གསུམ་མཆོད་འཚང་རྒྱ་བར། ། <br> སེམས་ཅན་རྣམས་ནི་འདོད་ཅེ་ན། ། <br> བསྙེན་བཀུར་ངན་ངོན་ཙམ་མཐོང་ནས། ། <br> ཅི་ཕྱིར་དེ་ལ་གདུང་བར་བྱེད། ། <br> <br>",
                        "གསོ་བྱ་གང་ཞིག་ཁྱོད་གསོ་བ། ། <br> ཁྱོད་ཉིད་ཀྱིས་ནི་སྦྱིན་བྱ་དེ། ། <br> གཉེན་གྱིས་འཚོ་བ་རྙེད་གྱུར་ན། ། <br> དགར་མི་འགྱུར་བར་སླར་ཁྲོའམ། ། <br> <br>",
                        "དེ་ཅི་འགྲོ་ལ་མི་འདོད་ན། ། <br> དེ་ལ་བྱང་ཆུབ་འདོད་གང་ཡིན། ། <br> གང་ཞིག་གཞན་འབྱོར་ཁྲོ་དེ་ལ། ། <br> བྱང་ཆུབ་སེམས་ནི་ག་ལ་ཡོད། ། <br> <br>",
                        "གལ་ཏེ་དེས་དེ་ལས་རྙེད་དམ། ། <br> སྦྱིན་བདག་ཁྱིམ་ན་གནས་གྱུར་པ། ། <br> ཀུན་དུ་དེ་ཁྱོད་ལ་མེད་ན། ། <br> བྱིན་མ་བྱིན་རུང་དེས་ཅི་བྱ། ། <br> <br>",
                        "བསོད་ནམས་དང་ནི་དད་པའམ། ། <br> རང་གི་ཡོན་ཏན་ཅི་ཕྱིར་འདོར། ། <br> རྙེད་པ་གྱུར་པ་མི་འཛིན་པ། ། <br> གང་གིས་ཁྲོ་བ་མི་བྱེད་སྨྲོས། ། <br> <br>",
                        "ཁྱོད་ནི་རང་གིས་སྡིག་བྱས་ལ། ། <br> མྱ་ངན་མེད་པར་མ་ཟད་ཀྱི། ། <br> བསོད་ནམས་བྱས་པ་གཞན་དག་དང་། ། <br> ལྷན་ཅིག་འགྲན་པར་བྱེད་འདོད་དམ།། <br>  ། <br> ། བམ་པོ་གཉིས་པའོ། ། <br> <br>",
                        "གལ་ཏེ་དགྲ་ཞིག་མི་དགའ་ནའང་། ། <br> དེ་ལ་ཁྱོད་དགར་ཅི་ཞིག་ཡོད། ། <br> ཁྱོད་ཀྱི་ཡིད་སྨོན་ཙམ་གྱིས་ནི། ། <br> དེ་ལ་གནོད་པའི་རྒྱུར་མི་འགྱུར། ། <br> <br>",
                        "ཁྱོད་ཀྱི་འདོད་པས་སྡུག་བསྔལ་དེ། ། <br> གྲུབ་ནའང་ཁྱོད་དགར་ཅི་ཞིག་ཡོད། ། <br> གལ་ཏེ་འཚེངས་པར་འགྱུར་ཞེ་ན། ། <br> དེ་ལས་ཕུང་བའང་གཞན་ཅི་ཡོད། ། <br> <br>",
                        "ཉོན་མོངས་ཉ་པས་བཏབ་པ་ཡི། ། <br> མཆིལ་པ་འདི་ནི་མི་བཟད་གཟེ། ། <br> དེས་བཟུང་སེམས་དམྱལ་བུམ་པར་ཡང་། ། <br> དམྱལ་བའི་སྲུང་མས་བདག་འཚེད་དེས། ། <br> <br>",
                        "བསྟོད་དང་གྲགས་པའི་རིམ་གྲོས་ནི། ། <br> བསོད་ནམས་མི་འགྱུར་ཆེར་མི་འགྱུར། ། <br> བདག་སྟོབས་མི་འགྱུར་ནད་མེད་མིན། ། <br> ལུས་བདེ་བར་ཡང་མི་འགྱུར་རོ། ། <br> <br>",
                        "བདག་ནི་རང་དོན་ཤེས་གྱུར་ན། ། <br> དེ་ལ་རང་དོན་ཅི་ཞིག་ཡོད། ། <br> ཡིད་བདེ་འབའ་ཞིག་འདོད་ན་ནི། ། <br> རྒྱན་སོགས་ཆང་ཡང་བསྟེན་དགོས་སོ། ། <br> <br>",
                        "གྲགས་པའི་དོན་དུ་ནོར་ཤོར་ཅིང་། ། <br> བདག་ཉིད་ཀྱང་ནི་གསོད་བྱེད་ན། ། <br> ཚིག་འབྲུ་རྣམས་ཀྱིས་ཅི་ཞིག་བྱ། ། <br> ཤ་ནི་དེས་ཀོ་སུ་ལ་བདེ། ། <br> <br>",
                        "བྱེ་མའི་ཁང་བུ་རྡིབ་གྱུར་ན། ། <br> བྱིས་པ་རྣམས་ནི་ག་ཆད་དུ། ། <br> དེ་བཞིན་བསྟོད་དང་གྲགས་ཉམས་ན། ། <br> རང་གི་སེམས་ནི་བྱིས་པ་བཞིན། ། <br> <br>",
                        "རེ་ཞིག་སྒྲ་ལ་སེམས་མེད་ཕྱིར། ། <br> བདག་ལ་བསྟོད་སེམས་ཡོད་མི་སྲིད། ། <br> བདག་ལ་གཞན་དགའ་ཞེས་གྲགས་པ། ། <br> དེ་ནི་དགའ་བའི་རྒྱུ་ཡིན་གྲང་། ། <br> <br>",
                        "གཞན་ནམ་ཡང་ན་བདག་ལའང་རུང་། ། <br> གཞན་དགའ་བདག་ལ་ཅི་ཞིག་ཕན། ། <br> དགའ་བདེ་དེ་ནི་དེ་ཉིད་ཀྱི། ། <br> བདག་གིས་དེ་ལས་ཤས་མི་འཐོབ། ། <br> <br>",
                        "དེ་བདེ་བ་ཡི་བདག་བདེ་ན། ། <br> ཀུན་ལའང་དེ་བཞིན་བྱ་དགོས་ན། ། <br> ཇི་ལྟར་གཞན་ལ་དགའ་བ་ཡིས། ། <br> བདེ་བར་གྱུར་ན་བདག་མི་བདེ། ། <br> <br>",
                        "དེ་བས་བདག་ནི་བསྟོད་དོ་ཞེས། ། <br> རང་གི་དགའ་བ་སྐྱེ་འགྱུར་བ། ། <br> དེ་ཡང་དེ་ལྟར་མི་འཐད་པས། ། <br> བྱིས་པའི་སྤྱོད་པ་ཁོ་ནར་ཟད། ། <br> <br>",
                        "བསྟོད་སོགས་བདག་ནི་གཡེང་བར་བྱེད། ། <br> དེས་ནི་སྐྱོ་བའང་འཇིག་པར་བྱེད། ། <br> ཡོན་ཏན་ལྡན་ལ་ཕྲག་དོག་དང་། ། <br> ཕུན་སུམ་ཚོགས་པའང་འཇིག་པར་བྱེད། ། <br> <br>",
                        "དེ་ཕྱིར་བདག་གི་བསྟོད་སོགས་ནི། ། <br> གཞིག་ཕྱིར་གང་དག་ཉེར་གནས་པ། ། <br> དེ་དག་བདག་ནི་ངན་སོང་དུ། ། <br> ལྟུང་བ་བསྲུང་ཕྱིར་ཞུགས་མིན་ནམ། ། <br> <br>",
                        "བདག་ནི་གྲོལ་བ་དོན་གཉེར་ལ། ། <br> རྙེད་དང་བཀུར་སྟི་འཆིང་མི་དགོས། ། <br> གང་དག་བདག་བཅིངས་གྲོལ་བྱེད་པ། ། <br> དེ་ལ་བདག་ནི་ཇི་ལྟར་ཁྲོ། ། <br> <br>",
                        "བདག་ནི་སྡུག་བསྔལ་འཇུག་འདོད་ལ། ། <br> སངས་རྒྱས་ཀྱིས་ནི་བྱིན་བརླབས་བཞིན། ། <br> མི་གཏོང་སྒོ་འཕར་ཉིད་གྱུར་པ། ། <br> དེ་ལ་བདག་ནི་ཇི་ལྟར་ཁྲོ། ། <br> <br>",
                        "འདི་ནི་བསོད་ནམས་གེགས་བྱེད་ཅེས། ། <br> དེ་ལའང་ཁྲོ་བར་རིགས་མིན་ཏེ། ། <br> བཟོད་མཚུངས་དཀའ་ཐུབ་ཡོད་མིན་ན། ། <br> དེ་ལ་བདག་ནི་མི་གནས་སམ། ། <br> <br>",
                        "གལ་ཏེ་བདག་ནི་རང་སྐྱོན་གྱིས། ། <br> འདི་ལ་བཟོད་པ་མི་བྱེད་ན། ། <br> བསོད་ནམས་རྒྱུ་ནི་ཉེར་གནས་པ། ། <br> འདི་ལ་བདག་གེགས་བྱེད་པར་ཟད། ། <br> <br>",
                        "གང་ཞིག་གང་མེད་མི་འབྱུང་ལ། ། <br> གང་ཞིག་ཡོད་ན་ཡོད་གྱུར་པ། ། <br> དེ་ཉིད་དེ་ཡི་རྒྱུ་ཡིན་ན། ། <br> ཇི་ལྟར་དེ་ལ་གེགས་ཞེས་བྱ། ། <br> <br>",
                        "དུས་སུ་ཕྱིན་པའི་སློང་མོ་བས། ། <br> སྦྱིན་པའི་གེགས་བྱས་ཡོད་མ་ཡིན། ། <br> རབ་ཏུ་འབྱིན་པར་བྱེད་གྱུར་པ། ། <br> རབ་བྱུང་གེགས་ཞེས་བྱར་མི་རུང་། ། <br> <br>",
                        "འཇིག་རྟེན་ན་ནི་སློང་བ་མོད། ། <br> གནོད་པ་བྱེད་པ་དཀོན་པ་སྟེ། ། <br> འདི་ལྟར་ཕར་གནོད་མ་བྱས་ན། ། <br> འགའ་ཡང་གནོད་པ་མི་བྱེད་དོ། ། <br> <br>",
                        "དེ་བས་ངལ་བས་མ་བསྒྲུབས་པའི། ། <br> ཁྱིམ་དུ་གཏེར་ནི་བྱུང་བ་ལྟར། ། <br> བྱང་ཆུབ་སྤྱོད་པའི་གྲོགས་གྱུར་པས། ། <br> བདག་གིས་དགྲ་ལ་དགའ་བར་བྱ། ། <br> <br>",
                        "འདི་དང་བདག་གིས་བསྒྲུབས་པས་ན། ། <br> དེ་ཕྱིར་བཟོད་པའི་འབྲས་བུ་ནི། ། <br> འདི་ལ་ཐོག་མར་བདར་འོས་ཏེ། ། <br> འདི་ལྟར་དེ་ནི་བཟོད་པའི་རྒྱུ། ། <br> <br>",
                        "གལ་ཏེ་བཟོད་བསྒྲུབ་བསམ་མེད་པས། ། <br> དགྲ་འདི་མཆོད་བྱ་མིན་ཞེ་ན། ། <br> གྲུབ་པ་ཡི་ནི་རྒྱུར་རུང་བ། ། <br> དམ་པའི་ཆོས་ཀྱང་ཅི་སྟེ་མཆོད། ། <br> <br>",
                        "གལ་ཏེ་དགྲ་འདི་གནོད་བྱ་བའི། ། <br> བསམ་ཡོད་མཆོད་བྱ་མིན་ཞེ་ན། ། <br> སྨན་པ་བཞིན་དུ་ཕན་བརྩོན་ན། ། <br> བདག་གི་བཟོད་པ་ཇི་ལྟར་འགྲུབ། ། <br> <br>",
                        "དེ་བས་རབ་ཏུ་སྡང་སེམས་ལ། ། <br> བརྟེན་ནས་བཟོད་པ་སྐྱེ་བས་ན། ། <br> དེ་ཉིད་བཟོད་པའི་རྒྱུ་ཡིན་པས། ། <br> དམ་པའི་ཆོས་བཞིན་མཆོད་པར་འོས། ། <br> <br>",
                        "དེ་ཕྱིར་སེམས་ཅན་ཞིང་དང་ནི། ། <br> རྒྱལ་བའི་ཞིང་ཞེས་ཐུབ་པས་གསུངས། ། <br> འདི་དག་མགུ་བྱས་མང་པོ་ཞིག ། <br> འདི་ལྟར་ཕུན་སུམ་ཕ་རོལ་ཕྱིན། ། <br> <br>",
                        "སེམས་ཅན་རྣམས་དང་རྒྱལ་བ་ལས། ། <br> སངས་རྒྱས་ཆོས་འགྲུབ་འདྲ་བ་ལ། ། <br> རྒྱལ་ལ་གུས་བྱ་དེ་བཞིན་དུ། ། <br> སེམས་ཅན་ལ་མིན་ཅི་ཡི་ཚུལ། ། <br> <br>",
                        "བསམ་པའི་ཡོན་ཏན་རང་གིས་མིན། ། <br> འབྲས་བུ་ལས་ཡིན་དེས་མཚུངས་པར། ། <br> སེམས་ཅན་རྣམས་ལའང་ཡོན་ཏན་ཡོད། ། <br> དེ་ཕྱིར་དེ་དག་མཉམ་པ་ཡིན། ། <br> <br>",
                        "བྱམས་སེམས་ལྡན་ལ་མཆོད་པ་གང་། ། <br> དེ་ནི་སེམས་ཅན་ཆེ་བ་ཉིད། ། <br> སངས་རྒྱས་དད་པའི་བསོད་ནམས་གང་། ། <br> དེ་ཡང་སངས་རྒྱས་ཆེ་བ་ཉིད། ། <br> <br>",
                        "སངས་རྒྱས་ཆོས་འགྲུབ་ཆ་ཡོད་པ། ། <br> དེས་ན་དེ་དག་མཉམ་པར་འདོད། ། <br> ཡོན་ཏན་རྒྱ་མཚོ་མཐའ་ཡས་པའི། ། <br> སངས་རྒྱས་རྣམས་དང་འགའ་མི་མཉམ། ། <br> <br>",
                        "ཡོན་ཏན་མཆོག་ཚོགས་གཅིག་པུ་ཡི། ། <br> ཡོན་ཏན་ཤས་ཙམ་འགའ་ཞིག་ལ། ། <br> སྣང་ནའང་དེ་ལ་མཆོད་དོན་དུ། ། <br> ཁམས་གསུམ་ཕུལ་ཡང་ཆུང་བར་འགྱུར། ། <br> <br>",
                        "སངས་རྒྱས་ཆོས་མཆོག་སྐྱེ་བའི་ཤས། ། <br> སེམས་ཅན་རྣམས་ལ་ཡོད་པས་ན། ། <br> འདི་ཙམ་ངག་གིས་ཆ་བསྟུན་ནས། ། <br> སེམས་ཅན་མཆོད་བྱར་རིགས་པར་འགྱུར། ། <br> <br>",
                        "གཞན་ཡང་གཡོ་མེད་གཉེན་གྱུར་ཅིང་། ། <br> ཕན་པ་དཔག་མེད་མཛད་རྣམས་ལ། ། <br> སེམས་ཅན་མགུ་བྱ་མ་གཏོགས་པར། ། <br> གཞན་གང་ཞིག་གིས་ལན་ལོན་འགྱུར། ། <br> <br>",
                        "གང་ཕྱིར་སྐུ་གཏོང་མནར་མེད་འཇུག་པ་ལ། ། <br> དེ་ལ་ཕན་བཏགས་ལན་ལོན་འགྱུར་བས་ན། ། <br> དེ་བས་འདི་དག་གནོད་ཆེན་བྱེད་ན་ཡང་། ། <br> ཐམས་ཅད་བཟང་དགུ་ཞིག་ཏུ་སྤྱད་པར་བྱ། ། <br> <br>",
                        "རེ་ཞིག་བདག་གི་རྗེར་གྱུར་ཉིད་ཀྱང་ནི། ། <br> གང་ཕྱིར་རང་གི་སྐུ་ལའང་མི་གཟིགས་པ། ། <br> དེ་ལ་རྨོངས་པ་བདག་གིས་ཇི་ལྟར་ན། ། <br> ང་རྒྱལ་བྱ་ཞིང་བྲན་གྱི་དངོས་མི་བྱ། ། <br> <br>",
                        "གང་དག་བདེ་བས་ཐུབ་རྣམས་དགྱེས་འགྱུར་ཞིང་། ། <br> གང་ལ་གནོད་ན་མི་དགྱེས་འབྱུང་འགྱུར་བ། ། <br> དེ་དག་དགའ་བས་ཐུབ་པ་ཀུན་དགྱེས་ཤིང་། ། <br> དེ་ལ་གནོད་བྱས་ཐུབ་ལ་གནོད་པ་བྱས། ། <br> <br>",
                        "ཇི་ལྟར་ལུས་ལ་ཀུན་ནས་མེ་འབར་བ། ། <br> འདོད་པ་ཀུན་གྱིས་ཡིད་བདེར་མི་འགྱུར་བ། ། <br> དེ་བཞིན་སེམས་ཅན་གནོད་པ་བྱས་ན་ཡང་། ། <br> ཐུགས་རྗེ་ཆེ་རྣམས་དགྱེས་པའི་ཐབས་མེད་དོ། ། <br> <br>",
                        "དེ་བས་བདག་གིས་འགྲོ་ལ་གནོད་བྱས་པས། ། <br> ཐུགས་རྗེ་ཆེ་ཀུན་མི་དགྱེས་གྱུར་པ་གང་། ། <br> སྡིག་དེ་དེ་རིང་སོ་སོར་བཤགས་བགྱི་ཡིས། ། <br> མི་དགྱེས་གང་ལགས་དེ་ཐུབ་བཟོད་པར་གསོལ། ། <br> <br>",
                        "དེ་བཞིན་གཤེགས་རྣམས་དགྱེས་པར་བགྱི་སླད་དུ། ། <br> དེང་ནས་བཟུང་ནས་འཇིག་རྟེན་བྲན་དུ་མཆི། ། <br> འགྲོ་མང་རྡོག་པས་བདག་གི་སྤྱིར་འཚོག་གམ། ། <br> འགུམས་ཀྱང་མི་བསྡོ་འཇིག་རྟེན་མགོན་དགྱེས་མཛོད། ། <br> <br>",
                        "འགྲོ་བ་འདི་ཀུན་ཐུགས་རྗེའི་བདག་ཅན་དེས། ། <br> བདག་ཏུ་མཛད་པ་འདི་ལ་ཐེ་ཚོམ་མེད། ། <br> སེམས་ཅན་ངོ་བོར་མཐོང་བ་འདི་དག་ཉིད། ། <br> མགོན་དེ་བདག་ཉིད་ཅི་ཕྱིར་གུས་མི་བྱེད། ། <br> <br>",
                        "འདི་ཉིད་དེ་བཞིན་གཤགས་པ་མཉེས་བྱེད་ཡིན། ། <br> རང་དོན་ཡང་དག་སྒྲུབ་པའང་འདི་ཉིད་དོ། ། <br> འཇིག་རྟེན་སྡུག་བསྔལ་སེལ་བའང་འདི་ཉིད་དེ། ། <br> དེ་ལྟས་བདག་གིས་རྟག་ཏུ་དེ་ཉིད་བྱ། ། <br> <br>",
                        "དཔེར་ན་རྒྱལ་པོའི་མི་འགའ་ཞིག ། <br> སྐྱེ་བོ་མང་ལ་གནོད་བྱེད་ཀྱང་། ། <br> སྐྱེ་བོ་མིག་རྒྱང་རིང་པོ་དག ། <br> ནུས་ཀྱང་ཕྱིར་གནོད་མི་བྱེད་དེ། ། <br> <br>",
                        "འདི་ལྟར་དེ་གཅིག་མ་ཡིན་གྱི། ། <br> རྒྱལ་པོའི་མཐུ་སྟོབས་དེ་ཡི་མཐུ། ། <br> དེ་བཞིན་གནོད་བྱེད་ཉམ་ཆུང་བ། ། <br> འགའ་ཡང་ཁྱད་དུ་གསད་མི་བྱ། ། <br> <br>",
                        "འདི་ལྟར་དམྱལ་བའི་སྲུང་མ་དང་། ། <br> ཐུགས་རྗེ་ལྡན་རྣམས་དེ་ཡི་དཔུང་། ། <br> དེ་ལྟར་དམངས་ཀྱིས་རྒྱལ་གཏུམ་བཞིན། ། <br> སེམས་ཅན་རྣམས་ནི་མགུ་བར་བྱ། ། <br> <br>",
                        "རྒྱལ་པོ་ལྟ་ཞིག་ཁྲོས་ན་ཡང་། ། <br> སེམས་ཅན་མི་མགུ་བྱས་པ་ཡིས། ། <br> མྱོང་བར་འགྱུར་བ་གང་ཡིན་པ། ། <br> དམྱལ་བའི་གནོད་པ་དེས་བྱེད་དམ། ། <br> <br>",
                        "རྒྱལ་པོ་ལྟ་ཞིག་མགུ་ན་ཡང་། ། <br> སེམས་ཅན་མགུ་བར་བྱས་པ་ཡིས། ། <br> འཐོབ་པར་འགྱུར་བ་གང་ཡིན་པ། ། <br> སངས་རྒྱས་ཉིད་སྦྱིན་མི་སྲིད་དོ། ། <br> <br>",
                        "སེམས་ཅན་མགུ་ལས་བྱུང་བ་ཡི། ། <br> མ་འོངས་སངས་རྒྱས་འགྲུབ་ལྟ་ཞོག ། <br> ཚེ་འདི་ཉིད་ལ་དཔལ་ཆེན་དང་། ། <br> གྲགས་དང་སྐྱེད་འགྱུར་ཅིས་མ་མཐོང་། ། <br> <br>",
                        "འཁོར་ཚེ་བཟོད་པས་མཛེས་སོགས་དང་། ། <br> ནད་མེད་པ་དང་གྲགས་པ་ཡིས། ། <br> ཤིན་ཏུ་ཡུན་རིང་འཚོ་བ་དང་། ། <br> འཁོར་ལོས་སྒྱུར་བའི་བདེ་རྒྱས་ཐོབ། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། བཟོད་པ་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་དྲུག་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "དེ་ལྟར་བཟོད་པས་བརྩོན་འགྲུས་བརྩམ། ། <br> འདི་ལྟར་བརྩོན་ལ་བྱང་ཆུབ་གནས། ། <br> རླུང་མེད་གཡོ་བ་མེད་པ་བཞིན། ། <br> བསོད་ནམས་བརྩོན་འགྲུས་མེད་མི་འབྱུང་། ། <br> <br>",
                        "བརྩོན་གང་དགེ་ལ་སྤྲོ་བའོ། ། <br> དེ་ཡི་མི་མཐུན་ཕྱོགས་བཤད་བྱ། ། <br> ལེ་ལོ་ངན་ལ་ཞེན་པ་དང་། ། <br> སྒྱིད་ལུག་བདག་ཉིད་བརྙས་པའོ། ། <br> <br>",
                        "སྙོམ་ལས་བདེ་བའི་རོ་མྱང་དང་། ། <br> གཉིད་ལ་བརྟེན་པའི་སྲེད་པ་ཡིས། ། <br> འཁོར་བའི་སྡུག་བསྔལ་མི་སྐྱོ་ལས། ། <br> ལེ་ལོ་ཉེ་བར་སྐྱེ་བར་འགྱུར། ། <br> <br>",
                        "ཉོན་མོངས་རྒྱ་བས་བཤོར་ནས་ནི། ། <br> སྐྱེ་བའི་རྒྱར་ནི་ཆུད་གྱུར་ནས། ། <br> འཆི་བདག་ཁར་ནི་སོང་གྱུར་པ། ། <br> ཅི་སྟེ་ད་དུང་མི་ཤེས་སམ། ། <br> <br>",
                        "རང་སྡེ་རིམ་གྱིས་གསོད་པ་ཡང་། ། <br> ཁྱོད་ཀྱིས་མཐོང་བར་མ་གྱུར་ཏམ། ། <br> འོན་ཀྱང་གཉིད་ལ་བརྟེན་པ་གང་། ། <br> གདོལ་པ་དང་ནི་མ་ཧེ་བཞིན། ། <br> <br>",
                        "ལམ་ནི་ཀུན་ནས་བཀག་ནས་སུ། ། <br> འཆི་བདག་གིས་ནི་བལྟས་བཞིན་དུ། ། <br> ཇི་ལྟར་ཁྱོད་ནི་ཟ་དགའ་ཞིང་། ། <br> འདི་ལྟར་གཉིད་ལོག་ཇི་ལྟར་དགའ། ། <br> <br>",
                        "མྱུར་བ་ཉིད་དུ་འཆི་འགྱུར་བས། ། <br> ཇི་སྲིད་དུ་ནི་ཚོགས་བསག་བྱ། ། <br> དེ་ཚེ་ལེ་ལོ་སྤངས་ཀྱང་ནི། ། <br> དུས་མ་ཡིན་པར་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "འདི་ནི་མ་བྱས་བརྩམས་པ་དང་། ། <br> འདི་ཕྱེད་བྱས་པར་གནས་པ་ལ། ། <br> གློ་བུར་འཆི་བདག་འོངས་ནས་ནི། ། <br> ཀྱི་ཧུད་བཅོམ་ཞེས་སེམས་པར་འགྱུར། ། <br> <br>",
                        "མྱ་ངན་ཤུགས་ཀྱིས་སྐྲངས་པ་ཡི། ། <br> མིག་དམར་གདོང་ལ་མཆི་མ་འཛག ། <br> ཉེ་དུ་རེ་ཐག་ཆད་པ་དང་། ། <br> གཤིན་རྗེའི་ཕོ་ཉའི་བཞིན་ལ་བལྟ། ། <br> <br>",
                        "རང་སྡིག་དྲན་པས་གདུང་བ་དང་། ། <br> དམྱལ་བའི་སྒྲ་ནི་ཐོས་པ་ཡིས། ། <br> སྐྲག་པས་མི་གཙང་ལུས་གོས་ཤིང་། ། <br> མྱོས་པར་འགྱུར་ཚེ་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "ཁྱོད་ནི་ཉ་གསོན་འགྲེ་བ་ལྟའི། ། <br> ཚེ་འདིར་འཇིགས་དང་ལྡན་གྱུར་ན། ། <br> སྡིག་བྱས་དམྱལ་བ་མི་བཟད་པའི། ། <br> སྡུག་བསྔལ་རྣམས་ནི་སྨོས་ཅི་དགོས། ། <br> <br>",
                        "ཆུ་ཚན་གྱིས་ནི་རེག་པ་ན། ། <br> གཞོན་ཤ་ཅན་ལ་རབ་ཚ་བའི། ། <br> དམྱལ་བ་ཡི་ནི་ལས་བྱས་ནས། ། <br> ཅི་ཕྱིར་འདི་ལྟར་བདེ་བར་གནས། ། <br> <br>",
                        "བརྩོན་མེད་འབྲས་བུ་འདོད་པ་དང་། ། <br> བཟེ་རེ་ཅན་ལ་གནོད་མང་ཞིང་། ། <br> འཆི་བས་བཟུང་བཞིན་ལྷ་འདྲ་བ། ། <br> ཀྱི་ཧུད་སྡུག་བསྔལ་དག་གིས་བཅོམ། ། <br> <br>",
                        "མི་ཡི་གྲུ་ལ་བརྟེན་ནས་སུ། ། <br> སྡུག་བསྔལ་ཆུ་བོ་ཆེ་ལས་སྒྲོལ། ། <br> གྲུ་འདི་ཕྱི་ནས་རྙེད་དཀའ་བས། ། <br> རྨོངས་པ་དུས་སུ་གཉིད་མ་ལོག ། <br> <br>",
                        "དགའ་བའི་རྒྱུ་ནི་མཐའ་ཡས་པའི། ། <br> དམ་ཆོས་དགའ་བའི་མཆོག་སྤངས་ནས། ། <br> སྡུག་བསྔལ་རྒྱུ་ཡིས་གཡེང་བ་དང་། ། <br> རྒོད་སོགས་ལ་ཁྱོད་ཅི་ཕྱིར་དགའ། ། <br> <br>",
                        "སྒྱིད་ལུག་མེད་དང་དཔུང་ཚོགས་དང་། ། <br> ལྷུར་བླང་བདག་ཉིད་དབང་བྱ་དང་། ། <br> བདག་དང་གཞན་དུ་མཉམ་པ་དང་། ། <br> བདག་དང་གཞན་དུ་བརྗེ་བར་གྱིས། ། <br> <br>",
                        "བདག་གིས་བྱང་ཆུབ་ག་ལ་ཞེས། ། <br> སྒྱིད་ལུག་པར་ནི་མི་བྱ་སྟེ། ། <br> འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ནི། ། <br> བདེན་པ་གསུང་བས་བདེན་འདི་གསུངས། ། <br> <br>",
                        "སྦྲང་བུ་ཤ་སྦྲང་བུང་བ་དང་། ། <br> དེ་བཞིན་སྲིན་བུར་གང་གྱུར་པ། ། <br> དེས་ཀྱང་བརྩོན་པའི་སྟོབས་བསྐྱེད་ན། ། <br> བྱང་ཆུབ་ཐོབ་དཀའ་བླ་མེད་འཐོབ། ། <br> <br>",
                        "བདག་ལྟ་རིགས་ཀྱིས་མིར་སྐྱེས་ལ། ། <br> ཕན་དང་གནོད་པའི་ངོ་ཤེས་པས། ། <br> བྱང་ཆུབ་སྤྱོད་པ་མ་བཏང་ན། ། <br> བདག་གིས་བྱང་ཆུབ་ཅིས་མི་འཐོབ། ། <br> <br>",
                        "འོན་ཏེ་རྐང་ལག་ལ་སོགས་པ། ། <br> བཏང་དགོས་བདག་ནི་འཇིགས་ཤེ་ན། ། <br> ལྕི་དང་ཡང་བ་མ་དཔྱད་པར། ། <br> རྨོངས་པས་བདག་ནི་འཇིགས་པར་ཟད། ། <br> <br>",
                        "བསྐལ་པ་བྱེ་བ་གྲངས་མེད་དུ། ། <br> ལན་གྲངས་དུ་མར་བཅད་པ་དང་། ། <br> དབུག་དང་བསྲེག་དང་གཤེགས་འགྱུར་གྱི། ། <br> བྱང་ཆུབ་ཐོབ་པར་མི་འགྱུར་རོ། ། <br> <br>",
                        "བདག་གིས་བྱང་ཆུབ་སྒྲུབ་པ་ཡི། ། <br> སྡུག་བསྔལ་འདི་ནི་ཚོད་ཡོད་དེ། ། <br> ཟུག་རྔུ་ཁོང་བརླག་གནོད་བསལ་ཕྱིར། ། <br> ལུས་རྨ་བཏོད་པའི་སྡུག་བསྔལ་བཞིན། ། <br> <br>",
                        "སྨན་པ་ཀུན་ཀྱང་གསོ་དཔྱད་ཀྱི། ། <br> མི་བདེ་བ་ཡིས་ནད་མེད་བྱེད། ། <br> དེ་བས་སྡུག་བསྔལ་མང་པོ་དག ། <br> གཞོམ་ཕྱིར་མི་བདེ་ཆུང་བཟོད་བྱ། ། <br> <br>",
                        "གསོ་དཔྱད་ཕལ་པ་འདི་འདྲ་བ། ། <br> སྨན་པ་མཆོག་གིས་མ་མཛད་དེ། ། <br> ཆོ་ག་ཤིན་ཏུ་འཇམ་པོ་ཡིས། ། <br> ནད་ཆེན་དཔག་མེད་གསོ་བར་མཛད། ། <br> <br>",
                        "ཚོད་མ་ལ་སོགས་སྦྱིན་པ་ལའང་། ། <br> འདྲེན་པས་ཐོག་མར་སྦྱོར་བར་མཛད། ། <br> དེ་ལ་གོམས་ནས་ཕྱི་ནས་ནི། ། <br> རིམ་གྱིས་རང་གི་ཤ་ཡང་གཏོང་། ། <br> <br>",
                        "གང་ཚེ་རང་གི་ལུས་ལ་ནི། ། <br> ཚོད་སོགས་ལྟ་བུའི་བློ་སྐྱེས་པ། ། <br> དེ་ཚེ་ཤ་ལ་སོགས་གཏོང་བ། ། <br> དེ་ལ་དཀའ་བ་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "སྡིག་པ་སྤང་ཕྱིར་སྡུག་བསྔལ་མེད། ། <br> མཁས་པའི་ཕྱིར་ན་མི་དགའ་མེད། ། <br> འདི་ལྟར་ལོག་པར་རྟོག་པ་དང་། ། <br> སྡིག་པས་སེམས་དང་ལུས་ལ་གནོད། ། <br> <br>",
                        "བསོད་ནམས་ཀྱིས་ནི་ལུས་བདེ་ལ། ། <br> མཁས་པ་ཡིས་ནི་སེམས་བདེ་ན། ། <br> གཞན་དོན་འཁོར་བར་གནས་ཀྱང་ནི། ། <br> སྙིང་རྗེ་ཅན་དག་ཅི་སྟེ་སྐྱོ། ། <br> <br>",
                        "འདི་ནི་བྱང་ཆུབ་སེམས་སྟོབས་ཀྱིས། ། <br> སྔོན་གྱི་སྡིག་པ་ཟད་བྱེད་ཅིང་། ། <br> བསོད་ནམས་རྒྱ་མཚོ་སྡུད་བྱེད་ཕྱིར། ། <br> ཉན་ཐོས་རྣམས་པས་མཆོག་ཏུ་བཤད། ། <br> <br>",
                        "དེ་བས་སྐྱོ་ངལ་ཀུན་སེལ་བའི། ། <br> བྱང་ཆུབ་སེམས་ཀྱི་རྟ་ཞོན་ནས། ། <br> བདེ་ནས་བདེ་བར་འགྲོ་བ་ལ། ། <br> སེམས་ཤེས་སུ་ཞིག་སྒྱིད་ལུག་འགྱུར། ། <br> <br>",
                        "སེམས་ཅན་དོན་གྲུབ་བྱ་ཕྱིར་དཔུང་། ། <br> མོས་བརྟན་དགའ་དང་དོར་བ་ཡིན། ། <br> མོས་པ་སྡུག་བསྔལ་འཇིགས་པ་དང་། ། <br> དེ་ཡི་ཕན་ཡོན་བསམ་པས་བསྐྱེད། ། <br> <br>",
                        "དེ་ལྟར་མི་མཐུན་ཕྱོགས་སྤངས་ཏེ། ། <br> མོས་དང་ང་རྒྱལ་དགའ་དང་དོར། ། <br> ལྷུར་ལེན་དབང་བསྒྱུར་སྟོབས་ཀྱིས་ནི། ། <br> བརྩོན་འགྲུས་སྤེལ་ཕྱིར་འབད་པར་བྱ། ། <br> <br>",
                        "བདག་དང་གཞན་གྱི་ཉེས་པ་ནི། ། <br> དཔག་མེད་བདག་གིས་གཞོམ་བྱ་སྟེ། ། <br> གང་དུ་ཉེས་པ་རེ་རེ་ལའང་། ། <br> བསྐལ་པ་རྒྱ་མཚོ་ཟད་འགྱུར་བ། ། <br> <br>",
                        "ཉེས་ཟད་རྩོམ་པ་དེ་ཡི་ནི། ། <br> ཆ་ཡང་བདག་ལ་མ་མཐོང་ན། ། <br> སྡུག་བསྔལ་དཔག་ཏུ་མེད་པའི་གནས། ། <br> བདག་གོ་ཅི་ཕྱིར་སྙིང་མ་གས། ། <br> <br>",
                        "བདག་དང་གཞན་གྱི་ཡོན་ཏན་ནི། ། <br> མང་པོ་བདག་གིས་བསྒྲུབ་བྱ་སྟེ། ། <br> དེ་ལ་ཡོན་ཏན་རེ་རེ་ཡང་། ། <br> བསྐལ་པ་རྒྱ་མཚོས་གོམས་འགྱུར་ན། ། <br> <br>",
                        "བདག་ནི་ཡོན་ཏན་ཆ་ལ་ཡང་། ། <br> གོམས་པ་ནམ་ཡང་མ་སྐྱེས་ཏེ། ། <br> ཇི་ཞིག་ལྟར་རྙེད་སྐྱེ་བ་ནི། ། <br> བདག་གིས་དོན་མེད་བྱས་པ་མཚར། ། <br> <br>",
                        "བདག་གིས་བཅོམ་ལྡན་མ་མཆོད་ཅིང་། ། <br> དགའ་སྟོན་ཆེན་པོའི་བདེ་མ་བྱིན། ། <br> བསྟན་ལ་བྱ་བ་མ་བྱས་དང་། ། <br> དབུལ་པོའི་བསམ་པ་རྫོགས་མ་བྱས། ། <br> <br>",
                        "འཇིགས་ལ་མི་འཇིགས་མ་བྱིན་དང་། ། <br> ཉམ་ཐག་བདེ་མ་བྱིན་ན་བདག ། <br> མ་ཡི་མངལ་གྱི་ཟུག་རྔུ་དང་། ། <br> སྡུག་བསྔལ་འབའ་ཞིག་བསྐྱེད་པར་ཟད། ། <br> <br>",
                        "བདག་ནི་སྔོན་དང་ད་ལྟར་ཡང་། ། <br> ཆོས་ལ་མོས་དང་བྲལ་བ་ཡིས། ། <br> ཕོངས་པ་འདི་འདྲ་བྱུང་བར་གྱུར། ། <br> སུ་ཞིག་ཆོས་ལ་མོས་པ་གཏོང་། ། <br> <br>",
                        "དགེ་བའི་ཕྱོགས་ནི་ཐམས་ཅད་ཀྱི། ། <br> རྩ་བ་མོས་པར་ཐུབ་པས་གསུངས། ། <br> དེ་ཡི་རྩ་བ་རྟག་ཏུ་ནི། ། <br> རྣམ་སྨིན་འབྲས་བུ་བསྒོམས་པས་སོ། ། <br> <br>",
                        "སྡུག་བསྔལ་ཡིད་མི་བདེ་བ་དང་། ། <br> འཇིགས་པ་རྣམ་པ་སྣ་ཚོགས་དང་། ། <br> འདོད་པ་རྣམས་དང་བྲལ་བ་ནི། ། <br> སྡིག་པ་སྤྱོད་ལས་འབྱུང་བར་འགྱུར། ། <br> <br>",
                        "ཡིད་ལ་བསམས་པའི་དགེ་བྱས་པས། ། <br> གང་དང་གང་དུ་འགྲོ་འགྱུར་བ། ། <br> དེ་དང་དེར་ནི་བསོད་ནམས་དེས། ། <br> འབྲས་བུའི་ཡོན་གྱིས་མངོན་མཆོད་འགྱུར། ། <br> <br>",
                        "སྡིག་པ་བྱེད་པ་བདེ་འདོད་ཀྱང་། ། <br> གང་དང་གང་དུ་འགྲོ་འགྱུར་བ། ། <br> དེ་དང་དེར་ནི་སྡིག་པ་དེས། ། <br> སྡུག་བསྔལ་མཚོན་གྱིས་རྣམ་པར་འཇོམས། ། <br> <br>",
                        "རྒྱ་ཆེ་དྲི་བཟང་བསིལ་བའི་པདྨའི་སྙིང་པོར་གནས། ། <br> རྒྱལ་བའི་གསུང་སྙན་ཟས་ཀྱིས་གཟི་བརྗིད་བསྐྱེད་བྱས་པ། ། <br> ཐུབ་འོད་ཀྱིས་རྒྱས་པདྨ་ལས་བྱུང་ལུས་མཆོག་ཅན། ། <br> རྒྱལ་བའི་མདུན་གནས་བདེ་གཤེགས་སྲས་སུ་དགེ་བས་འགྱུར། ། <br> <br>",
                        "གཤིན་རྗེའི་སྐྱེས་བུས་པགས་པ་མ་ལུས་བཤུས་པས་ཤིན་ཏུ་ཉམ་ཐག་ཅིང་། ། <br> རབ་ཏུ་ཚ་བའི་མེ་ཡིས་བཞུས་པའི་ཟངས་ཞུན་ལུས་ལ་བླུགས་གྱུར་ལ། ། <br> འབར་བའི་རལ་གྲི་མདུང་ཐུང་གིས་བསྣུན་ཤ་ཡི་དུམ་བུ་བརྒྱར་ལྷགས་ཤིང་། ། <br> ཤིན་ཏུ་འབར་བའི་ལྕགས་ཀྱི་ས་གཞིར་ལྷུང་བ་མི་དགེ་མང་པོས་འགྱུར། ། <br> <br>",
                        "དེ་བས་དགེ་ལ་མོས་བྱ་ཞིང་། ། <br> གུས་པ་ཉིད་དུ་བསྒོམ་པར་བྱ། ། <br> རྡོ་རྗེ་རྒྱལ་མཚན་ཆོ་ག་ཡིས། ། <br> བརྩམས་ནས་ང་རྒྱལ་བསྒོམ་པར་བྱ། ། <br> <br>",
                        "དང་པོར་འབྱོར་པ་བརྟགས་ནས་ནི། ། <br> བརྩམ་མམ་ཡང་ན་མི་བརྩམ་བྱ། ། <br> མ་བརྩམས་པ་ནི་མཆོག་ཡིན་གྱི། ། <br> བརྩམས་ནས་ལྡོག་པར་མི་བྱའོ། ། <br> <br>",
                        "སྐྱེ་བ་གཞན་དུ་དེ་གོམས་ཤིང་། ། <br> སྡིག་དང་སྡུག་བསྔལ་འཕེལ་བར་འགྱུར། ། <br> གཞན་དང་འབྲས་བུའི་དུས་ཀྱང་ནི། ། <br> དམན་འགྱུར་དེ་ཡང་སྒྲུབ་མི་འགྱུར། ། <br> <br>",
                        "ལས་དང་ཉོན་མོངས་ནུས་པས་ཏེ། ། <br> གསུམ་པོ་དག་ལ་ང་རྒྱལ་བྱ། ། <br> བདག་ཉིད་གཅིག་པུས་བྱའོ་ཞེས། ། <br> འདི་ནི་ལས་ཀྱི་ང་རྒྱལ་ཉིད། ། <br> <br>",
                        "ཉོན་མོངས་དབང་མེད་འཇིག་རྟེན་འདིས། ། <br> རང་དོན་སྒྲུབ་པར་མི་ནུས་པས། ། <br> འགྲོ་བས་བདག་ལྟར་མི་ནུས་ཏེ། ། <br> དེ་བས་བདག་གིས་འདི་བྱའོ། ། <br> <br>",
                        "གཞན་དག་དམན་པའི་ལས་བྱེད་ན། ། <br> བདག་ཉིད་ཀྱང་ནི་ཇི་ལྟར་འདུག ། <br> ང་རྒྱལ་གྱིས་ནི་མི་བྱས་ཏེ། ། <br> བདག་ལ་ང་རྒྱལ་མེད་པ་མཆོག ། <br> <br>",
                        "ཤི་བའི་སྦྲུལ་དང་ཕྲད་གྱུར་ན། ། <br> ཁྭ་ཡང་མཁའ་ལྡིང་ལྟ་བུར་སྤྱོད། ། <br> གལ་ཏེ་བདག་ཉིད་ཉམ་ཆུང་ན། ། <br> ལྟུང་བ་ཆུང་ངུའང་གནོད་པར་བྱེད། ། <br> <br>",
                        "ཞུམ་བཅས་རྩོལ་བ་དོར་བ་ལ། ། <br> ཕོངས་ལས་ཐར་བ་ཡོད་དམ་ཅི། ། <br> ང་རྒྱལ་རྩོལ་བ་བསྐྱེད་པས་ནི། ། <br> ཆེན་པོ་ཡིས་ཀྱང་ཐུབ་པར་དཀའ། ། <br> <br>",
                        "དེ་བས་སེམས་ནི་བརྟན་པ་ཡིས། ། <br> ལྟུང་བ་རྣམས་ནི་གཞོམ་བྱ་སྟེ། ། <br> བདག་ནི་ལྟུང་བས་ཕམ་བྱས་ན། ། <br> ཁམས་གསུམ་རྒྱལ་འདོད་བཞད་གད་འགྱུར། ། <br> <br>",
                        "བདག་གིས་ཀུན་ལས་རྒྱལ་བྱ་སྟེ། ། <br> བདག་ལས་སུ་ཡང་རྒྱལ་མི་བྱ། ། <br> རྒྱལ་བ་སེང་གེའི་སྲས་བདག་གིས། ། <br> ང་རྒྱལ་འདི་ལ་གནས་པར་བྱ། ། <br> <br>",
                        "འགྲོ་གང་ང་རྒྱལ་གྱིས་བཅོམ་དེ། ། <br> ཉོན་མོངས་ང་རྒྱལ་ཅན་མ་ཡིན། ། <br> ང་རྒྱལ་ཅན་དགྲའི་དབང་མི་འགྲོ། ། <br> དེ་དག་ང་རྒྱལ་དགྲ་དབང་འགྱུར། ། <br> <br>",
                        "ཉོན་མོངས་ང་རྒྱལ་གྱིས་ཁེངས་ནི། ། <br> ངན་འགྲོར་ང་རྒྱལ་གྱིས་ཁྲིད་ཅིང་། ། <br> མི་ཡི་དགའ་སྟོན་བཅོམ་པ་དང་། ། <br> གཞན་གྱི་ཟས་ཟའི་བྲན་དང་ནི། ། <br> <br>",
                        "གླེན་པ་མི་སྡུག་ཉམ་ཆུང་དང་། ། <br> ཐམས་ཅད་དུ་ནི་བརྙས་པར་འགྱུར། ། <br> ང་རྒྱལ་གྱིས་ཁེངས་དཀའ་ཐུབ་ཅན། ། <br> དེ་ཡང་ང་རྒྱལ་ཅན་གཏོགས་ན། ། <br> དམན་པ་ཅི་འདྲ་ཡིན་པ་སྨྲོས། ། <br> <br>",
                        "གང་ཞིག་ང་རྒྱལ་དགྲ་ལས་རྒྱལ་ཕྱིར་ང་རྒྱལ་འཆང་། ། <br> དེ་ནི་ང་རྒྱལ་ཅན་དང་རྣམ་རྒྱལ་དཔའ་དེ་ཉིད། ། <br> གང་ཞིག་ང་རྒྱལ་དགྲ་བདོ་བ་ཡང་ངེས་བཅོམ་སྟེ། ། <br> འགྲོ་ལ་འདོད་བཞིན་རྒྱལ་བའི་འབྲས་བུ་རྫོགས་པར་བྱེད། ། <br> <br>",
                        "ཉོན་མོངས་ཕྱོགས་ཀྱི་ཁྲོད་གནས་ན། ། <br> རྣམ་པ་སྟོང་དུ་སྲན་གཟུགས་ཏེ། ། <br> ཝ་ལ་སོགས་པས་སེང་གེ་བཞིན། ། <br> ཉོན་མོངས་ཚོགས་ཀྱིས་མི་ཚུགས་བྱ། ། <br> <br>",
                        "ཉམ་ང་ཆེ་ཐང་བྱུང་གྱུར་ཀྱང་། ། <br> མི་ཡིས་མིག་ནི་བསྲུང་བ་ལྟར། ། <br> དེ་བཞིན་ཉམ་ང་བྱུང་གྱུར་ཀྱང་། ། <br> ཉོན་མོངས་དབང་དུ་མི་འགྱུར་བྱ། ། <br> <br>",
                        "བདག་ནི་བསྲེགས་ཏེ་བསད་གྱུར་ཏམ། ། <br> བདག་གི་མགོ་བོ་བཅད་ཀྱང་བླ། ། <br> རྣམ་པ་ཀུན་དུ་ཉོན་མོངས་པའི། ། <br> དགྲ་ལ་འདུད་པར་མི་བྱའོ། ། <br> <br>",
                        "དེ་བཞིན་གནས་སྐབས་ཐམས་ཅད་དུ། ། <br> རིགས་པ་ལས་ནི་གཞན་མི་སྤྱད། ། <br> རྩེད་མོའི་བདེ་འབྲས་འདོད་པ་ལྟར། ། <br> འདི་ཡིས་བྱ་བའི་ལས་གང་ཡིན། ། <br> <br>",
                        "ལས་དེ་ལ་ནི་ཞེན་བྱ་སྟེ། ། <br> ལས་དེས་མི་ངོམས་དགའ་བར་བྱ། ། <br> བདེ་བའི་དོན་དུ་ལས་བྱས་ཀྱང་། ། <br> བདེ་འགྱུར་མི་འགྱུར་གཏོལ་མེད་ཀྱི། ། <br> <br>",
                        "གང་གི་ལས་ཉིད་བདེ་འགྱུར་བ། ། <br> དེ་ལས་མི་བྱེད་ཇི་ལྟར་བདེ། ། <br> སྤུ་གྲིའི་སོར་ཆགས་སྦྲང་རྩི་ལྟའི། ། <br> འདོད་པ་རྣམས་ཀྱིས་མི་ངོམས་ན། ། <br> <br>",
                        "རྣམ་སྨིན་བདེ་ལ་ཞི་བ་ཡི། ། <br> བསོད་ནམས་ཀྱིས་ལྟ་ཅི་སྟེ་ངོམས། ། <br> དེ་ལྟས་ལས་ཚར་ཕྱིན་བྱའི་ཕྱིར། ། <br> ཉི་མ་ཕྱེད་དུས་གདུངས་པ་ཡི། ། <br> <br>",
                        "གླང་ཆེན་མཚོ་ཕྲད་མཚོར་འཇུག་ལྟར། ། <br> ལས་དེ་ལ་ཡང་འཇུག་པར་བྱ། ། <br> སྟོབས་ཉམས་པ་དང་རྗེས་འབྲེལ་ན། ། <br> སླར་བྱའི་དོན་དུ་དོར་བར་བྱ། ། <br> <br>",
                        "ལེགས་པར་ཟིན་ན་ཕྱི་མ་དང་། ། <br> ཕྱི་མ་འདོད་པས་དེ་སྤང་བྱ། ། <br> འཐབ་རྙིང་དགྲ་དང་ལྷན་ཅིག་ཏུ། ། <br> གཡུལ་ངོར་རལ་ཁ་ལྷགས་པ་བཞིན། ། <br> ཉོན་མོངས་མཚོན་ལས་གཟུར་བྱ་ཞིང་། ། <br> ཉོན་མོངས་དགྲ་རྣམས་གཞོམ་པར་བཏེག ། <br> <br>",
                        "གཡུལ་དུ་རལ་གྲི་ལྷུང་གྱུར་ན། ། <br> འཇིགས་པས་མྱུར་དུ་ལེན་པ་ལྟར། ། <br> དེ་བཞིན་དྲན་པའི་མཚོན་ཤོར་ན། ། <br> དམྱལ་བའི་འཇིགས་དྲན་མྱུར་དུ་བླང་། ། <br> <br>",
                        "ཇི་ལྟར་ཁྲག་ལ་བརྟེན་བཅས་ནས། ། <br> དུག་ནི་ལུས་ལ་ཁྱབ་འགྱུར་བ། ། <br> དེ་བཞིན་གླགས་ནི་རྙེད་པ་ན། ། <br> ཉེས་པས་སེམས་ལ་ཁྱབ་པར་འགྱུར། ། <br> <br>",
                        "ཡུངས་མར་བཀང་བའི་སྣོད་བཀུར་ལ། ། <br> རལ་གྲི་ཐོགས་པས་དྲུང་བསྡད་དེ། ། <br> བོ་ན་གསོད་བསྡིགས་འཇིགས་པ་ལྟར། ། <br> བརྟུལ་ཞུགས་ཅན་གྱིས་དེ་བཞིན་སྒྲིམ། ། <br> <br>",
                        "དེ་བས་པང་དུ་སྦྲུལ་འོངས་ན། ། <br> ཇི་ལྟར་རིངས་པར་ལྡང་བ་ལྟར། ། <br> དེ་བཞིན་གཉིད་དང་སྙོམ་འོངས་ན། ། <br> མྱུར་དུ་དེ་དག་བཟློག་པར་བྱ། ། <br> <br>",
                        "ཉེས་པ་བྱུང་བ་རེ་རེ་ཞིང་། ། <br> བདག་ལ་སྨད་ནས་ཅི་ནས་ཀྱང་། ། <br> བདག་ལ་ཕྱིས་འདི་མི་འབྱུང་བ། ། <br> དེ་ལྟར་བྱ་ཞེས་ཡུན་རིང་བསམ། ། <br> <br>",
                        "ཇི་ལྟར་གནས་སྐབས་འདི་དག་ལ། ། <br> དྲན་པ་གོམས་པ་ཉིད་འགྱུར་ཞེས། ། <br> རྒྱུ་འདི་ཡིས་ནི་ཕྲད་པའམ། ། <br> རིགས་པའི་ལས་ནི་འདོད་པར་བྱ། ། <br> <br>",
                        "ཅི་ནས་ལས་བྱེད་སྔོན་རོལ་ནས། ། <br> ཐམས་ཅད་ལ་ནི་མཐུ་ཡོད་པ། ། <br> དེ་ལྟར་བག་ཡོད་གཏམ་དྲན་ཏེ། ། <br> བདག་ཉིད་ལྡང་བ་ཡང་བར་བྱ། ། <br> <br>",
                        "ཇི་ལྟར་རླུང་ནི་འགྲོ་བ་དང་། ། <br> འོང་བས་ཤིང་བལ་དབང་བསྒྱུར་བ། ། <br> དེ་བཞིན་སྤྲོ་བས་དབང་བསྒྱུར་ཏེ། ། <br> དེ་ལྟར་ན་ནི་འགྲུབ་པར་འགྱུར། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། བརྩོན་འགྲུས་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བདུན་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "དེ་ལྟར་བརྩོན་འགྲུས་བསྐྱེད་ནས་ནི། ། <br> ཡིད་ནི་ཏིང་ངེ་འཛིན་ལ་བཞག ། <br> སེམས་ནི་རྣམ་པར་གཡེངས་པའི་མི། ། <br> ཉོན་མོངས་མཆི་བའི་ཕྲག་ན་གནས། ། <br> <br>",
                        "ལུས་དང་སེམས་ནི་དབེན་པ་ཡིས། ། <br> རྣམ་པར་གཡེང་བ་མི་འབྱུང་ངོ་། ། <br> དེ་བས་འཇིག་རྟེན་སྤང་བྱ་ཞིང་། ། <br> རྣམ་པར་རྟོག་པ་ཡོངས་སུ་དོར། ། <br> <br>",
                        "ཆགས་པའི་ཕྱིར་དང་རྙེད་སོགས་ལ། ། <br> སྲེད་པས་འཇིག་རྟེན་མི་སྤོང་སྟེ། ། <br> དེ་བས་འདི་དག་ཡོངས་སྤོངས་ལ། ། <br> མཁས་པས་འདི་ལྟར་དཔྱད་པར་བྱ། ། <br> <br>",
                        "ཞི་གནས་རབ་ཏུ་ལྡན་པའི་ལྷག་མཐོང་གིས། ། <br> ཉོན་མོངས་རྣམ་པར་འཇོམས་པར་ཤེས་བྱས་ནས། ། <br> ཐོག་མར་ཞི་གནས་བཙལ་བྱ་དེ་ཡང་ནི། ། <br> འཇིག་རྟེན་ཆགས་པ་མེད་ལ་མངོན་དགས་འགྲུབ། ། <br> <br>",
                        "མི་རྟག་སུ་ཞིག་མི་རྟག་ལ། ། <br> ཡང་དག་ཆགས་པར་བྱེད་པ་ཡོད། ། <br> དེས་ནི་ཚེ་རབས་སྟོང་ཕྲག་ཏུ། ། <br> སྡུག་པ་མཐོང་བར་ཡོང་མི་འགྱུར། ། <br> <br>",
                        "མ་མཐོང་ན་ནི་དགར་མི་འགྱུར། ། <br> ཡིད་ཀྱང་མཉམ་འཇོག་མི་འགྱུར་ལ། ། <br> མཐོང་ཡང་ངོམས་པར་མི་འགྱུར་བས། ། <br> སྔར་བཞིན་སྲེད་པས་གདུང་བར་འགྱུར། ། <br> <br>",
                        "སེམས་ཅན་རྣམས་ལ་ཆགས་བྱས་ན། ། <br> ཡང་དག་ཉིད་ལ་ཀུན་ནས་སྒྲིབ། ། <br> སྐྱོ་བའི་སེམས་ཀྱང་འཇིག་པར་བྱེད། ། <br> ཐ་མར་མྱ་ངན་གདུང་བར་འགྱུར། ། <br> <br>",
                        "དེ་ལ་སེམས་པ་འབའ་ཞིག་གིས། ། <br> ཚེ་འདི་དོན་མེད་འདའ་བར་འགྱུར། ། <br> རྟག་པ་མེད་པའི་མཛའ་བཤེས་ཀྱིས། ། <br> གཡུང་དྲུང་ཆོས་ཀྱང་འཇིག་པར་འགྱུར། ། <br> <br>",
                        "བྱིས་དང་སྐལ་བ་མཉམ་སྤྱོད་ན། ། <br> ངེས་པར་ངན་འགྲོར་འགྲོ་འགྱུར་ཏེ། ། <br> སྐལ་མི་མཉམ་པར་ཁྲིད་བྱེད་ན། ། <br> བྱིས་པ་བསྟེན་པས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "སྐད་ཅིག་གཅིག་གིས་མཛའ་འགྱུར་ལ། ། <br> ཡུད་ཙམ་གྱིས་ནི་དགྲར་ཡང་འགྱུར། ། <br> དགའ་བའི་གནས་ལ་ཁྲོ་བྱེད་པས། ། <br> སོ་སོའི་སྐྱེ་བོ་མགུ་བར་དཀའ། ། <br> <br>",
                        "ཕན་པར་སྨྲས་ན་ཁྲོ་བར་བྱེད། ། <br> བདག་ཀྱང་ཕན་ལས་བཟློག་པར་བྱེད། ། <br> དེ་དག་ངག་ནི་མ་མཉན་ན། ། <br> ཁྲོ་བས་ངན་འགྲོར་འགྲོ་བར་འགྱུར། ། <br> <br>",
                        "མཐོ་ལ་ཕྲག་དོག་མཉམ་དང་འགྲན། ། <br> དམའ་ལ་ང་རྒྱལ་བསྟོད་ན་དྲེགས། ། <br> མི་སྙན་བརྗོད་ན་ཁོང་ཁྲོ་སྐྱེ། ། <br> ནམ་ཞིག་བྱིས་ལས་ཕན་པ་ཐོབ། <br>",
                        "བྱིས་དང་འགྲོགས་ན་བྱིས་པ་ལ། ། <br> བདག་བསྟོད་གཞན་ལ་སྨོད་པ་དང་། ། <br> འཁོར་བར་དགའ་བའི་གཏམ་ལ་སོགས། ། <br> མི་དགེ་ཅིས་ཀྱང་ངེས་པར་འབྱུང་། ། <br> <br>",
                        "དེ་ལྟར་བདག་དང་གཞན་བསྟེན་པ། ། <br> དེས་ནི་ཕུང་བར་འགྱུར་བར་ཟད། ། <br> དེས་ཀྱང་བདག་དོན་མ་བྱས་ལ། ། <br> བདག་ཀྱང་དེ་དོན་མི་འགྱུར་བས། ། <br> <br>",
                        "བྱིས་ལས་ཐག་རིང་བྱོལ་བར་བྱ། ། <br> ཕྲད་ན་དགའ་བས་མགུ་བྱས་ཏེ། ། <br> འདྲིས་ཆེན་ཉིད་དུ་མི་འགྱུར་བར། ། <br> ཐ་མལ་པ་ཙམ་ལེགས་པར་བྱ། ། <br> <br>",
                        "བུང་བས་མེ་ཏོག་སྦྲང་རྩི་བཞིན། ། <br> ཆོས་ཀྱི་དོན་ཙམ་བླངས་ནས་ནི། ། <br> ཀུན་ལས་སྔོན་ཆད་མ་མཐོང་བཞིན། ། <br> འདྲིས་པ་མེད་པར་གནས་པར་བྱ། ། <br> <br>",
                        "བདག་ནི་རྙེད་མང་བཀུར་སྟི་བཅས། ། <br> བདག་ལ་མང་པོ་དགའ་འོ་ཞེས། ། <br> དེ་འདྲའི་སྙེམས་པ་འཆང་གྱུར་ན། ། <br> ཤི་བའི་འོག་ཏུ་འཇིགས་པ་སྐྱེ། ། <br> <br>",
                        "དེ་བས་རྣམ་པར་རྨོངས་པའི་ཡིད། ། <br> གང་དང་གང་ལ་ཆགས་གྱུར་པ། ། <br> དེ་དང་དེ་བསྡོངས་སྟོང་འགྱུར་དུ། ། <br> སྡུག་བསྔལ་ཉིད་དུ་གྱུར་ཅིང་ལྡང་། ། <br> <br>",
                        "དེ་བས་མཁས་པས་ཆགས་མི་བྱ། ། <br> ཆགས་པ་ལས་ནི་འཇིགས་པ་སྐྱེ། ། <br> འདི་དག་རང་བཞིན་འདོར་འགྱུར་བས། ། <br> བརྟན་པར་གྱིས་ཏེ་རབ་ཏུ་རྟོགས། ། <br> <br>",
                        "རྙེད་པ་དག་ནི་མང་བྱུང་ཞིང་། ། <br> གྲགས་དང་སྙན་པ་བྱུང་གྱུར་ཀྱང་། ། <br> རྙེད་དང་གྲགས་པའི་ཚོགས་བཅས་ཏེ། ། <br> གང་དུ་འདོང་བའི་གཏོལ་མེད་དོ། ། <br> <br>",
                        "བདག་ལ་སྨོད་པ་གཞན་ཡོད་ན། ། <br> བསྟོད་པས་བདག་དགར་ཅི་ཞིག་ཡོད། ། <br> བདག་ལ་བསྟོད་པ་གཞན་ཡོད་ན། ། <br> སྨད་པས་མི་དགར་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "སེམས་ཅན་མོས་པ་སྣ་ཚོགས་པ། ། <br> རྒྱལ་བས་ཀྱང་ནི་མི་མགུ་ན། ། <br> བདག་འདྲ་ངན་པས་སྨོས་ཅི་དགོས། ། <br> དེ་བས་འཇིག་རྟེན་བསམ་པ་བཏང་། ། <br> <br>",
                        "སེམས་ཅན་རྙེད་པ་མེད་ལ་སྨོད། ། <br> རྙེད་པ་ཅན་ལ་མི་སྙན་བརྗོད། ། <br> རང་བཞིན་འགྲོགས་དཀའ་དེ་དག་གིས། ། <br> དགའ་བ་ཇི་ལྟར་སྐྱེ་བར་འགྱུར། ། <br> <br>",
                        "གང་ཕྱིར་བྱིས་པ་རང་དོན་ནི། ། <br> མེད་པར་དགའ་བ་མི་འབྱུང་བས། ། <br> བྱིས་པ་འགའ་ཡང་བཤེས་མིན་ཞེས། ། <br> དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་གསུངས། ། <br> <br>",
                        "ནགས་ན་རི་དགས་བྱ་རྣམས་དང་། ། <br> ཤིང་རྣམས་མི་སྙན་རྗོད་མི་བྱེད། ། <br> འགྲོགས་ན་བདེ་བ་དེ་དག་དང་། ། <br> ནམ་ཞིག་ལྷན་ཅིག་བདག་གནས་འགྱུར། ། <br> <br>",
                        "ཕུག་གམ་ལྷ་ཁང་སྟེང་པའམ། ། <br> ལྗོན་ཤིང་དྲུང་དུ་གནས་བཅས་ཏེ། ། <br> ནམ་ཞིག་རྒྱབ་ཏུ་མི་ལྟ་ཞིང་། ། <br> ཆགས་པ་མེད་པར་འགྱུར་ཞིག་གུ། ། <br> <br>",
                        "ས་ཕྱོགས་བདག་གིར་བཟུང་མེད་པ། ། <br> རང་བཞིན་གྱིས་ནི་ཡངས་རྣམས་སུ། ། <br> རང་དབང་སྤྱོད་ཅིང་ཆགས་མེད་པར། ། <br> ནམ་ཞིག་བདག་ནི་གནས་པར་འགྱུར། ། <br> <br>",
                        "ལྷུང་བཟེད་ལ་སོགས་ཉི་ཚེ་དང་། ། <br> ཀུན་ལ་མི་མཁོའི་གོས་འཆང་ཞིང་། ། <br> ལུས་འདི་སྦ་བ་མ་བྱས་ཀྱང་། ། <br> འཇིགས་མེད་གནས་པ་ནམ་ཞིག་འགྱུར། ། <br> <br>",
                        "དུར་ཁྲོད་སོང་ནས་གཞན་དག་གི། ། <br> རུས་གོང་དག་དང་བདག་གི་ལུས། ། <br> འཇིག་པའི་ཆོས་ཅན་དག་ཏུ་ནི། ། <br> ནམ་ཞིག་མགོ་སྙོམས་བྱེད་པར་འགྱུར། ། <br> <br>",
                        "བདག་གི་ལུས་ནི་འདི་ཉིད་ཀྱང་། ། <br> གང་གི་དྲི་ཡིས་ཝ་དག་ཀྱང་། ། <br> དྲུང་དུ་ཉེར་འགྲོ་མི་འགྱུར་བ། ། <br> དེ་ལྟ་བུར་ནི་འགྱུར་བར་འོང་། ། <br> <br>",
                        "ལུས་འདི་གཅིག་པུ་བྱུང་བ་ཡང་། ། <br> ལྷན་ཅིག་སྐྱེས་པའི་ཤ་རུས་དག ། <br> ཞིག་སྟེ་སོ་སོར་འགྱེས་འགྱུར་ན། ། <br> མཛའ་བ་གཞན་དག་ཅི་ཞིག་སྨོས། ། <br> <br>",
                        "སྐྱེ་ན་གཅིག་པུ་སྐྱེ་འགྱུར་ཞིང་། ། <br> འཆི་ནའང་དེ་ཉིད་གཅིག་འཆི་སྟེ། ། <br> སྡུག་བསྔལ་སྐལ་གཞན་མི་ལེན་ན། ། <br> གེགས་བྱེད་མཛའ་བས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "ལམ་དག་ཏུ་ནི་ཞུགས་པ་རྣམས། ། <br> ཇི་ལྟར་གནས་ནི་འཛིན་བྱེད་ལྟར། ། <br> དེ་བཞིན་སྲིད་པའི་ལམ་ཞུགས་པའང་། ། <br> སྐྱེ་བའི་གནས་ནི་ཡོངས་སུ་འཛིན། ། <br> <br>",
                        "འཇིག་རྟེན་ཀུན་ནས་གདུང་བཞིན་དུ། ། <br> ཇི་སྲིད་སྐྱེས་བུ་བཞི་ཡིས་ནི། ། <br> དེ་ལས་དེ་ནི་མ་བཏེག་པ། ། <br> དེ་སྲིད་དུ་ནི་ནགས་སུ་སོང་། ། <br> <br>",
                        "བཤེས་མེད་འཁོན་པའང་མེད་བྱས་ནས། ། <br> ལུས་འདི་གཅིག་པུ་དབེན་གནས་ཏེ། ། <br> སྔ་ནས་ཤི་དང་འདྲར་བརྩིས་ནས། ། <br> ཤི་ནའང་མྱ་ངན་བྱེད་པ་མེད། ། <br> <br>",
                        "དྲུང་ན་འཁོད་པ་སུ་དག་ཀྱང་། ། <br> མྱ་ངན་གནོད་པ་བྱེད་མེད་པས། ། <br> འདི་ཡིས་སངས་རྒྱས་རྗེས་དྲན་སོགས། ། <br> སུས་ཀྱང་གཡེངས་པར་འགྱུར་བ་མེད། ། <br> <br>",
                        "དེ་བས་ཤིན་ཏུ་མདངས་དགའ་བའི། ། <br> ནགས་ཚལ་ཚེགས་ཆུང་བདེ་སྐྱིད་ཅིང་། ། <br> གཡེང་བ་ཐམས་ཅད་ཞི་བྱེད་པར། ། <br> བདག་ཉིད་གཅིག་པུ་གནས་པར་བྱ། ། <br> <br>",
                        "བསམ་པ་གཞན་ནི་ཀུན་བཏང་སྟེ། ། <br> བདག་ལ་སེམས་པ་གཅིག་པུ་ཡིས། ། <br> སེམས་ནི་མཉམ་པར་གཞག་ཕྱིར་དང་། ། <br> དུལ་བར་བྱ་ཕྱིར་བརྩོན་ཏེ་བྱ། ། <br> <br>",
                        "འཇིག་རྟེན་འདི་དང་ཕ་རོལ་དུའང་། ། <br> འདོད་པ་རྣམས་ནི་ཕུང་ཁྲོལ་བསྐྱེད། ། <br> འདིར་ནི་བསད་དང་བཅིང་དང་གཅོད། ། <br> ཕ་རོལ་དུ་ནི་དམྱལ་སོགས་སྒྲུབ། ། <br> <br>",
                        "ཕོ་ཉ་ཕོ་ཉ་མོ་ཡིས་སྔོན། ། <br> གང་ཕྱིར་དུ་མར་གསོལ་བཏབ་ཅིང་། ། <br> སྡིག་པ་རྣམས་སམ་གྲགས་མིན་ལའང་། ། <br> གང་གི་དོན་དུ་མ་འཛེམས་པར། ། <br> <br>",
                        "འཇིགས་པ་ལ་ཡང་བདག་ཞུགས་ཤིང་། ། <br> རྫས་ཀྱང་ཟད་པར་བྱས་གྱུར་ཏེ། ། <br> གང་ལ་ཡོངས་སུ་འཁྱུད་པས་ན། ། <br> མཆོག་ཏུ་དགའ་འགྱུར་དེ་དག་ཉིད། ། <br> <br>",
                        "ཀེང་རུས་ཉིད་ཡིན་གཞན་མིན་ན། ། <br> རང་དབང་དང་ནི་བདག་མིན་ལ། ། <br> རབ་ཏུ་འདོད་ཅིང་ཡོངས་ཞེན་ནས། ། <br> ཅི་ཕྱིར་མྱ་ངན་འདས་མི་འགྲོ། ། <br> <br>",
                        "གང་ཞིག་དང་པོ་འབད་དེ་བཏེག ། <br> དྲངས་ཀྱང་ངོ་ཚས་འོག་ཏུ་ལྟ། ། <br> སྔོན་ནི་མཐོང་ངམ་མ་མཐོང་ཡང་། ། <br> གོས་ཀྱིས་གདོང་ནི་གཡོགས་པར་གྱུར། ། <br> <br>",
                        "ཁྱོད་ཉོན་མོངས་པའི་གདོང་དེ་ནི། ། <br> ད་ལྟ་མངོན་སུམ་གྱུར་པ་བཞིན། ། <br> བྱ་རྒོད་ཀྱིས་བསལ་བྱས་མཐོང་ནས། ། <br> ད་ལྟ་ཅི་ཕྱིར་འབྱེར་བར་བྱེད། ། <br> <br>",
                        "གཞན་རྣམས་མིག་གིས་བལྟ་ན་ཡང་། ། <br> གང་ཞིག་ཡོངས་སུ་བསྲུང་གྱུར་པ། ། <br> ཇི་སྲིད་དེ་ནི་དེས་ཟ་ན། ། <br> སེར་སྣ་ཅན་ཁྱོད་ཅིས་མི་བསྲུང་། ། <br> <br>",
                        "ཤ་ཡི་ཕུང་པོ་འདི་མཐོང་ནས། ། <br> བྱ་རྒོད་དང་གཞན་ཟ་བྱེད་ན། ། <br> གཞན་གྱི་ཟས་ལ་མེ་ཏོག་གི །ཕྲེང་བ་ཙནྡན་རྒྱན་གྱིས་མཆོད། ། <br> <br>",
                        "རུས་གོང་ཉིད་དུ་མཐོང་ནས་ནི། ། <br> མི་འགུལ་ཡང་ནི་ཁྱོད་སྐྲག་ན། ། <br> རོ་ལངས་བཞིན་དུ་འགའ་ཡིས་ཀྱང་། ། <br> བསྐྱོད་པར་གྱུར་ན་ཅིས་མི་འཇིགས། ། <br> <br>",
                        "གང་ལ་གཡོགས་ཀྱང་འདི་ཆགས་པ། ། <br> དེ་མ་གཡོགས་ན་ཅིས་མི་འདོད། ། <br> དེ་ལ་དགོས་པ་མེད་ན་ནི། ། <br> གཡོགས་པ་ལ་ནི་ཅི་ཕྱིར་འཁྱུད། ། <br> <br>",
                        "ཟས་ནི་གཅིག་པུ་ཉིད་ལས་ནི། ། <br> བཤང་དང་ཁ་ཆུ་བྱུང་གྱུར་ན། ། <br> དེ་ལས་བཤང་ལ་མི་དགའ་ཞིང་། ། <br> ཁ་ཆུ་ལ་ཁྱོད་ཅི་ཕྱིར་དགའ། ། <br> <br>",
                        "ཤིང་བལ་རེག་ན་འཇམ་པ་ཡི། ། <br> སྔས་ལ་དགའ་བར་མི་བྱེད་པར། ། <br> དྲི་ང་འཛག་པ་མ་ཡིན་ཞེས། ། <br> འདོད་ལྡན་མི་གཙང་བ་ལ་རྨོངས། ། <br> <br>",
                        "འདོད་ལྡན་ངན་པ་རྨོངས་པ་རྣམས། ། <br> ཤིང་བལ་རེག་ན་འཇམ་པ་ལའང་། ། <br> ཉལ་པོ་བྱ་བར་མི་ནུས་ཞེས། ། <br> དེ་ལ་ཁྲོ་བ་དག་ཏུ་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་མི་གཙང་ཆགས་མེད་ན། ། <br> རུས་གཟེབ་རྒྱུས་པས་སྦྲེལ་བ་ལ། ། <br> ཤ་ཡི་འདམ་གྱིས་ཞལ་ཞལ་བྱས། ། <br> གཞན་ཁྱོད་ཅི་ཕྱིར་པང་དུ་འཁྱུད། ། <br> <br>",
                        "ཁྱོད་ཉིད་མི་གཙང་མང་ཡོད་པ། ། <br> དེ་ཉིད་ལ་ཁྱོད་གཏན་སྤྱོད་ཅིང་། ། <br> མི་གཙང་རྐྱལ་པ་གཞན་དག་ལའང་། ། <br> མི་གཙང་བརྐམ་པས་འདོད་པར་བྱེད། ། <br> <br>",
                        "བདག་ནི་ཤ་འདི་ལ་དགའ་ཞེས། ། <br> རེག་དང་བལྟ་བར་འདོད་ན་ཀོ། ། <br> སེམས་མེད་པ་ཡི་རང་བཞིན་གྱི། ། <br> ཤ་ནི་ཁྱོད་ཀོ་ཇི་ལྟར་འདོད། ། <br> <br>",
                        "འདོད་པའི་སེམས་གང་ཡིན་པ་དེ། ། <br> རེག་དང་བལྟ་བར་མི་ནུས་ལ། ། <br> གང་ཞིག་ནུས་དེ་ཤེས་པ་མིན། ། <br> དོན་མེད་འཁྱུད་དེས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "མི་གཙང་རང་བཞིན་གཞན་གྱི་ལུས། ། <br> མི་རྟོགས་ངོ་མཚར་མི་ཆེ་ཡི། ། <br> རང་ཉིད་མི་གཙང་ཉིད་ཡིན་པར། ། <br> རྟོགས་པར་མི་འགྱུར་ངོ་མཚར་ཆེ། ། <br> <br>",
                        "སྤྲིན་བྲལ་ཉི་ཟེར་གྱིས་ཕྱེ་བའི། ། <br> པདྨ་གཞོན་ནུ་སྤངས་ནས་ནི། ། <br> མི་གཙང་ཞེན་པའི་སེམས་ཀྱིས་ནི། ། <br> མི་གཙང་གཟེབ་ལ་ཅི་ཕྱིར་དགའ། ། <br> <br>",
                        "ས་ཕྱོགས་མི་གཙང་གིས་གོས་པ། ། <br> གལ་ཏེ་རེག་པར་མི་འདོད་ན། ། <br> གང་ལས་དེ་ནི་བྱུང་བ་ཡི། ། <br> ལུས་ལ་ཇི་ལྟར་ཁྱོད་རེག་འདོད། ། <br> <br>",
                        "གལ་ཏེ་མི་གཙང་ཆགས་མེད་ན། ། <br> མི་གཙང་ཞིང་ལས་བྱུང་གྱུར་ཅིང་། ། <br> དེ་ཡི་ས་བོན་དེས་བསྐྱེད་པ། ། <br> གཞན་ཁྱོད་ཅི་ཕྱིར་པང་དུ་འཁྱུད། ། <br> <br>",
                        "མི་གཙང་ལས་བྱུང་མི་གཙང་སྲིན། ། <br> ཆུང་ངུའང་ཁྱོད་འདོད་མི་བྱེད་ལ། ། <br> མི་གཙང་མང་གི་རང་བཞིན་ལུས། ། <br> མི་གཙང་སྐྱེས་པའང་འདོད་པར་བྱེད། ། <br> <br>",
                        "ཁྱོད་ནི་རང་ཉིད་མི་གཙང་ལ། ། <br> སྨོད་མི་བྱེད་པར་མ་ཟད་ཀྱི། ། <br> མི་གཙང་རྐྱལ་པ་མི་གཙང་ལ། ། <br> བརྐམ་པས་གཞན་ཡང་འདོད་པར་བྱེད། ། <br> <br>",
                        "ག་པུར་ལ་སོགས་ཡིད་འོང་དང་། ། <br> འབྲས་ཆན་དག་གམ་ཚོད་མའང་རུང་། ། <br> ཁར་བཅུག་ཕྱིར་ཕྱུང་བོར་བ་ཡིས ། ། <br> ས་ཡང་མི་གཙང་བཙོག་པར་འགྱུར། ། <br> <br>",
                        "གལ་ཏེ་མི་གཙང་འདི་འདྲ་བ། ། <br> མངོན་སུམ་གྱུར་ཀྱང་ཐེ་ཚོམ་ན། ། <br> དུར་ཁྲོད་དག་ཏུ་བོར་བའི་ལུས། ། <br> མི་གཙང་གཞན་ཡང་བལྟ་བར་གྱིས། ། <br> <br>",
                        "གང་ལས་པགས་པའི་ཁ་ཕྱེ་ན། ། <br> འཇིགས་པ་ཆེན་པོ་སྐྱེ་འགྱུར་བར། ། <br> ཤེས་ཀྱང་ཇི་ལྟར་དེ་ཉིད་ལ། ། <br> ཕྱིར་ཞིང་དགའ་བ་སྐྱེ་བར་འགྱུར། ། <br> <br>",
                        "ལུས་ལ་བསྐུས་པའི་དྲི་དེ་ཡང་། ། <br> ཙནྡན་སོགས་ཡིན་གཞན་མ་ཡིན། ། <br> གཞན་གྱི་དྲི་དེས་གཞན་དག་ལ། ། <br> ཅི་ཡི་ཕྱིར་ན་ཆགས་པར་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་རང་བཞིན་དྲི་ང་བས། ། <br> འདི་ལ་མ་ཆགས་ལེགས་མིན་ནམ། ། <br> འཇིག་རྟེན་དོན་མེད་སྲེག་པ་དག ། <br> ཇི་སྟེ་དེ་ལ་དྲི་ཞིམ་སྐུད། ། <br> <br>",
                        "འོན་ཏེ་དྲི་ཞིམ་ཙནྡན་ནི། ། <br> ལུས་ལ་འདིར་ནི་ཅི་ཞིག་བྱུང་། ། <br> གཞན་གྱི་དྲི་ཡིས་གཞན་དག་ལ། ། <br> ཅི་ཡི་ཕྱིར་ན་ཆགས་པར་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་སྐྲ་སེན་རིང་བ་དང་། ། <br> སོ་སྐྱ་དྲིར་བཅས་འདམ་གྱི་དྲིས། ། <br> བསྒོས་པས་ལུས་ཀྱི་རང་བཞིན་ནི། ། <br> གཅེར་བུ་འཇིགས་པ་ཉིད་ཡིན་ན། ། <br> <br>",
                        "རང་ལ་གནོད་པའི་མཚོན་བཞིན་དུ། ། <br> དེ་འབད་ཅི་ཕྱིར་བྱི་དོར་བྱེད། ། <br> བདག་ལ་རྨོངས་པའི་འབད་པ་ཡིས། ། <br> སྨྱོས་པས་ས་འདི་ཀུན་ཏུ་འཁྲུགས། ། <br> <br>",
                        "རུས་གོང་འབའ་ཞིག་མཐོང་ནས་ནི། ། <br> དུར་ཁྲོད་དུ་ནི་ཡིད་འབྱུང་ན། ། <br> གཡོ་བའི་རུས་གོང་གིས་ཁྱབ་པའི། ། <br> གྲོང་གི་དུར་ཁྲོད་ལ་དགའ་འམ། ། <br> <br>",
                        "དེ་ལྟར་མི་གཙང་གྱུར་པ་དེ། ། <br> རིན་མེད་པར་ནི་མི་རྙེད་དོ། ། <br> དེ་དོན་བསྒྲུབས་པས་ཤ་ཐང་དང་། ། <br> དམྱལ་ལ་སོགས་པའི་གནོད་པར་འགྱུར། ། <br> <br>",
                        "བྱིས་པ་ནོར་སྤེལ་མི་ནུས་པས། ། <br> དར་ལ་བབ་ན་འདི་ཅི་བདེ། ། <br> ནོར་སོགས་པ་ཡིས་ཚེ་གཏུགས་ན། ། <br> རྒས་ནས་འདོད་པས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "འདོད་ལྡན་ངན་པ་ཁ་ཅིག་ནི། ། <br> ཉིན་རངས་ལས་ཀྱིས་ཡོངས་དུབ་སྟེ། ། <br> ཁྱིམ་དུ་འོངས་ནས་ཆད་པའི་ལུས། ། <br> རོ་དང་འདྲ་བར་ཉལ་བར་བྱེད། ། <br> <br>",
                        "ཁ་ཅིག་བྱེས་བགྲོད་ཉོན་མོངས་དང་། ། <br> རིང་དུ་སོང་བའི་སྡུག་བསྔལ་ཅན། ། <br> བུ་སྨད་འདོད་བཞིན་བུ་སྨད་རྣམས། ། <br> ཁྱུད་ཁོར་ལོས་ཀྱང་མཐོང་མི་འགྱུར། ། <br> <br>",
                        "བདག་ལ་ཕན་འདོད་རྣམ་རྨོངས་པས། ། <br> གང་དོན་ཉིད་དུ་བཙོང་བ་ཡང་། ། <br> དེ་མ་ཐོབ་པར་དོན་མེད་པའི། ། <br> གཞན་གྱི་ལས་ཀྱི་རླུང་གིས་བདས། ། <br> <br>",
                        "ལ་ལ་རང་གི་ལུས་བཙོང་ཞིང་། ། <br> དབང་མེད་གཞན་གྱིས་བཀོལ་གྱུར་ཏེ། ། <br> ཆུང་མ་དག་ཀྱང་བུ་བྱུང་ན། ། <br> ཤིང་དྲུང་དགོན་པར་བབ་བབ་འབྱུང་། ། <br> <br>",
                        "འདོད་པས་བསླུས་པའི་གླེན་པ་དག ། <br> འཚོ་འདོད་འཚོ་བར་བྱའོ་ཞེས། ། <br> སྲོག་སྟོར་དོགས་བཞིན་གཡུལ་དུ་འཇུག ། <br> ཁེ་ཕྱིར་བྲན་དུ་འགྲོ་བར་བྱེད། ། <br> <br>",
                        "འདོད་ལྡན་ལ་ལ་ལུས་ཀྱང་བཅད། ། <br> ཁ་ཅིག་གསལ་ཤིང་རྩེ་ལ་བཙུགས། ། <br> ཁ་ཅིག་མདུང་ཐུང་དག་གིས་བསྣུན། ། <br> ཁ་ཅིག་བསྲེགས་པ་དག་ཀྱང་སྣང་། ། <br> <br>",
                        "བསགས་དང་བསྲུང་དང་བརླག་པའི་གདུང་བ་ཡིས། ། <br> ནོར་ནི་ཕུང་ཁྲོལ་མཐའ་ཡས་ཤེས་པར་བྱ། ། <br> ནོར་ལ་ཆགས་པས་གཡེངས་པར་གྱུར་པ་རྣམས། ། <br> སྲིད་པའི་སྡུག་བསྔལ་ལས་གྲོལ་སྐབས་མེད་དོ། ། <br> <br>",
                        "འདོད་ལྡན་རྣམས་ལ་དེ་ལ་སོགས། ། <br> ཉེས་དམིགས་མང་ལ་མནོག་ཆུང་སྟེ། ། <br> ཤིང་རྟ་འདྲེན་པའི་ཕྱུགས་དག་གིས། ། <br> རྩྭ་ནི་ཁམ་འགའ་ཟོས་པ་བཞིན། ། <br> <br>",
                        "ཕྱུགས་ཀྱིས་བསྒྲུབས་ནའང་མི་དཀོན་པའི། ། <br> མནོག་ཆུང་གང་ཡིན་དེ་དོན་དུ། ། <br> དལ་འབྱོར་ཕུན་སུམ་རྙེད་དཀའ་འདི། ། <br> ལས་ཀྱིས་མནར་བ་རྣམས་ཀྱིས་བཅོམ། ། <br> <br>",
                        "འདོད་པ་ངེས་པར་འཇིག་འགྱུར་ཞིང་། ། <br> དམྱལ་ལ་སོགས་པར་ལྟུང་བྱེད་པ། ། <br> ཆེན་པོ་མིན་ཕྱིར་དུས་ཀུན་དུ། ། <br> དུབ་པའི་ཚེགས་བྱུང་གང་ཡིན་པ། ། <br> <br>",
                        "དེ་ཡི་བྱེ་བའི་ཆ་ཙམ་གྱི། ། <br> ཚེགས་ཀྱིས་སངས་རྒྱས་ཉིད་འགྲུབ་ན། ། <br> འདོད་ལྡན་བྱང་ཆུབ་སྤྱོད་པ་བས། ། <br> སྡུག་བསྔལ་ཆེ་ལ་བྱང་ཆུབ་མེད། ། <br> <br>",
                        "དམྱལ་སོགས་སྡུག་བསྔལ་བསམ་བྱས་ན། ། <br> འདོད་པ་རྣམས་ལ་མཚོན་དང་ནི། ། <br> དུག་དང་མེ་དང་གཡང་ས་དང་། ། <br> དགྲ་རྣམས་ཀྱིས་ཀྱང་དཔེར་མི་ཕོད། ། <br> <br>",
                        "དེ་ལྟར་འདོད་ལ་སྐྱོ་བྱས་ཏེ། ། <br> དབེན་པ་ལ་ནི་དགའ་བ་བསྐྱེད། ། <br> རྩོད་དང་ཉོན་མོངས་ཀྱིས་སྟོང་པ། ། <br> ཞི་བའི་ནགས་ཀྱི་ནང་དག་ཏུ། ། <br> <br>",
                        "སྐལ་ལྡན་ཟླ་འོད་ཙནྡན་གྱིས་བསིལ་བའི། ། <br> ཡངས་པའི་རྡོ་ལེབ་ཁང་བཟངས་ཉམས་དགའ་བར། ། <br> སྒྲ་མེད་ཞི་བའི་ནགས་རླུང་གཡོ་བ་ཡིས། ། <br> གཞན་ལ་ཕན་དོན་སེམས་ཤིང་འཆག་པར་བྱེད། ། <br> <br>",
                        "ཁང་སྟོང་ཤིང་དྲུང་ཕུག་དག་ཏུ། ། <br> གང་དུ་ཇི་སྲིད་འདོད་གནས་ཤིང་། ། <br> ཡོངས་འཛིན་བསྲུང་བའི་སྡུག་བསྔལ་སྤངས། ། <br> ལྟོས་པ་མེད་པར་བག་ཡངས་སྤྱོད། ། <br> <br>",
                        "རང་དབང་སྤྱོད་ཅིང་ཆགས་མེད་ལ། ། <br> གང་དང་ཡང་ནི་འབྲེལ་མེད་པ། ། <br> ཆོག་ཤེས་བདེ་སྤྱོད་གང་ཡིན་པ། ། <br> དབང་པོས་ཀྱང་ནི་དེ་རྙེད་དཀའ། ། <br> <br>",
                        "དེ་ལ་སོགས་པའི་རྣམ་པ་ཡིས། ། <br> དབེན་པའི་ཡོན་ཏན་བསམ་བྱས་ནས། ། <br> རྣམ་རྟོག་ཉེ་བར་ཞི་བ་དང་། ། <br> བྱང་ཆུབ་སེམས་ནི་བསྒོམ་པར་བྱ། ། <br> <br>",
                        "བདག་དང་གཞན་དུ་མཉམ་པ་ནི། ། <br> དང་པོ་ཉིད་དུ་འབད་དེ་བསྒོམ། ། <br> བདེ་དང་སྡུག་བསྔལ་མཉམ་པས་ན། ། <br> ཐམས་ཅད་བདག་བཞིན་བསྲུང་བར་བྱ། ། <br> <br>",
                        "ལག་པ་ལ་སོགས་དབྱེ་བ་རྣམ་མང་ཡང་། ། <br> ཡོངས་སུ་བསྲུང་བྱའི་ལུས་སུ་གཅིག་པ་ལྟར། ། <br> དེ་བཞིན་འགྲོ་བ་ཐ་དད་བདེ་སྡུག་དག ། <br> ཐམས་ཅད་བདག་བཞིན་བདེ་བ་འདོད་མཉམ་གཅིག ། <br> <br>",
                        "གལ་ཏེ་བདག་གི་སྡུག་བསྔལ་གྱིས། ། <br> གཞན་གྱི་ལུས་ལ་མི་གནོད་པ། ། <br> དེ་ལྟའང་དེ་བདག་སྡུག་བསྔལ་དེ། ། <br> བདག་ཏུ་ཞེན་པས་མི་བཟོད་ཉིད། ། <br> <br>",
                        "དེ་བཞིན་གཞན་གྱི་སྡུག་བསྔལ་དག ། <br> བདག་ལ་འབབ་པར་མི་འགྱུར་ཡང་། ། <br> དེ་ལྟའང་དེ་བདག་སྡུག་བསྔལ་དེ། ། <br> བདག་ཏུ་ཞེན་པས་བཟོད་པར་དཀའ། ། <br> <br>",
                        "བདག་གིས་གཞན་གྱི་སྡུག་བསྔལ་བསལ། ། <br> སྡུག་བསྔལ་ཡིན་ཕྱིར་བདག་སྡུག་བཞིན། ། <br> བདག་གིས་གཞན་ལ་ཕན་པར་བྱ། ། <br> སེམས་ཅན་ཡིན་ཕྱིར་བདག་ལུས་བཞིན། ། <br> <br>",
                        "གང་ཚེ་བདག་དང་གཞན་གཉི་ག ། <br> བདེ་བ་འདོད་དུ་མཚུངས་པ་ལ། ། <br> བདག་དང་ཁྱད་པར་ཅི་ཡོད་ན། ། <br> གང་ཕྱིར་བདག་གཅིག་བདེ་བར་བརྩོན། ། <br> <br>",
                        "གང་ཚེ་བདག་དང་གཞན་གཉི་ག ། <br> སྡུག་བསྔལ་མི་འདོད་མཚུངས་པ་ལ། ། <br> བདག་དང་ཁྱད་པར་ཅི་ཡོད་ན། ། <br> གང་ཕྱིར་གཞན་མིན་བདག་སྲུང་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་དེ་ལ་སྡུག་བསྔལ་བས། ། <br> བདག་ལ་མི་གནོད་ཕྱིར་མི་བསྲུང་། ། <br> མ་འོངས་པ་ཡི་སྡུག་བསྔལ་ཡང་། ། <br> གནོད་མི་བྱེད་ན་དེ་ཅི་བསྲུང་། ། <br> <br>",
                        "བདག་གིས་དེ་ནི་མྱོང་སྙམ་པའི། ། <br> རྣམ་པར་རྟོག་དེ་ལོག་པ་སྟེ། ། <br> འདི་ལྟར་ཤི་བའང་གཞན་ཉིད་ལ། ། <br> སྐྱེ་བ་ཡང་ནི་གཞན་ཉིད་ཡིན། ། <br> <br>",
                        "གང་ཚེ་གང་གི་སྡུག་བསྔལ་གང་། ། <br> དེ་ནི་དེ་ཉིད་ཀྱིས་བསྲུངས་ན། ། <br> རྐང་པའི་སྡུག་བསྔལ་ལག་པས་མིན། ། <br> ཅི་ཕྱིར་དེས་ནི་དེ་བསྲུང་བྱ། ། <br> <br>",
                        "གལ་ཏེ་རིགས་པ་མིན་ཡང་འདིར། ། <br> བདག་ཏུ་འཛིན་པས་འཇུག་ཅེ་ན། ། <br> བདག་གཞན་མི་རིགས་གང་ཡིན་ཏེ། ། <br> ཅི་ནུས་པར་ནི་སྤང་བྱ་ཉིད། ། <br> <br>",
                        "རྒྱུད་དང་ཚོགས་ཞེས་བྱ་བ་ནི། ། <br> ཕྲེང་བ་དམག་ལ་སོགས་བཞིན་བརྫུན། ། <br> སྡུག་བསྔལ་ཅན་གང་དེ་མེད་པ། ། <br> དེས་འདི་སུ་ཞིག་སྤང་བར་འགྱུར། ། <br> <br>",
                        "སྡུག་བསྔལ་བདག་པོ་མེད་པར་ནི། ། <br> ཐམས་ཅད་བྱེ་བྲག་མེད་པ་ཉིད། ། <br> སྡུག་བསྔལ་ཡིན་ཕྱིར་དེ་བསལ་བྱ། ། <br> ངེས་པས་དེར་ནི་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "ཅི་ཕྱིར་ཀུན་གྱི་སྡུག་བསྔལ་ནི། ། <br> བཟློག་པར་བྱ་ཞེས་བརྩད་དུ་མེད། ། <br> གལ་ཏེ་བཟློག་ནའང་ཐམས་ཅད་བཟློག ། <br> དེ་མིན་བདག་ཀྱང་སེམས་ཅན་བཞིན། ། <br> <br>",
                        "སྙིང་རྗེ་སྡུག་བསྔལ་མང་གྱུར་པ། ། <br> ཅི་ཕྱིར་ནན་གྱིས་སྐྱེད་ཅེ་ན། ། <br> འགྲོ་བའི་སྡུག་བསྔལ་བསམ་བྱས་ན། ། <br> ཇི་ལྟར་སྙིང་རྗེ་སྡུག་བསྔལ་མང་། ། <br> <br>",
                        "གལ་ཏེ་སྡུག་བསྔལ་གཅིག་གིས་ནི། ། <br> སྡུག་བསྔལ་མང་པོ་མེད་འགྱུར་ན། ། <br> བརྩེ་དང་ལྡན་པས་སྡུག་བསྔལ་དེ། ། <br> རང་དང་གཞན་ལ་བསྐྱེད་བྱ་ཉིད། ། <br> <br>",
                        "དེས་ན་མེ་ཏོག་ཟླ་མཛེས་ཀྱིས། ། <br> རྒྱལ་པོའི་གནོད་པ་ཤེས་ཀྱང་ནི། ། <br> བདག་གི་སྡུག་བསྔལ་མ་བསལ་ཏེ། ། <br> མང་པོའི་སྡུག་བསྔལ་ཟད་འགྱུར་ཕྱིར། ། <br> <br>",
                        "དེ་ལྟར་རྒྱུད་ནི་གོམས་གྱུར་པ། ། <br> གཞན་གྱི་སྡུག་བསྔལ་ཞི་དགའ་བས། ། <br> པདྨའི་མཚོ་རུ་ངང་པ་ལྟར། ། <br> མནར་མེད་པ་ཡང་འཇུག་པར་འགྱུར། ། <br> <br>",
                        "སེམས་ཅན་རྣམ་པར་གྲོལ་བ་ན། ། <br> དགའ་བའི་རྒྱ་མཚོ་གང་ཡིན་པ། ། <br> དེ་ཉིད་ཀྱིས་ནི་ཆོག་མིན་ནམ། ། <br> ཐར་པ་འདོད་པས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "དེ་ལྟས་གཞན་གྱི་དོན་བྱས་ཀྱང་། ། <br> རློམ་སེམས་དང་ནི་ངོ་མཚར་མེད། ། <br> གཅིག་ཏུ་གཞན་དོན་ལ་དགའ་བས། ། <br> རྣམ་སྨིན་འབྲས་བུའི་རེ་བ་མེད། ། <br> <br>",
                        "དེ་བས་ཇི་ལྟར་ཆུང་ངུ་ན། ། <br> མི་སྙན་ལས་ཀྱང་བདག་བསྲུང་བ། ། <br> དེ་བཞིན་གཞན་ལ་བསྲུང་སེམས་དང་། ། <br> སྙིང་རྗེའི་སེམས་ནི་དེ་ལྟར་བྱ། ། <br> <br>",
                        "གོམས་པ་ཡིས་ནི་གཞན་དག་གི། ། <br> ཁུ་བ་ཁྲག་གི་ཐིགས་པ་ལ། ། <br> དངོས་པོ་མེད་པར་གྱུར་ཀྱང་ནི། ། <br> བདག་གོ་ཞེས་ནི་ཤེས་པ་ལྟར། ། <br> <br>",
                        "དེ་བཞིན་གཞན་གྱི་ལུས་ལ་ཡང་། ། <br> བདག་ཅེས་ཅི་ཡི་ཕྱིར་མི་གཟུང་། ། <br> བདག་གི་ལུས་ནི་གཞན་དག་ཏུའང་། ། <br> བཞག་པ་དེ་ལྟར་དཀའ་བ་མེད། ། <br> <br>",
                        "བདག་ཉིད་སྐྱོན་བཅས་གཞན་ལ་ཡང་། ། <br> ཡོན་ཏན་རྒྱ་མཚོར་ཤེས་བྱས་ནས། ། <br> བདག་འཛིན་ཡོངས་སུ་དོར་བ་དང་། ། <br> གཞན་བླང་བ་ནི་བསྒོམ་པར་བྱ། ། <br> <br>",
                        "ཇི་ལྟར་ལག་པ་ལ་སོགས་པ། ། <br> ལུས་ཀྱི་ཡན་ལག་ཡིན་འདོད་ལྟར། ། <br> དེ་བཞིན་འགྲོ་བའི་ཡན་ལག་ཏུ། ། <br> ཅི་ཕྱིར་ལུས་ཅན་རྣམས་མི་འདོད། ། <br> <br>",
                        "ཇི་ལྟར་བདག་མེད་ལུས་འདི་ལ། ། <br> གོམས་པས་བདག་གི་བློ་བྱུང་བ། ། <br> དེ་བཞིན་སེམས་ཅན་གཞན་ལ་ཡང་། ། <br> གོམས་པས་བདག་བློ་ཅིས་མི་སྐྱེ། ། <br> <br>",
                        "དེ་ལྟ་ན་ནི་གཞན་གྱི་དོན། ། <br> བྱས་ཀྱང་ངོ་མཚར་རློམ་མི་འབྱུང་། ། <br> བདག་ཉིད་ཀྱིས་ནི་ཟས་ཟོས་ནས། ། <br> ལན་ལ་རེ་བ་མི་འབྱུང་བཞིན། ། <br> <br>",
                        "དེ་བས་ཇི་ལྟར་ཆུང་ངུ་ན། ། <br> མི་སྙན་ལས་ཀྱང་བདག་བསྲུང་བ། ། <br> དེ་བཞིན་འགྲེ་ལ་བསྲུང་སེམས་དང་། ། <br> སྙིང་རྗེའི་སེམས་ནི་གོམས་པར་བྱ། ། <br> <br>",
                        "དེ་བས་མགོན་པོ་སྤྱན་རས་གཟིགས། ། <br> ཐུགས་རྗེ་ཆེན་པོས་འགྲོ་བ་ཡི། ། <br> འཁོར་གྱི་འཇིགས་པ་བསལ་བའི་ཕྱིར། ། <br> རང་གི་མཚན་ཡང་བྱིན་གྱིས་བརླབས། ། <br> <br>",
                        "དཀའ་ལས་ཕྱིར་ལྡོག་མི་བྱ་སྟེ། ། <br> འདི་ལྟར་གོམས་པའི་མཐུ་ཡིས་ནི། ། <br> གང་གི་མིང་ཐོས་འཇིགས་པ་ཡང་། ། <br> དེ་ཉིད་མེད་ན་མི་དགར་འགྱུར། ། <br> <br>",
                        "གང་ཞིག་བདག་དང་གཞན་རྣམས་ནི། ། <br> མྱུར་དུ་བསྐྱབ་པར་འདོད་པ་དེས། ། <br> བདག་དང་གཞན་དུ་བརྗེ་བྱ་བ། ། <br> གསང་བའི་དམ་པ་སྤྱད་པར་བྱ། ། <br> <br>",
                        "བདག་ལུས་གང་ལ་ཆགས་པ་ཡིས། ། <br> འཇིགས་གནས་ཆུང་ལ་འཇིགས་སྐྱེ་བ། ། <br> འཇིགས་པ་སྐྱེ་བའི་ལུས་དེ་ལ། ། <br> སུ་ཞིག་དགྲ་བཞིན་སྡང་མི་བྱེད། ། <br> <br>",
                        "ལུས་གང་བཀྲེས་དང་སྐོམ་སོགས་ནད། ། <br> གསོ་བའི་ཆོ་ག་བྱེད་འདོད་པས། ། <br> བྱ་དང་ཉ་དང་རི་དགས་དག ། <br> གསོད་པར་བྱེད་ཅིང་ལམ་སྒུགས་བྱེད། ། <br> <br>",
                        "གང་ཞིག་ཁེ་དང་རིམ་གྲོའི་ཕྱིར། ། <br> ཕ་དང་མ་ཡང་གསོད་བྱེད་ཅིང་། ། <br> དཀོན་མཆོག་གསུམ་གྱི་དཀོར་བརྐུས་ནས། ། <br> དེས་ནི་མནར་མེད་བསྲེག་འགྱུར་ན། ། <br> <br>",
                        "མཁས་པ་སུ་ཞིག་ལུས་དེ་ལ། ། <br> འདོད་ཅིང་བསྲུང་དང་མཆོད་བྱེད་ཀྱི། ། <br> འདི་ལ་སུ་ཞིག་དགྲ་བཞིན་དུ། ། <br> བལྟ་བར་མི་བྱེད་བརྙས་མི་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་བྱིན་ན་ཅི་སྤྱད་ཅེས། ། <br> བདག་དོན་སེམས་པ་འདྲེ་ཡི་ཚུལ། ། <br> གལ་ཏེ་སྤྱད་ན་ཅི་སྦྱིན་ཅེས། ། <br> གཞན་དོན་སེམས་པ་ལྷ་ཡི་ཆོས། ། <br> <br>",
                        "བདག་ཕྱིར་གཞན་ལ་གནོད་བྱས་ན། ། <br> དམྱལ་ལ་སོགས་པར་གདུངས་པར་འགྱུར། ། <br> གཞན་ཕྱིར་བདག་ལ་གནོད་བྱས་ན། ། <br> ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་འཐོབ། ། <br> <br>",
                        "བདག་ཉིད་མཐོ་བར་འདོད་པ་དེས། ། <br> ངན་འགྲོ་ངན་དང་གླེན་པར་འགྱུར། ། <br> དེ་ཉིད་གཞན་ལ་སྤོ་བྱས་ན། ། <br> བདེ་འགྲོ་རིམ་གྲོ་འཐོབ་པར་འགྱུར། ། <br> <br>",
                        "བདག་གི་དོན་དུ་གཞན་བཀོལ་ན། ། <br> བྲན་ལ་སོགས་པ་མྱོང་བར་འགྱུར། ། <br> གཞན་གྱི་དོན་དུ་བདག་སྤྱད་ན། ། <br> རྗེ་དཔོན་ཉིད་སོགས་མྱོང་བར་འགྱུར། ། <br> <br>",
                        "འཇིག་རྟེན་བདེ་བ་ཇི་སྙེད་པ། ། <br> དེ་ཀུན་གཞན་བདེ་འདོད་ལས་བྱུང་། ། <br> འཇིག་རྟེན་སྡུག་བསྔལ་ཇི་སྙེད་པ། ། <br> དེ་ཀུན་རང་བདེ་འདོད་ལས་བྱུང་། ། <br> <br>",
                        "མང་དུ་བཤད་ལྟ་ཅི་ཞིག་དགོས། ། <br> བྱིས་པ་རང་གི་དོན་བྱེད་དང་། ། <br> ཐུབ་པ་གཞན་གྱི་དོན་མཛད་པ། ། <br> འདི་གཉིས་ཀྱི་ནི་ཁྱད་པར་ལྟོས། ། <br> <br>",
                        "བདག་བདེ་གཞན་གྱི་སྡུག་བསྔལ་དག ། <br> ཡང་དག་བརྗེ་བ་མ་བྱས་ན། ། <br> སངས་རྒྱས་ཉིད་དུ་མི་འགྲུབ་ཅིང་། ། <br> འཁོར་བ་ན་ཡང་བདེ་བ་མེད། ། <br> <br>",
                        "འཇིག་རྟེན་ཕ་རོལ་ཕར་ཞོག་གི །བྲན་གཡོག་ལས་མི་བྱེད་པ་དང་། ། <br> རྗེ་དཔོན་རྔན་པ་མི་སྟེར་བའི། ། <br> ཚེ་འདིའི་དོན་ཡང་འགྲུབ་མི་འགྱུར། ། <br> <br>",
                        "མཐོང་དང་མ་མཐོང་བདེ་འགྲུབ་པའི། ། <br> ཕུན་སུམ་བདེ་སྐྱིད་ཡོངས་བོར་ཞིང་། ། <br> གཞན་ལ་སྡུག་བསྔལ་བྱས་པའི་རྒྱུས། ། <br> རྨོངས་པས་སྡུག་བསྔལ་མི་བཟད་ལེན། ། <br> <br>",
                        "འཇིག་རྟེན་དག་ན་འཚེ་བ་གང་ཡོད་དང་། ། <br> འཇིགས་དང་སྡུག་བསྔལ་ཇི་སྙེད་ཡོད་གྱུར་པ། ། <br> དེ་ཀུན་བདག་ཏུ་འཛིན་པ་ལས་བྱུང་ན། ། <br> འདྲེ་ཆེན་དེས་ཀོ་བདག་ལ་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "བདག་ཉིད་ཡོངས་སུ་མ་བཏང་ན། ། <br> སྡུག་བསྔལ་སྤང་བར་མི་ནུས་ཏེ། ། <br> ཇི་ལྟར་མེ་ནི་མ་བཏང་ན། ། <br> སྲེག་པ་སྤོང་བར་མི་ནུས་བཞིན། ། <br> <br>",
                        "དེ་ལྟར་བདག་གནོད་ཞི་བ་དང་། ། <br> གཞན་གྱི་སྡུག་བསྔལ་ཞི་བྱའི་ཕྱིར། ། <br> བདག་ཉིད་གཞན་ལ་གཏང་བྱ་དང་། ། <br> གཞན་རྣམས་བདག་བཞིན་གཟུང་བར་བྱ། ། <br> <br>",
                        "བདག་ནི་གཞན་གྱི་དབང་གྱུར་ཅེས། ། <br> ཡིད་ཁྱོད་ངེས་པར་ཤེས་གྱིས་ལ། ། <br> སེམས་ཅན་ཀུན་དོན་མ་གཏོགས་པར། ། <br> ད་ནི་ཁྱོད་ཀྱིས་གཞན་མི་བསམ། ། <br> <br>",
                        "གཞན་དབང་མིག་ལ་སོགས་པ་ཡིས། ། <br> རང་དོན་སྒྲུབ་པར་རིགས་མ་ཡིན། ། <br> དེ་དོན་མིག་ལ་སོགས་པ་ཡིས། ། <br> དེ་ལ་ལོག་པར་བྱ་མི་རིགས། ། <br> <br>",
                        "དེས་ན་སེམས་ཅན་གཙོར་བྱ་སྟེ། ། <br> བདག་གི་ལུས་ལ་ཅི་མཐོང་བ། ། <br> དེ་དང་དེ་ནི་ཕྲོགས་ནས་ཀྱང་། ། <br> གཞན་དག་ལ་ནི་ཕན་པར་སྤྱོད། ། <br> <br>",
                        "དམན་སོགས་བདག་ཏུ་བྱས་པ་དང་། ། <br> གཞན་ཉིད་དུ་ནི་བདག་བྱས་ནས། ། <br> རྣམ་རྟོག་མེད་པའི་སེམས་ཀྱིས་སུ། ། <br> ཕྲག་དོག་འགྲན་དང་ང་རྒྱལ་བསྒོམ། ། <br> <br>",
                        "འདི་ནི་བཀུར་བྱས་བདག་ནི་མིན། ། <br> འདི་བཞིན་བདག་གིས་མ་རྙེད་ཅིང་། ། <br> འདི་ནི་བསྟོད་བྱས་བདག་ལ་སྨོད། ། <br> འདི་བདེ་བདག་ནི་སྡུག་བསྔལ་ལ། ། <br> <br>",
                        "བདག་ནི་ལས་རྣམས་བྱེད་པ་དང་། ། <br> འདི་ནི་བདེ་བ་ཉིད་དུ་གནས། ། <br> འདི་ནི་འཇིག་རྟེན་ལ་ཆེ་དང་། ། <br> བདག་དམན་ཡོན་ཏན་མེད་པར་གྲག ། <br> <br>",
                        "ཡོན་ཏན་མེད་པས་ཅི་ཞིག་བྱ། ། <br> བདག་ཀུན་ཡོན་ཏན་ལྡན་པ་ཉིད། ། <br> གང་བས་འདི་དམན་དེ་ཡོད་ཅིང་། ། <br> གང་བས་བདག་མཆོག་དེ་ཡང་ཡོད། ། <br> <br>",
                        "ཚུལ་ཁྲིམས་ལྟ་བ་གུད་སོགས་ནི། ། <br> ཉོན་མོངས་སྟོབས་ཀྱིས་བདག་དབང་མིན། ། <br> ཅི་ནུས་བདག་ནི་གསོ་དགོས་ཏེ། ། <br> གནོད་པའང་བདག་གིས་དང་དུ་བླང་། ། <br> <br>",
                        "འོན་ཏེ་བདག་འདིའི་གསོ་བྱ་མིན། ། <br> ཅི་ཕྱིར་བདག་ལ་བརྙས་པ་བྱེད། ། <br> བདག་ལ་དེ་ཡི་ཡོན་ཏན་གྱིས། ། <br> ཅི་བྱ་འདི་བདག་ཡོན་ཏན་ཅན། ། <br> <br>",
                        "ངན་འགྲོ་གདུག་པའི་ཁར་གནས་པ། ། <br> འགྲོ་ལ་སྙིང་རྗེ་མེད་པར་འདི། ། <br> ཕྱིར་ལ་ཡོན་ཏན་རློམ་པ་ཡིས། ། <br> མཁས་པ་དག་ལ་བདོ་བར་འདོད། ། <br> <br>",
                        "བདག་དང་མཉམ་ལ་བལྟས་ནས་ནི། ། <br> གང་གིས་རང་ཉིད་ལྷག་བྱའི་ཕྱིར། ། <br> བདག་གི་རྙེད་དང་བཀུར་སྟི་ནི། ། <br> རྩོད་པ་ཡིས་ཀྱང་ངེས་པར་བསྒྲུབ། ། <br> <br>",
                        "ཅི་ནས་བདག་གི་ཡོན་ཏན་ནི། ། <br> འཇིག་རྟེན་ཀུན་ལ་བསལ་བ་དང་། ། <br> གཞན་ཡང་འདི་ཡི་ཡོན་ཏན་གང་། ། <br> སུས་ཀྱང་ཐོས་པར་མི་འགྱུར་བྱ། ། <br> <br>",
                        "བདག་གི་སྐྱོན་ཡང་སྦ་བྱ་ཞིང་། ། <br> བདག་ནི་མཆོད་འགྱུར་འདི་ལ་མིན། ། <br> བདག་དེང་རྙེད་པ་ལེགས་རྙེད་ཅིང་། ། <br> བདག་ནི་བཀུར་འགྱུར་འདི་ལ་མིན། ། <br> <br>",
                        "འདི་ནི་མ་རུངས་བྱས་པ་ལ། ། <br> ཡུན་རིང་བདག་ནི་དགའ་བས་ལྟ། ། <br> འགྲོ་བ་ཀུན་གྱི་བཞད་གད་དང་། ། <br> ཕན་ཚུན་སྨོད་པ་དག་ཏུ་བྱ། ། <br> <br>",
                        "ཉོན་མོངས་འདི་ཡང་བདག་དང་ནི། ། <br> ལྷན་ཅིག་ཏུ་ནི་འགྲན་ཅེས་གྲག ། <br> འདི་དག་ཐོས་དང་ཤེས་རབ་བམ། ། <br> གཟུགས་རིགས་ནོར་གྱིས་མཉམ་མམ་ཅི། ། <br> <br>",
                        "དེ་ལྟར་ཀུན་ལ་བསྒྲགས་པ་ཡི། ། <br> བདག་གི་ཡོན་ཏན་ཐོས་ནས་ནི། ། <br> སྤུ་ལྡང་དགའ་བ་སྐྱེ་གྱུར་པའི། ། <br> བདེ་སྐྱིད་ལ་ནི་ཡོངས་སུ་སྤྱོད། ། <br> <br>",
                        "ཅི་སྟེ་འདི་ལ་རྙེད་ཡོད་ཀྱང་། ། <br> གལ་ཏེ་ང་ཡི་ལས་བྱེད་ན། ། <br> འདི་ལ་འཚོ་བ་ཙམ་བྱིན་ནས། ། <br> བདག་གི་སྟོབས་ཀྱིས་དེ་བླང་བྱ། ། <br> <br>",
                        "འདི་ནི་བདེ་ལས་ཉམས་བྱ་ཞིང་། ། <br> བདག་གི་གནོད་དང་རྟག་སྦྱར་བྱ། ། <br> འདི་ཡིས་བརྒྱ་ཕྲག་ཐམས་ཅད་དུ། ། <br> འཁོར་བར་བདག་ལ་གནོད་པ་བྱས། ། <br> <br>",
                        "ཡིད་ཁྱོད་རང་དོན་བྱེད་འདོད་པས། ། <br> བསྐལ་པ་གྲངས་མེད་འདས་གྱུར་ཀྱང་། ། <br> ངལ་བ་ཆེན་པོ་དེ་ལྟ་བུར། ། <br> ཁྱོད་ཀྱིས་སྡུག་བསྔལ་འབའ་ཞིག་བསྒྲུབས། ། <br> <br>",
                        "དེ་ལྟར་ངེས་པར་གཞན་དག་གི །དོན་ལ་རབ་ཏུ་འཇུག་གྱིས་དང་། ། <br> ཐུབ་པའི་བཀའ་ནི་མི་སླུ་བས། ། <br> དེ་ཡི་ཡོན་ཏན་ཕྱིས་མཐོང་འགྱུར། ། <br> <br>",
                        "གལ་ཏེ་ཁྱོད་ཀྱིས་སྔ་དུས་སུ། ། <br> ལས་འདི་བྱས་པར་གྱུར་ན་ནི། ། <br> སངས་རྒྱས་ཕུན་སུམ་བདེ་མིན་པ། ། <br> གནས་སྐབས་འདི་འདྲར་འགྱུར་མི་སྲིད། ། <br> <br>",
                        "དེ་བས་འདི་ལྟར་གཞན་དག་གི །ཁུ་བ་ཁྲག་གི་ཐིགས་པ་ལ། ། <br> ཁྱོད་ཀྱིས་ངར་འཛིན་བྱས་པ་ལྟར། ། <br> དེ་བཞིན་གཞན་ལའང་གོམས་པར་གྱིས། ། <br> <br>",
                        "གཞན་གྱི་རྟོག་ཆེན་བྱས་ནས་ནི། ། <br> བདག་གི་ལུས་ལ་ཅི་སྣང་བ། ། <br> དེ་དང་དེ་ཉིད་ཕྲོགས་བྱས་ནས། ། <br> ཁྱོད་ཀྱིས་གཞན་ལ་ཕན་པ་སྤྱོད། ། <br> <br>",
                        "བདག་སྐྱིད་གཞན་ནི་མི་སྐྱིད་ལ། ། <br> བདག་མཐོ་གཞན་ནི་དམའ་བ་དང་། ། <br> བདག་ནི་ཕན་བྱེད་གཞན་མིན་ཞེས། ། <br> བདག་ལ་ཕྲག་དོག་ཅིས་མི་བྱེད། ། <br> <br>",
                        "བདག་ནི་བདེ་དང་བྲལ་གྱིས་ཏེ། ། <br> གཞན་གྱི་སྡུག་བསྔལ་བདག་ལ་སྦྱོར། ། <br> གང་ཚེ་འདི་ནི་ཅི་བྱེད་ཅེས། ། <br> བདག་གི་སྐྱོན་ལ་བརྟག་པར་གྱིས། ། <br> <br>",
                        "གཞན་གྱིས་ཉེས་པ་བྱས་པ་ཡང་། ། <br> རང་གི་སྐྱོན་དུ་བསྒྱུར་བྱོས་ལ། ། <br> བདག་གི་ཉེས་པ་ཆུང་བྱས་ཀྱང་། ། <br> སྐྱེ་བོ་མང་ལ་རབ་ཏུ་ཤོགས། ། <br> <br>",
                        "གཞན་གྱི་གྲགས་པ་ལྷག་བརྗོད་པས། ། <br> རང་གི་གྲགས་པ་ཟིལ་གྱིས་ནོན། ། <br> བདག་ནི་བྲན་གྱི་ཐ་མ་ལྟར། ། <br> དོན་རྣམས་ཀུན་ལ་བཀོལ་བར་གྱིས། ། <br> <br>",
                        "འདི་ནི་སྐྱོན་ཅན་རང་བཞིན་ཏེ། ། <br> གློ་བུར་ཡོན་ཏན་ཆས་མི་བསྟོད། ། <br> འདི་ཡི་ཡོན་ཏན་ཅི་ནས་ཀྱང་། ། <br> འགས་ཀྱང་མི་ཤེས་དེ་ལྟར་གྱིས། ། <br> <br>",
                        "མདོར་ན་བདག་གི་དོན་གྱི་ཕྱིར། ། <br> ཁྱོད་ཀྱིས་གཞན་ལ་གནོད་བྱས་གང་། ། <br> གནོད་དེ་སེམས་ཅན་དོན་གྱི་ཕྱིར། ། <br> བདག་ཉིད་ལ་ནི་འབབ་པར་གྱིས། ། <br> <br>",
                        "འདི་ནི་གཉའ་དྲག་འགྱུར་ཚུལ་དུ། ། <br> ཤེད་བསྐྱེད་པར་ནི་མི་བྱ་སྟེ། ། <br> བག་མ་གསར་པའི་ཚུལ་བཞིན་དུ། ། <br> ངོ་ཚ་འཇིགས་དང་བསྡམས་ཏེ་བཞག ། <br> <br>",
                        "དེ་བྱ་དེ་ལྟར་གནས་བྱ་ཞིང་། ། <br> དེ་ལྟར་ཁྱོད་ཀྱིས་མི་བྱ་བ། ། <br> དེ་ལྟར་འདི་ནི་དབང་བྱ་སྟེ། ། <br> དེ་ལས་འདས་ན་ཚར་གཅད་བྱ། ། <br> <br>",
                        "འོན་ཏེ་དེ་ལྟར་གདམས་ཀྱང་ནི། ། <br> སེམས་ཁྱོད་དེ་ལྟར་མི་བྱེད་ན། ། <br> ཁྱོད་ལ་ཉེས་པ་ཀུན་བསྟེན་པས། ། <br> ཁྱོད་ཉིད་ཚར་གཅད་བྱ་བར་ཟད། ། <br> <br>",
                        "ཁྱོད་ཀྱིས་ཁོ་བོ་གར་བརླག་པའི། ། <br> སྔོན་གྱི་དུས་དེ་གཞན་ཡིན་ཏེ། ། <br> ངས་མཐོང་ང་ཁྱོད་གང་དུ་འགྲོ། ། <br> ཁྱོད་ཀྱི་དྲེགས་པ་ཀུན་གཞོམ་བྱ། ། <br> <br>",
                        "ད་དུང་བདག་ལ་རང་གི་དོན། ། <br> ཡོད་སྙམ་སེམས་པ་དེ་དོར་ཅིག ། <br> བདག་གིས་གཞན་ལ་ཁྱོད་བཙོང་གིས། ། <br> སྐྱོ་བར་མ་སེམས་ཞོ་ཤ་ཕུལ། ། <br> <br>",
                        "གལ་ཏེ་བག་མེད་གྱུར་ནས་ཁྱོད། ། <br> སེམས་ཅན་རྣམས་ལ་མ་བྱིན་ན། ། <br> ཁྱོད་ཀྱིས་ཁོ་བོ་དམྱལ་བ་ཡི། ། <br> སྲུང་མ་རྣམས་ལ་བྱིན་དུ་ངེས། ། <br> <br>",
                        "དེ་ལྟར་ཁྱོད་ཀྱིས་རེ་ལྟ་ཞིག ། <br> ཁོ་བོ་བྱིན་པས་ཡུན་རིངས་སྡུག ། <br> ང་ནི་ཁོན་རྣམས་དྲན་བྱས་ཏེ། ། <br> ཁྱོད་ཀྱིས་རང་དོན་སེམས་པ་གཞོམ། ། <br> <br>",
                        "དེ་སྟེ་བདག་ནི་དགའ་འདོད་ན། ། <br> རང་ལ་བདག་གིས་དགར་མི་བྱ། ། <br> དེ་སྟེ་བདག་ནི་བསྲུང་འདོད་ན། ། <br> གཞན་དག་རྟག་ཏུ་བསྲུང་བར་བྱ། ། <br> <br>",
                        "ཇི་ལྟ་ཇི་ལྟར་ལུས་འདི་ནི། ། <br> ཡོངས་སུ་སྐྱོང་བར་བྱེད་གྱུར་པ། ། <br> དེ་ལྟ་དེ་ལྟར་ཤིན་ཏུ་ནི། ། <br> བཟེ་རེ་ཅན་གྱུར་ཉིད་དུ་ལྟུང་། ། <br> <br>",
                        "དེ་ལྟར་ལྷུང་བ་དེ་ཡི་ཡང་། ། <br> འདོད་པ་ས་འདི་ཐམས་ཅད་ཀྱིས། ། <br> རྫོགས་པར་ནུས་པ་ཡོད་མིན་ན། ། <br> དེ་ཡི་འདོད་པ་སུས་བྱེད་ནུས། ། <br> <br>",
                        "ནུས་མེད་འདོད་པ་ཉོན་མོངས་དང་། ། <br> བསམ་པ་ཉམས་པའང་སྐྱེ་བར་འགྱུར། ། <br> གང་ཞིག་ཀུན་ལ་ལྟོས་མེད་པ། ། <br> དེ་ཡི་ཕུན་ཚོགས་ཟད་མི་ཤེས། ། <br> <br>",
                        "དེ་བས་ལུས་ཀྱི་འདོད་པ་ནི། ། <br> འཕེལ་ཕྱིར་སྐབས་དབྱེ་མི་བྱ་སྟེ། ། <br> གང་ཞིག་ཡིད་འོང་མི་འཛིན་པ། ། <br> དེ་ནི་དངོས་པོ་བཟང་པོ་ཡིན། ། <br> <br>",
                        "ཐ་མར་ཐལ་བའི་མཐར་གཏུགས་ཤིང་། ། <br> མི་གཡོ་གཞན་གྱིས་བསྐྱོད་བྱ་བ། ། <br> མི་གཙང་གཟུགས་ནི་མི་བཟད་པ། ། <br> འདི་ལ་ཅི་ཕྱིར་བདག་ཏུ་འཛིན། ། <br> <br>",
                        "གསོན་ནམ་ཡང་ན་ཤི་ཡང་བླའི། ། <br> བདག་ལ་འཁྲུལ་འཁོར་འདིས་ཅི་བྱ། ། <br> བོང་སོགས་འདི་ཁྱད་ཅི་ཡོད་ན། ། <br> ཀྱི་ཧུད་ང་རྒྱལ་སེལ་མི་བྱེད། ། <br> <br>",
                        "ལུས་ཀྱི་ཁ་ཏ་བྱས་པ་ཡིས། ། <br> དོན་མེད་སྡུག་བསྔལ་ཉེར་བསགས་ནས། ། <br> རྗེས་སུ་ཆགས་དང་ཁོང་ཁྲོ་བ། ། <br> ཤིང་མཚུངས་འདི་ལ་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "བདག་གིས་འདི་ལྟར་བསྐྱངས་པའམ། ། <br> བྱ་རྒོད་སོགས་ཀྱིས་ཟོས་ཀྱང་རུང་། ། <br> ཆགས་མེད་ཞེ་སྡང་ཡོད་མིན་ན། ། <br> ཅི་སྟེ་དེ་ལ་ཆགས་པར་བྱེད། ། <br> <br>",
                        "གང་ཞིག་སྨོད་པས་ཁྲོ་བ་དང་། ། <br> གང་ཞིག་བསྟོད་པས་མགུ་འགྱུར་བ། ། <br> གལ་ཏེ་དེ་ཉིད་ཤེས་མེད་ན། ། <br> བདག་གིས་གང་གི་ངལ་བ་བྱས། ། <br> <br>",
                        "གང་ཞིག་ལུས་འདི་འདོད་འགྱུར་བ། ། <br> དེ་དང་བདག་བཤེས་ཡིན་ཞེ་ན། ། <br> ཐམས་ཅད་རང་གི་ལུས་འདོད་པས། ། <br> དེ་ལ་བདག་གོ་ཅིས་མི་དགའ། ། <br> <br>",
                        "དེ་བས་བདག་གིས་ཆགས་མེད་པར། ། <br> འགྲོ་ལ་ཕན་ཕྱིར་ལུས་གཏང་བྱ། ། <br> དེས་ན་འདི་ལ་ཉེས་མང་ཡང་། ། <br> ལས་ཀྱི་སྤྱད་བཞིན་གཟུང་བར་བྱ། ། <br> <br>",
                        "དེ་བས་བྱིས་པའི་སྤྱོད་པས་ཆོག ། <br> བདག་གིས་མཁས་པའི་རྗེས་བསྙགས་ཏེ། ། <br> བག་ཡོད་གཏམ་ནི་དྲན་བྱས་ནས། ། <br> གཉིད་དང་རྨུགས་པ་བཟློག་པར་བྱ། ། <br> <br>",
                        "རྒྱལ་སྲས་ཐུགས་རྗེ་ཆེ་རྣམས་ལྟར། ། <br> རིགས་པའི་སྲན་ནི་གཟུགས་བྱ་སྟེ། ། <br> ཉིན་མཚན་ཕྱད་པར་མ་འབད་ན། ། <br> བདག་གི་སྡུག་བསྔལ་ནམ་མཐར་ཕྱིན། ། <br> <br>",
                        "དེ་བས་སྒྲིབ་པ་བསལ་བའི་ཕྱིར། ། <br> ལོག་པའི་ལམ་ལས་སེམས་བླན་ཏེ། ། <br> ཡང་དག་དམིགས་ལ་རྟག་པར་ཡང་། ། <br> བདག་གིས་མཉམ་པར་གཞག་པར་བྱ། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། ། <br> བསམ་གཏན་བསྟན་པ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བརྒྱད་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "ཡན་ལག་འདི་དག་ཐམས་ཅད་ནི། ། <br> ཐུབ་པས་ཤེས་རབ་དོན་དུ་གསུངས། ། <br> དེ་ཡི་ཕྱིར་ན་སྡུག་བསྔལ་དག ། <br> ཞི་བར་འདོད་པས་ཤེས་རབ་བསྐྱེད། ། <br> <br>",
                        "ཀུན་རྫོབ་དང་ནི་དོན་དམ་སྟེ། ། <br> འདི་ནི་བདེན་པ་གཉིས་སུ་འདོད། ། <br> དོན་དམ་བློ་ཡི་སྤྱོད་ཡུལ་མིན། ། <br> བློ་ནི་ཀུན་རྫོབ་ཡིན་པར་བརྗོད། ། <br> <br>",
                        "དེ་ལ་འཇིག་རྟེན་རྣམ་གཉིས་མཐོང་། ། <br> རྣལ་འབྱོར་པ་དང་ཕལ་པའོ། ། <br> དེ་ལ་འཇིག་རྟེན་ཕལ་པ་ནི། ། <br> རྣལ་འབྱོར་འཇིག་རྟེན་གྱིས་གནོད་ཅིང་། ། <br> <br>",
                        "རྣལ་འབྱོར་པ་ཡང་བློ་ཁྱད་ཀྱིས། ། <br> གོང་མ་གོང་མ་རྣམས་ཀྱིས་གནོད། ། <br> གཉི་ག་ཡང་ནི་འདོད་པའི་དཔེས། ། <br> འབྲས་བུའི་དོན་དུ་མ་དཔྱད་ཕྱིར། <br>",
                        "འཇིག་རྟེན་པ་ཡིས་དངོས་མཐོང་ཞིང་། ། <br> ཡང་དག་ཉིད་དུའང་རྟོག་བྱེད་ཀྱི། ། <br> སྒྱུ་མ་ལྟ་བུར་མིན་པས་འདིར། ། <br> རྣལ་འབྱོར་པ་དང་འཇིག་རྟེན་རྩོད། ། <br> <br>",
                        "གཟུགས་སོགས་མངོན་སུམ་ཉིད་ཀྱང་ནི། ། <br> གྲགས་པས་ཡིན་གྱི་ཚད་མས་མིན། ། <br> དེ་ནི་མི་གཙང་ལ་སོགས་ལ། ། <br> གཙང་སོགས་གྲགས་པ་བཞིན་དུ་བརྫུན། ། <br> <br>",
                        "འཇིག་རྟེན་གཞུག་པའི་དོན་དུ་ནི། ། <br> མགོན་པོས་དངོས་བསྟན་དེ་ཉིད་དུ། ། <br> དེ་དག་སྐད་ཅིག་མ་ཉིད་མིན། ། <br> ཀུན་རྫོབ་ཏུ་ཡང་འགལ་ཞེ་ན། ། <br> <br>",
                        "རྣལ་འབྱོར་ཀུན་རྫོབ་ཉེས་མེད་དེ། ། <br> འཇིག་རྟེན་ལ་ལྟོས་དེ་ཉིད་མཐོང་། ། <br> གཞན་དུ་བུད་མེད་མི་གཙང་བར། ། <br> ངེས་རྟོག་འཇིག་རྟེན་གྱིས་གནོད་འགྱུར། ། <br> <br>",
                        "སྒྱུ་འདྲའི་རྒྱལ་ལས་བསོད་ནམས་ནི། ། <br> ཇི་ལྟར་དངོས་ཡོད་ལ་ཇི་བཞིན། ། <br> གལ་ཏེ་སེམས་ཅན་སྒྱུ་འདྲ་ན། ། <br> ཤི་ནས་ཇི་ལྟར་སྐྱེ་ཞེ་ན། ། <br> <br>",
                        "ཇི་སྲིད་རྐྱེན་རྣམས་འཚོགས་གྱུར་པ། ། <br> དེ་སྲིད་སྒྱུ་མའང་འབྱུང་བར་འགྱུར། ། <br> རྒྱུན་རིང་ཙམ་གྱིས་ཇི་ལྟར་ན། ། <br> སེམས་ཅན་བདེན་པར་ཡོད་པ་ཡིན། ། <br> <br>",
                        "སྒྱུ་མའི་སྐྱེས་བུ་བསད་སོགས་ལ། ། <br> སེམས་མེད་ཕྱིར་ན་སྡིག་མེད་དེ། ། <br> སྒྱུ་མའི་སེམས་དང་ལྡན་པ་ལ། ། <br> བསོད་ནམས་དང་ནི་སྡིག་པ་འབྱུང་། ། <br> <br>",
                        "སྔགས་སོགས་རྣམས་ལ་ནུས་མེད་ཕྱིར། ། <br> སྒྱུ་མའི་སེམས་ནི་འབྱུང་བ་མེད། ། <br> སྣ་ཚོགས་རྐྱེན་ལས་བྱུང་བ་ཡི། ། <br> སྒྱུ་མ་དེ་ཡང་སྣ་ཚོགས་ཉིད། ། <br> <br>",
                        "རྐྱེན་གཅིག་གིས་ནི་ཀུན་ནུས་པ། ། <br> གང་ན་ཡང་ནི་ཡོད་མ་ཡིན། ། <br> གལ་ཏེ་དོན་དམ་མྱ་ངན་འདས། ། <br> འཁོར་བ་ཀུན་རྫོབ་དེ་ལྟ་ན། ། <br> <br>",
                        "སངས་རྒྱས་ཀྱང་ནི་འཁོར་འགྱུར་བས། ། <br> བྱང་ཆུབ་སྤྱོད་པས་ཅི་ཞིག་བྱ། ། <br> རྐྱེན་རྣམས་རྒྱུན་ནི་མ་ཆད་ན། ། <br> སྒྱུ་མའང་ལྡོག་པར་མི་འགྱུར་གྱི། ། <br> <br>",
                        "རྐྱེན་རྣམས་རྒྱུན་ནི་ཆད་པས་ན། ། <br> ཀུན་རྫོབ་ཏུ་ཡང་མི་འབྱུང་ངོ་། ། <br> གང་ཚེ་འཁྲུལ་པའང་ཡོད་མིན་ན། ། <br> སྒྱུ་མ་གང་གིས་དམིགས་པར་འགྱུར། ། <br> <br>",
                        "གང་ཚེ་ཁྱོད་ལ་སྒྱུ་མ་ཉིད། ། <br> མེད་ནའང་དེ་ཚེ་ཅི་ཞིག་དམིགས། ། <br> གལ་ཏེ་དེ་ཉིད་དུ་གཞན་ཡོད། ། <br> རྣམ་པ་དེ་ནི་སེམས་ཉིད་ཡིན། ། <br> <br>",
                        "གང་ཚེ་སེམས་ཉིད་སྒྱུ་མ་ན། ། <br> དེ་ཚེ་གང་ཞིག་གང་གིས་མཐོང་། ། <br> འཇིག་རྟེན་གྱི་ནི་མགོན་པོས་ཀྱང་། ། <br> སེམས་ཀྱིས་སེམས་མི་མཐོང་ཞེས་གསུངས། ། <br> <br>",
                        "རལ་གྲི་སོ་ནི་རང་ལ་རང་། ། <br> ཇི་ལྟར་མི་གཅོད་དེ་བཞིན་ཡིད། ། <br> ཇི་ལྟར་མར་མེ་རང་གི་དངོས། ། <br> ཡང་དག་གསལ་བར་བྱེད་བཞིན་ན། ། <br> <br>",
                        "མར་མེ་གསལ་བར་བྱ་མིན་ཏེ། ། <br> གང་ཕྱིར་མུན་གྱིས་བསྒྲིབས་པ་མེད། ། <br> ཤེལ་བཞིན་སྔོན་པོ་སྔོ་ཉིད་ལ། ། <br> གཞན་ལ་ལྟོས་པ་ཡོད་མ་ཡིན། ། <br> <br>",
                        "དེ་བཞིན་འགའ་ཞིག་གཞན་ལ་ནི། ། <br> ལྟོས་དང་ལྟོས་མེད་པ་ཡང་མཐོང་། ། <br> སྔོ་ཉིད་མིན་ལ་སྔོན་པོར་དེ། ། <br> བདག་གིས་བདག་ཉིད་བྱས་པ་མེད། ། <br> <br>",
                        "མར་མེ་གསལ་བར་བྱེད་དོ་ཞེས། ། <br> ཤེས་པས་ཤེས་ཏེ་རྗོད་བྱེད་ན། ། <br> བློ་ནི་གསལ་བ་ཉིད་ཡིན་ཞེས། ། <br> གང་གིས་ཤེས་ནས་དེ་སྐད་བརྗོད། ། <br> <br>",
                        "གང་ཚེ་འགས་ཀྱང་མཐོང་མིན་ན། ། <br> གསལ་བའམ་ནི་མི་གསལ་བ། ། <br> མོ་གཤམ་བུ་མོའི་འགྱིང་བག་བཞིན། ། <br> དེ་ན་བརྗོད་ཀྱང་དོན་མེད་དོ། ། <br> <br>",
                        "གལ་ཏེ་རང་རིག་ཡོད་མིན་ན། ། <br> རྣམ་ཤེས་དྲན་པར་ཇི་ལྟར་འགྱུར། ། <br> གཞན་མྱོང་བ་ན་འབྲེལ་པ་ལས། ། <br> དྲན་འགྱུར་བྱི་བའི་དུག་བཞིན་ནོ། ། <br> <br>",
                        "རྐྱེན་གཞན་དག་དང་ལྡན་པ་ནི། ། <br> མཐོང་ཕྱིར་རང་ཉིད་རབ་གསལ་ན། ། <br> གྲུབ་པའི་མིག་སྨན་སྦྱོར་བ་ལས། ། <br> བུམ་མཐོང་མིག་སྨན་ཉིད་འགྱུར་མིན། ། <br> <br>",
                        "ཇི་ལྟར་མཐོང་ཐོས་ཤེས་པ་དག ། <br> འདིར་ནི་དགག་པར་བྱ་མིན་ཏེ། ། <br> འདིར་ནི་སྡུག་བསྔལ་རྒྱུར་གྱུར་པ། ། <br> བདེན་པར་རྟོག་པ་བཟློག་བྱ་ཡིན། ། <br> <br>",
                        "སེམས་ལས་སྒྱུ་མ་གཞན་མིན་ཞིང་། ། <br> གཞན་མིན་པར་ཡང་མི་རྟག་ན། ། <br> དངོས་ན་ཇི་ལྟར་དེ་གཞན་མིན། ། <br> གཞན་མིན་ཞེ་ན་དངོས་པོར་མེད། ། <br> <br>",
                        "ཇི་ལྟར་སྒྱུ་མ་བདེན་མིན་ཡང་། ། <br> བལྟ་བྱ་དེ་བཞིན་ལྟ་བྱེད་ཡིད། ། <br> གལ་ཏེ་འཁོར་བ་དངོས་རྟེན་ཅན། ། <br> དེ་ནི་གཞན་དུ་མཁའ་འདྲར་འགྱུར། ། <br> <br>",
                        "དངོས་མེད་དངོས་ལ་བརྟེན་པས་ན། ། <br> བྱེད་དང་ལྡན་པར་ཇི་ལྟར་འགྱུར། ། <br> ཁྱོད་ཀྱི་སེམས་ནི་གྲོགས་མེད་པ། ། <br> གཅིག་པུ་ཉིད་དུ་འགྱུར་བ་ཡིན། ། <br> <br>",
                        "གང་ཚེ་སེམས་ནི་གཟུང་བྲལ་བ། ། <br> དེ་ཚེ་ཐམས་ཅད་དེ་བཞིན་གཤེགས། ། <br> དེ་ལྟ་ན་ཡང་སེམས་ཙམ་དུ། ། <br> བརྟགས་ལ་ཡོན་ཏན་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "སྒྱུ་མ་ལྟ་བུར་ཤེས་ན་ཡང་། ། <br> ཇི་ལྟར་ཉོན་མོངས་ལྡོག་འགྱུར་ཏེ། ། <br> གང་ཚེ་སྒྱུ་མའི་བུད་མེད་ལ། ། <br> དེ་བྱེད་ཉིད་ཀྱང་ཆགས་སྐྱེ་འགྱུར། ། <br> <br>",
                        "དེ་བྱེད་པ་ནི་ཤེས་བྱ་ལ། ། <br> ཉོན་མོངས་བག་ཆགས་མ་སྤངས་པ། ། <br> དེས་ན་དེ་མཐོང་བ་ན་དེ། ། <br> སྟོང་ཉིད་བག་ཆགས་ཉམ་ཆུང་ཉིད། ། <br> <br>",
                        "སྟོང་ཉིད་བག་ཆགས་གོམས་པས་ནི། ། <br> དངོས་པོའི་བག་ཆགས་སྤོང་འགྱུར་ཞིང་། ། <br> ཅི་ཡང་མེད་ཅེས་གོམས་པས་ནི། ། <br> དེ་ཡང་ཕྱི་ནས་སྤོང་བར་འགྱུར། ། <br> <br>",
                        "གང་ཚེ་གང་ཞིག་མེད་དོ་ཞེས། ། <br> བརྟག་བྱའི་དངོས་པོ་མི་དམིགས་པ། ། <br> དེ་ཚེ་དངོས་མེད་རྟེན་བྲལ་བ། ། <br> བློ་ཡི་མདུན་ན་ཇི་ལྟར་གནས། ། <br> <br>",
                        "གང་ཚེ་དངོས་དང་དངོས་མེད་དག ། <br> བློ་ཡི་མདུན་ན་མི་གནས་པ། ། <br> དེ་ཚེ་རྣམ་པ་གཞན་མེད་པས། ། <br> དམིགས་པ་མེད་པར་རབ་ཏུ་ཞི། ། <br> <br>",
                        "ཡིད་བཞིན་ནོར་བུ་དཔག་བསམ་ཤིང་། ། <br> ཇི་ལྟར་རེ་བ་ཡོངས་སྐོང་བ། ། <br> དེ་བཞིན་གདུལ་བྱ་སྨོན་ལམ་གྱི། ། <br> དབང་གིས་རྒྱལ་བའི་སྐུར་སྣང་ངོ་། ། <br> <br>",
                        "དཔེར་ན་ནམ་མཁའ་ལྡིང་གི་ནི། ། <br> མཆོད་སྡོང་བསྒྲུབས་ནས་འདས་གྱུར་པ། ། <br> དེ་འདས་ཡུན་རིང་ལོན་ཡང་དེ། ། <br> དུག་ལ་སོགས་པ་ཞི་བྱེད་བཞིན། ། <br> <br>",
                        "བྱང་ཆུབ་སྤྱོད་པའི་རྗེས་མཐུན་པས། ། <br> རྒྱལ་བའི་མཆོད་སྡོང་སྒྲུབ་པ་ཡང་། ། <br> བྱང་ཆུབ་སེམས་དཔའ་མྱ་ངན་ལས། ། <br> འདས་ཀྱང་དོན་རྣམས་ཐམས་ཅད་མཛད། ། <br> <br>",
                        "སེམས་མེད་པ་ལ་མཆོད་བྱས་པས། ། <br> ཇི་ལྟར་འབྲས་བུར་ལྡན་པར་འགྱུར། ། <br> གང་ཕྱིར་བཞུགས་པའམ་མྱ་ངན་འདས། ། <br> མཚུངས་པ་ཉིད་དུ་བཤད་ཕྱིར་རོ། ། <br> <br>",
                        "ཀུན་རྫོབ་བམ་ནི་དེ་ཉིད་དུའང་། ། <br> རུང་སྟེ་དེར་འབྲས་ལུང་ལས་ཡིན། ། <br> དཔེར་ན་བདེན་པའི་སངས་རྒྱས་ལ། ། <br> ཇི་ལྟར་འབྲས་བུར་བཅས་པ་བཞིན། ། <br> <br>",
                        "བདེན་པ་མཐོང་བས་གྲོལ་འགྱུར་གྱི། ། <br> སྟོང་ཉིད་མཐོང་བས་ཅི་ཞིག་བྱ། ། <br> གང་ཕྱིར་ལུང་ལས་ལམ་འདི་ནི། ། <br> མེད་པར་བྱང་ཆུབ་མེད་པར་གསུངས། ། <br> <br>",
                        "གལ་ཏེ་ཐེག་ཆེན་མ་གྲུབ་ན། ། <br> ཁྱོད་ཀྱི་ལུང་ནི་ཇི་ལྟར་གྲུབ། ། <br> གང་ཕྱིར་གཉིས་ཀ་ལ་འདི་གྲུབ། ། <br> དང་པོ་ཁྱོད་ལ་འདི་མ་གྲུབ། ། <br> <br>",
                        "རྐྱེན་གང་གིས་ནི་དེར་ཡིད་ཆེས། ། <br> དེ་ནི་ཐེག་ཆེན་ལ་ཡང་མཚུངས། ། <br> གཞན་གཉིས་འདོད་པས་བདེན་ན་ནི། ། <br> རིག་བྱེད་སོགས་ཀྱང་བདེན་པར་འགྱུར། ། <br> <br>",
                        "ཐེག་ཆེན་རྩོད་བཅས་ཕྱིར་ཞེ་ན། ། <br> ལུང་ལ་མུ་སྟེགས་པ་རྣམས་དང་། ། <br> ལུང་གཞན་ལ་ཡང་རང་གཞན་དག ། <br> རྩོད་བཅས་ཡིན་ཕྱིར་དོར་བྱར་འགྱུར། ། <br> <br>",
                        "བསྟན་རྩ་དགེ་སློང་ཉིད་ཡིན་ན། ། <br> དགེ་སློང་ཉིད་ཀྱང་དཀའ་བར་གནས། ། <br> སེམས་ནི་དམིགས་དང་བཅས་རྣམས་ཀྱི། ། <br> མྱ་ངན་འདས་པའང་དཀའ་བར་གནས། ། <br> <br>",
                        "ཉོན་མོངས་སྤངས་པས་གྲོལ་ན་དེའི། ། <br> དེ་མ་ཐག་ཏུ་དེར་འགྱུར་རོ། ། <br> ཉོན་མོངས་མེད་ཀྱང་དེ་དག་ལ། ། <br> ལས་ཀྱི་ནུས་པ་མཐོང་བ་ཡིན། ། <br> <br>",
                        "རེ་ཞིག་ཉེར་ལེན་སྲེད་པ་ནི། ། <br> མེད་ཅེས་ངེས་པ་ཉིད་ཅེ་ན། ། <br> སྲེད་དེ་ཉོན་མོངས་ཅན་མིན་ཡང་། ། <br> ཀུན་རྨོངས་བཞིན་དུ་ཅི་སྟེ་མེད། ། <br> <br>",
                        "ཚོར་བའི་རྐྱེན་གྱིས་སྲེད་པ་ཡིན། ། <br> ཚོར་བ་དེ་དག་ལ་ཡང་ཡོད། ། <br> དམིགས་པ་དང་ནི་བཅས་པའི་སེམས། ། <br> འགའ་ཞིག་ལ་ནི་གནས་པར་འགྱུར། ། <br> <br>",
                        "སྟོང་ཉིད་དང་ནི་བྲལ་བའི་སེམས། ། <br> འགགས་པ་སླར་ཡང་སྐྱེ་འགྱུར་ཏེ། ། <br> འདུ་ཤེས་མེད་པའི་སྙོམས་འཇུག་བཞིན། ། <br> དེས་ན་སྟོང་ཉིད་བསྒོམ་པར་བྱ། ། <br> <br>",
                        "ངག་གང་མདོ་སྡེ་ལ་འཇུག་དེ། ། <br> གལ་ཏེ་སངས་རྒྱས་གསུངས་འདོད་ན། ། <br> ཐེག་ཆེན་ཕལ་ཆེར་ཁྱེད་ཅག་གི །མདོ་དང་མཚུངས་འདོད་མིན་ནམ་ཅི། ། <br> <br>",
                        "གལ་ཏེ་མ་གཏོགས་གཅིག་གིས་ནི། ། <br> ཐམས་ཅད་སྐྱོན་དང་བཅས་འགྱུར་ན། ། <br> མདོ་མཚུངས་གཅིག་གིས་ཐམས་ཅད་ནི། ། <br> རྒྱལ་བས་གསུངས་པ་ཅིས་མ་ཡིན། ། <br> <br>",
                        "ངག་གང་འོད་སྲུངས་ཆེན་པོ་ལ། ། <br> སོགས་པས་གཏིང་དཔོགས་མ་གྱུར་པ། ། <br> དེ་ནི་ཁྱོད་ཀྱིས་མ་རྟོགས་པས། ། <br> གཟུང་བྱ་མིན་པར་སུ་ཞིག་བྱེད། ། <br> <br>",
                        "རྨོངས་པས་སྡུག་བསྔལ་ཅན་དོན་དུ། ། <br> ཆགས་དང་འཇིགས་མཐའ་ལས་གྲོལ་བ། ། <br> འཁོར་བར་གནས་པ་གྲུབ་འགྱུར་བ། ། <br> འདི་ནི་སྟོང་ཉིད་འབྲས་བུ་ཡིན། ། <br> <br>",
                        "དེ་ལྟར་སྟོང་པ་ཉིད་ཕྱོགས་ལ། ། <br> སུན་འབྱིན་པ་ནི་འཐད་མ་ཡིན། ། <br> དེས་ན་ཐེ་ཚོམ་མི་ཟ་བར། ། <br> སྟོང་པ་ཉིད་ནི་བསྒོམ་པར་བྱ། ། <br> <br>",
                        "ཉོན་མོངས་ཤེས་བྱའི་སྒྲིབ་པ་ཡི། ། <br> མུན་པའི་གཉེན་པོ་སྟོང་པ་ཉིད། ། <br> མྱུར་དུ་ཐམས་ཅད་མཁྱེན་འདོད་པས། ། <br> དེ་ནི་ཇི་ལྟར་སྒོམ་མི་བྱེད། ། <br> <br>",
                        "དངོས་གང་སྡུག་བསྔལ་སྐྱེད་བྱེད་པ། ། <br> དེ་ལས་སྐྲག་པ་སྐྱེ་འགྱུར་ན། ། <br> སྟོང་ཉིད་སྡུག་བསྔལ་ཞི་བྱེད་པ། ། <br> དེ་ལ་འཇིགས་པ་ཇི་ལྟར་སྐྱེ། ། <br> <br>",
                        "གལ་ཏེ་བདག་འགའ་ཡོད་ན་ནི། ། <br> ཅི་ཡང་རུང་ལས་འཇིགས་འགྱུར་ན། ། <br> བདག་ཉིད་འགའ་ཡང་ཡོད་མིན་པས། ། <br> འཇིགས་པར་འགྱུར་བ་སུ་ཞིག་ཡིན། ། <br> <br>",
                        "སོ་དང་སྐྲ་སེན་བདག་མ་ཡིན། ། <br> བདག་ནི་རུས་པ་ཁྲག་མ་ཡིན། ། <br> སྣབས་མིན་བད་ཀན་མ་ཡིན་ཏེ། ། <br> ཆུ་སེར་དང་ནི་རྣག་ཀྱང་མིན། ། <br> <br>",
                        "བདག་ནི་ཞག་དང་རྡུལ་མིན་ཏེ། ། <br> གློ་མཆིན་དག་ཀྱང་བདག་མ་ཡིན། ། <br> ནང་ཁྲོལ་གཞན་ཡང་བདག་མིན་ཏེ། ། <br> བདག་ནི་ཕྱི་ས་གཅིན་མ་ཡིན། ། <br> <br>",
                        "ཤ་དང་པགས་པ་བདག་མིན་ཏེ། ། <br> དྲོད་དང་རླུང་ཡང་བདག་མ་ཡིན། ། <br> བུ་ག་བདག་མིན་རྣམ་ཀུན་དུ། ། <br> རྣམ་ཤེས་དྲུག་ཀྱང་བདག་མ་ཡིན། ། <br> <br>",
                        "གལ་ཏེ་སྒྲ་ཡི་ཤེས་རྟག་ན། ། <br> ཐམས་ཅད་ཚེ་ན་སྒྲ་འཛིན་འགྱུར། ། <br> ཤེས་བྱ་མེད་ན་ཅི་ཞིག་རིག ། <br> གང་གིས་ཤེས་པ་ཞེས་རྗོད་བྱེད། ། <br> <br>",
                        "གལ་ཏེ་ཤེས་མེད་ཤེས་ཡིན་ན། ། <br> ཤིང་ཡང་ཤེས་པར་ཐལ་བར་འགྱུར། ། <br> དེས་ན་ཤེས་བྱ་ཉེར་གནས་པ། ། <br> མེད་པར་ཤེས་པ་མེད་ཅེས་ངེས། ། <br> <br>",
                        "དེ་ཉིད་ཀྱིས་ནི་གཟུགས་ཤེས་ན། ། <br> དེ་ཚེ་ཐོས་པའང་ཅི་སྟེ་མིན། ། <br> གལ་ཏེ་སྒྲ་མི་ཉེ་ཕྱིར་ན། ། <br> དེས་ན་དེ་ཡི་ཤེས་པའང་མེད། ། <br> <br>",
                        "སྒྲ་འཛིན་རང་བཞིན་གང་ཡིན་པ། ། <br> དེ་གཟུགས་འཛིན་པར་ཇི་ལྟར་འགྱུར། ། <br> གཅིག་ནི་ཕ་དང་བུ་ཉིད་དུ། ། <br> བརྟགས་ཡིན་ཡང་དག་ཉིད་མིན་ཏེ། ། <br> <br>",
                        "འདི་ལྟར་སྙིང་སྟོབས་རྡུལ་དང་ནི། ། <br> མུན་པ་བུ་མིན་ཕ་ཡང་མིན། ། <br> དེ་ནི་སྒྲ་འཛིན་དང་ལྡན་པའི། ། <br> རང་བཞིན་དུ་ནི་མཐོང་མ་ཡིན། ། <br> <br>",
                        "གར་མཁན་ལྟ་བུར་ཚུལ་གཞན་གྱིས། ། <br> དེ་ཉིད་མཐོང་ན་དེ་རྟག་མིན། ། <br> གལ་ཏེ་ཚུལ་གཞན་དེ་ཉིད་ན། ། <br> གཅིག་ཉིད་དེ་ནི་སྔོན་མེད་གཅིག ། <br> <br>",
                        "གལ་ཏེ་ཚུལ་གཞན་བདེན་མིན་ན། ། <br> དེ་ཡི་རང་གི་རང་བཞིན་སྨྲོས། ། <br> ཤེས་ཉིད་ཅེ་ན་དེ་ལྟ་ན། ། <br> སྐྱེས་ཀུན་གཅིག་ཏུ་ཐལ་བར་འགྱུར། ། <br> <br>",
                        "སེམས་པ་སེམས་མེད་དེ་དག་ཀྱང་། ། <br> གཅིག་འགྱུར་གང་ཕྱིར་ཡོད་ཉིད་མཚུངས། ། <br> གང་ཚེ་བྱེ་བྲག་ཕྱིན་ཅི་ལོག ། <br> དེ་ཚེ་འབྲ་བའི་རྟེན་གང་ཡིན། ། <br> <br>",
                        "སེམས་མེད་པ་ཡང་བདག་མིན་ཏེ། ། <br> སེམས་མེད་ཉིད་ཕྱིར་བུམ་སོགས་བཞིན། ། <br> འོན་ཏེ་སེམས་དང་ལྡན་པའི་ཕྱིར། ། <br> ཤེས་ན་མི་ཤེས་འཇིག་པར་ཐལ། ། <br> <br>",
                        "ཇི་སྟེ་བདག་ལ་འགྱུར་མེད་ན། ། <br> སེམས་པས་དེ་ལ་ཅི་ཞིག་བྱས། ། <br> དེ་ལྟར་ཤེས་མེད་བྱ་བྲལ་བ། ། <br> ནམ་མཁའ་བདག་ཏུ་བྱས་པར་འགྱུར། ། <br> <br>",
                        "གལ་ཏེ་བདག་ནི་ཡོད་མིན་ན། ། <br> ལས་འབྲས་འབྲེལ་པ་རིགས་མིན་ཏེ། ། <br> ལས་བྱས་ནས་ནི་ཞིག་པས་ན། ། <br> སུ་ཡི་ལས་སུ་འགྱུར་ཞེ་ན། ། <br> <br>",
                        "བྱ་བ་འབྲས་བཞི་ཐ་དད་དང་། ། <br> དེ་བདག་བྱེད་པ་མེད་པར་ཡང་། ། <br> ཡུ་བུ་གཉི་ག་ལ་གྲུབ་པས། ། <br> འདིར་བརྩད་དོན་མེད་མ་ཡིན་ནམ། ། <br> <br>",
                        "རྒྱུ་ལྡན་འབྲས་བུ་དང་བཅས་ཞེས། ། <br> མཐོང་བ་འདི་ནི་སྲིད་མ་ཡིན། ། <br> རྒྱུད་གཅིག་ལ་ནི་བརྟེན་ནས་སུ། ། <br> བྱེད་པོ་སྤྱོད་པོ་ཞེས་བྱར་བསྟན། ། <br> <br>",
                        "འདས་དང་མ་འོངས་པ་ཡི་སེམས། ། <br> བདག་མིན་དེ་ནི་མེད་པའི་ཕྱིར། ། <br> འོན་ཏེ་སྐྱེས་སེམས་བདག་ཡིན་ན། ། <br> དེ་ཞིག་ན་ཡང་བདག་མེད་དོ། ། <br> <br>",
                        "དཔེར་ན་ཆུ་ཤིང་སྡོང་པོ་དག ། <br> ཆ་ཤས་ཕྱེ་ན་འགའ་མེད་པ། ། <br> དེ་བཞིན་རྣམ་པར་དཔྱད་པ་ཡིས། ། <br> བཙལ་ན་བདག་ཀྱང་ཡང་དག་མིན། ། <br> <br>",
                        "གལ་ཏེ་སེམས་ཅན་ཡོད་མིན་ན། ། <br> སུ་ལ་སྙིང་རྗེ་བྱ་ཞེ་ན། ། <br> འབྲས་བུའི་དོན་དུ་ཁས་བླངས་པའི། ། <br> རྨོངས་པས་བརྟགས་པ་གང་ཡིན་པའོ། ། <br> <br>",
                        "སེམས་ཅན་མེད་འབྲས་སུ་ཡི་ཡིན། ། <br> བདེན་ཏེ་འོན་ཀྱང་རྨོངས་ལས་འདོད། ། <br> སྡུག་བསྔལ་ཉེ་བར་ཞི་དོན་དུ། ། <br> འབྲས་བུའི་རྨོངས་པ་བཟློག་མི་བྱ། ། <br> <br>",
                        "སྡུག་བསྔལ་རྒྱུ་ཡི་ང་རྒྱལ་ནི། ། <br> བདག་ཏུ་རྨོངས་པས་འཕེལ་བར་འགྱུར། ། <br> དེ་ལས་ཀྱང་བཟློག་མེད་ཅེ་ན། ། <br> བདག་མེད་བསྒོམ་པ་མཆོག་ཡིན་ནོ། ། <br> <br>",
                        "ལུས་ནི་རྐང་པ་བྱིན་པ་མིན། ། <br> བརླ་དང་རྐེད་པའང་ལུས་མ་ཡིན། ། <br> ལྟོ་དང་རྒྱབ་ཀྱང་ལུས་མིན་ཏེ། ། <br> བྲང་དང་དཔུང་པའང་ལུས་མ་ཡིན། ། <br> <br>",
                        "རྩིབ་ལོགས་ལག་པའང་ལུས་མིན་ཏེ། ། <br> མཆན་ཁུང་ཕྲག་པའང་ལུས་མ་ཡིན། ། <br> ནང་ཁྲོལ་རྣམས་ཀྱང་དེ་མིན་ལ། ། <br> མགོ་དང་མགྲིན་པའང་ལུས་མིན་ན། ། <br> འདི་ལ་ལུས་ནི་གང་ཞིག་ཡིན། ། <br> <br>",
                        "གལ་ཏེ་ལུས་འདི་ཐམས་ཅད་ལ། ། <br> ཕྱོགས་རེ་ཡིས་ནི་གནས་གྱུར་ན། ། <br> ཆ་རྣམས་ཆ་ལ་གནས་གྱུར་མོད། ། <br> དེ་རང་ཉིད་ནི་གང་ལ་གནས། ། <br> <br>",
                        "གལ་ཏེ་བདག་ཉིད་ཀུན་གྱི་ལུས། ། <br> ལག་སོགས་རྣམས་ལ་གནས་ན་ནི། ། <br> ལག་སོགས་དེ་དག་ཇི་སྙེད་པ། ། <br> དེ་སྙེད་ཀྱི་ནི་ལུས་སུ་འགྱུར། ། <br> <br>",
                        "ཕྱི་དང་ནང་ན་ལུས་མེད་ན། ། <br> ཇི་ལྟར་ལག་སོགས་ལ་ལུས་ཡོད། ། <br> ལག་སོགས་རྣམས་ལས་གཞན་མེད་ན། ། <br> དེ་ནི་ཇི་ལྟར་ཡོད་པ་ཡིན། ། <br> <br>",
                        "དེས་ན་ལུས་མེད་ལ་སོགས་ལ། ། <br> རྨོངས་པ་ཡིས་ནི་ལུས་བློར་འགྱུར། ། <br> དབྱིབས་སུ་བཀོད་པའི་ཁྱད་པར་གྱིས། ། <br> ཐོ་ཡོར་ལ་ནི་མི་བློ་བཞིན། ། <br> <br>",
                        "ཇི་སྲིད་རྐྱེན་ཚོགས་དེ་སྲིད་དུ། ། <br> ལུས་ནི་སྐྱེས་བུ་ལྟར་སྣང་བ། ། <br> དེ་བཞིན་ཇི་སྲིད་ལག་སོགས་ལ། ། <br> དེ་ཡོད་དེ་སྲིད་དེ་ལུས་སྣང་། ། <br> <br>",
                        "དེ་བཞིན་སོར་མོའི་ཚོགས་ཡིན་ཕྱིར། ། <br> ལག་པའང་གང་ཞིག་ཡིན་པར་འགྱུར། ། <br> དེ་ཡང་ཚིགས་ཀྱི་ཚོགས་ཡིན་ཕྱིར། ། <br> ཚིགས་ཀྱང་རང་གི་ཆ་ཕྱེ་བས། ། <br> <br>",
                        "ཆ་ཡང་རྡུལ་དུ་ཕྱེ་བས་ཏེ། ། <br> རྡུལ་དེའང་ཕྱོགས་ཆའི་དབྱེ་བ་ཡིས། ། <br> ཕྱོགས་དབྱེའང་ཆ་ཤས་དང་བྲལ་ཕྱིར། ། <br> མཁའ་བཞིན་དེས་ན་རྡུལ་ཡང་མེད། ། <br> <br>",
                        "དེ་ལྟར་རྨི་ལམ་ལྟ་བུ་ཡི། ། <br> གཟུགས་ལ་དཔྱོད་ལྡན་སུ་ཞིག་ཆགས། ། <br> གང་ཚེ་དེ་ལྟར་ལུས་མེད་པ། ། <br> དེ་ཚེ་སྐྱེས་གང་བུད་མེད་གང་། ། <br> <br>",
                        "སྡུག་བསྔལ་དེ་ཉིད་དུ་ཡོད་ན། ། <br> ཅི་སྟེ་རབ་དགའ་ལ་མི་གནོད། ། <br> བདེན་མྱ་ངན་གདུང་སོགས་ལ། ། <br> ཞིམ་སོགས་ཅི་སྟེ་དགའ་མི་བྱེད། ། <br> <br>",
                        "སྟོབས་དང་ལྡན་པས་ཟིལ་མནན་ཕྱིར། ། <br> གལ་ཏེ་དེ་མྱོང་མ་ཡིན་ན། ། <br> གང་ཞིག་ཉམས་མྱོང་བདག་ཉིད་མིན། ། <br> དེ་ན་ཚོར་བ་ཇི་ལྟར་ཡིན། ། <br> <br>",
                        "སྡུག་བསྔལ་ཕྲ་མོ་ཉིད་དུ་ཡོད། ། <br> འདི་ཡི་རགས་པ་བསལ་མིན་ནམ། ། <br> དེ་ནི་དེ་ལས་གཞན་དགའ་ཙམ། ། <br> ཞེ་ན་ཕྲ་ཉིད་དེ་ཡང་དེའི། ། <br> <br>",
                        "གལ་ཏེ་འགལ་རྐྱེན་སྐྱེས་པས་ན། ། <br> སྡུག་བསྔལ་སྐྱེས་པ་མིན་ན་ནི། ། <br> ཚོར་བར་རྟོག་པ་མངོན་ཞེན་ཉིད། ། <br> ཡིན་ཞེས་བྱ་བར་གྲུབ་མིན་ནམ། ། <br> <br>",
                        "དེ་ཉིད་ཕྱིར་ན་འདི་ཡི་ནི། ། <br> གཉེན་པོ་རྣམ་དཔྱོད་འདི་བསྒོམ་སྟེ། ། <br> རྣམ་བརྟགས་ཞིང་ལས་བྱུང་བ་ཡི། ། <br> བསམ་གཏན་རྣལ་འབྱོར་པ་ཡི་ཟས། ། <br> <br>",
                        "གལ་ཏེ་དབང་དོན་པར་བཅས་ན། ། <br> དེ་དག་གང་དུ་ཕྲད་པར་འགྱུར། ། <br> བར་མེད་ན་ཡང་གཅིག་ཉིད་དེ། ། <br> གང་ཞིག་གང་དང་ཕྲད་པར་འགྱུར། ། <br> <br>",
                        "རྡུལ་ཕྲན་རྡུལ་ཕྲན་ལ་འཇུག་མེད། ། <br> དེ་ནི་སྐབས་མེད་མཉམ་པ་ཡིན། ། <br> མ་ཞུགས་པ་ལ་འདྲེ་མེད་ཅིང་། ། <br> མ་འདྲེས་པ་ལ་ཕྲད་པ་མེད། ། <br> <br>",
                        "ཆ་མེད་པ་ལའང་ཕྲད་པ་ཞེས། ། <br> བྱ་བ་ཇི་ལྟར་འཐད་པར་འགྱུར། ། <br> ཕྲད་པ་དང་ནི་ཆ་མེད་པར། ། <br> གལ་ཏེ་མཐོང་ན་བསྟན་པར་གྱིས། ། <br> <br>",
                        "རྣམ་ཤེས་ལུས་མེད་པ་ལ་ནི། ། <br> ཕྲད་པ་འཐད་པ་མ་ཡིན་ཉིད། ། <br> ཚོགས་པའང་དངོས་པོ་མེད་ཕྱིར་ཏེ། ། <br> སྔར་ནི་ཇི་ལྟར་རྣམ་དཔྱད་བཞིན། ། <br> <br>",
                        "དེ་ལྟར་རེག་པ་ཡོད་མིན་ན། ། <br> ཚོར་བ་གང་ལས་འབྱུང་བར་འགྱུར། ། <br> ངལ་འདི་ཅི་ཡི་དོན་དུ་ཡིན། ། <br> གང་གིས་གང་ལ་གནོད་པར་འགྱུར། ། <br> <br>",
                        "གང་ཚེ་ཚོར་པོ་འགའ་མེད་ཅིང་། ། <br> ཚོར་བའང་ཡོད་པ་མ་ཡིན་པ། ། <br> དེ་ཚེ་གནས་སྐབས་འདི་མཐོང་ནས། ། <br> སྲེད་པ་ཅི་ཕྱིར་ལྡོག་མི་འགྱུར། ། <br> <br>",
                        "མཐོང་བ་འམ་ནི་རེག་པ་ཡང་། ། <br> རྨི་ལམ་སྒྱུ་འདྲའི་བདག་ཉིད་ཀྱིས། ། <br> སེམས་དང་ལྷན་ཅིག་སྐྱེས་པའི་ཕྱིར། ། <br> ཚོར་བ་དེ་ཡིས་མཐོང་མ་ཡིན། ། <br> <br>",
                        "སྔར་དང་ཕྱི་མར་སྐྱེས་པས་ཀྱང་། ། <br> དྲན་པར་འགྱུར་གྱི་མྱོང་མ་ཡིན། ། <br> རང་གིས་བདག་ཉིད་མྱོང་མིན་ལ། ། <br> གཞན་དག་གིས་ཀྱང་མྱོང་མ་ཡིན། ། <br> <br>",
                        "ཚོར་པོ་འགའ་ཡང་ཡོད་མིན་ཏེ། ། <br> དེས་ན་ཚོར་བ་དེ་ཉིད་མིན། ། <br> དེ་ལྟར་བདག་མེད་ཚོགས་འདི་ལ། ། <br> འདི་ཡིས་ཅི་སྟེ་གནོད་པར་བྱ། ། <br> <br>",
                        "ཡིད་ནི་དབང་རྣམས་ལ་མི་གནས། ། <br> གཟུགས་སོགས་ལ་མིན་བར་ནའང་མིན། ། <br> ནང་ཡང་སེམས་མིན་ཕྱི་མིན་ཞིང་། ། <br> གཞན་དུ་ཡང་ནི་རྙེད་མ་ཡིན། ། <br> <br>",
                        "གང་ཞིག་ལུས་མིན་གཞན་དུ་མིན། ། <br> འདྲེས་མིན་ལོགས་སུའང་འགར་མེད་པ། ། <br> དེ་ནི་ཅུང་ཟད་མིན་དེའི་ཕྱིར། ། <br> སེམས་ཅན་རང་བཞིན་མྱ་ངན་འདས། ། <br> <br>",
                        "ཤེས་བྱ་ལས་སྔར་ཤེས་ཡོད་ན། ། <br> དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། ། <br> ཤེས་དང་ཤེས་བྱ་ལྷན་ཅིག་ན། ། <br> དེ་ནི་ཅི་ལ་དམིགས་ནས་སྐྱེ། ། <br> <br>",
                        "འོན་ཏེ་ཤེས་བྱའི་ཕྱིས་ཡོད་ན། ། <br> དེ་ཚེ་ཤེས་པ་གང་ལས་སྐྱེ། ། <br> དེ་ལྟར་ཆོས་རྣམས་ཐམས་ཅད་ཀྱི། ། <br> སྐྱེ་བ་རྟོགས་པར་འགྱུར་མ་ཡིན། ། <br> <br>",
                        "གལ་ཏེ་དེ་ལྟར་ཀུན་རྫོབ་མེད། ། <br> དེ་ལ་བདེན་གཉིས་ག་ལ་ཡོད། ། <br> དེ་ཡང་ཀུན་རྫོབ་གཞན་གྱིས་ན། ། <br> སེམས་ཅན་མྱ་ངན་ག་ལ་འདའ། ། <br> <br>",
                        "འདི་ནི་གཞན་སེམས་རྣམ་རྟོག་སྟེ། ། <br> དེ་ནི་རང་གི་ཀུན་རྫོབ་མིན། ། <br> ཕྱིས་དེ་ངེས་ན་དེ་ཡོད་དེ། ། <br> མིན་ན་ཀུན་རྫོབ་མེད་པ་ཉིད། ། <br> <br>",
                        "རྟོག་དང་བརྟག་པར་བྱ་བ་དག ། <br> གཉིས་པོ་ཕན་ཚུན་བརྟེན་པ་ཡིན། ། <br> ཇི་ལྟར་གྲགས་པ་ལ་བརྟེན་ནས། ། <br> རྣམ་པར་དཔྱད་པ་ཐམས་ཅད་བརྗོད། ། <br> <br>",
                        "གང་ཚེ་རྣམ་པར་དཔྱད་པ་ཡི། ། <br> རྣམ་དཔྱོད་ཀྱིས་ནི་དཔྱོད་བྱེད་ན། ། <br> དེ་ཚེ་རྣམ་དཔྱོད་དེ་ཡང་ནི། ། <br> རྣམ་དཔྱོད་ཕྱིར་ན་ཐུག་པ་མེད། ། <br> <br>",
                        "དཔྱད་བྱ་རྣམ་པར་དཔྱད་བྱས་ན། ། <br> རྣམ་དཔྱོད་ལ་ནི་རྟེན་ཡོད་མིན། ། <br> རྟེན་མེད་ཕྱིར་ན་མི་སྐྱེ་སྟེ། ། <br> དེ་ཡང་མྱ་ངན་འདས་པར་བརྗོད། ། <br> <br>",
                        "གང་གི་ལྟར་ན་འདི་གཉིས་བདེན། ། <br> དེ་ཉིད་ཤིན་ཏུ་དཀའ་བར་གནས། ། <br> གལ་ཏེ་ཤེས་དབང་ལས་དོན་གྲུབ། ། <br> ཤེས་ཡོད་ཉིད་ལ་རྟེན་ཅི་ཡོད། ། <br> <br>",
                        "འོན་ཏེ་ཤེས་བྱ་ལས་ཤེས་གྲུབ། ། <br> ཤེས་བྱ་ཡོད་ལ་རྟེན་ཅི་ཡོད། ། <br> དེ་སྟེ་ཕན་ཚུན་དབང་གིས་ཡོད། ། <br> གཉི་ག་ཡང་ནི་མེད་པར་འགྱུར། ། <br> <br>",
                        "གལ་ཏེ་བུ་མེད་ཕ་མིན་ན། ། <br> བུ་ཉིད་གང་ལས་བྱུང་བ་ཡིན། ། <br> བུ་མེད་པར་ནི་ཕ་མེད་པ། ། <br> དེ་བཞིན་དེ་གཉིས་མེད་པ་ཉིད། ། <br> <br>",
                        "མྱུ་གུ་ས་བོན་ལས་སྐྱེ་ཞིང་། ། <br> ས་བོན་དེ་ཉིད་ཀྱིས་རྟོགས་བཞིན། ། <br> ཤེས་བྱ་ལས་སྐྱེས་ཤེས་པ་ཡིས། ། <br> དེ་ཡོད་པ་ནི་ཅིས་མི་རྟོགས། ། <br> <br>",
                        "མྱུ་གུ་ལས་གཞན་ཤེས་པ་ཡིས། ། <br> ས་བོན་ཡོད་ཅེས་རྟོགས་འགྱུར་ན། ། <br> གང་ཕྱིར་ཤེས་བྱ་དེ་རྟོགས་པ། ། <br> ཤེས་པ་ཡོད་ཉིད་གང་ལས་རྟོགས། ། <br> <br>",
                        "རེ་ཞིག་འཇིག་རྟེན་མངོན་སུམ་གྱིས། ། <br> རྒྱུ་རྣམས་ཐམས་ཅད་མཐོང་བ་ཡིན། ། <br> པདྨའི་སྡོང་བུ་སོགས་དབྱེ་ནི། ། <br> རྒྱུ་ཡི་དབྱེ་བས་བསྐྱེད་པ་ཡིན། ། <br> <br>",
                        "རྒྱུ་དབྱེ་གང་གིས་བྱས་ཞེ་ན། ། <br> སྔར་གྱི་རྒྱུ་དབྱེ་ཉིད་ལས་སོ། ། <br> ཅི་ཕྱིར་རྒྱུ་ཡིས་འབྲས་སྐྱེད་ནུས། ། <br> སྔར་གྱི་རྒྱུ་ཡི་མཐུ་ཉིད་ལས། ། <br> <br>",
                        "དབང་ཕྱུག་འགྲོ་བའི་རྒྱུ་ཡིན་ན། ། <br> རེ་ཞིག་དབང་ཕྱུག་གང་ཡིན་སྨྲོས། ། <br> འབྱུང་རྣམས་ཞེ་ན་དེ་ལྟ་མོད། ། <br> མིང་ཙམ་ལ་ཡང་ཅི་ཞིག་ངལ། ། <br> <br>",
                        "འོན་ཀྱང་ས་སོགས་དུ་མ་དང་། ། <br> མི་རྟག་གཡོ་མེད་ལྷ་མིན་ཞིང་། ། <br> འགོམ་བྱ་ཉིད་དང་མི་གཙང་བས། ། <br> དེ་ནི་དབང་ཕྱུག་ཉིད་མ་ཡིན། ། <br> <br>",
                        "དབང་ཕྱུག་མཁའ་མིན་གཡོ་མེད་ཕྱིར། ། <br> བདག་མིན་སྔར་ནི་བཀག་ཟིན་ཕྱིར། ། <br> བསམ་མིན་པ་ཡི་བྱེད་པོ་ཡང་། ། <br> བསམ་མིན་བརྗོད་པས་ཅི་ཞིག་བྱ། ། <br> <br>",
                        "དེས་བསྐྱེད་འདོད་པའང་གང་ཞིག་ཡིན། ། <br> བདག་ནི་དེ་དང་ས་སོགས་དང་། ། <br> དབང་ཕྱུག་ངོ་བོའང་རྟག་མིན་ནམ། ། <br> ཤེས་པ་ཤེས་བྱ་ལས་སྐྱེ་དང་། ། <br> <br>",
                        "ཐོག་མེད་བདེ་སྡུག་ལས་ལས་ཡིན། ། <br> དེ་ཡིས་གང་ཞིག་བསྐྱེད་པ་སྨྲོས། ། <br> རྒྱུ་ལ་ཐོག་མ་ཡོད་མིན་ན། ། <br> འབྲས་བུའི་ཐོག་མ་ག་ལ་ཡོད། ། <br> <br>",
                        "རྟག་ཏུ་ཅི་ཕྱིར་བྱེད་མིན་ཏེ། ། <br> དེ་ནི་གཞན་ལ་ལྟོས་པ་མིན། ། <br> དེས་བྱས་མིན་གཞན་ཡོད་མིན་ན། ། <br> དེས་འདི་གང་ལ་ལྟོས་པར་འགྱུར། ། <br> <br>",
                        "གལ་ཏེ་ལྟོས་ན་ཚོགས་པ་ཉིད། ། <br> རྒྱུ་ཡིན་འགྱུར་གྱི་དབང་ཕྱུག་མིན། ། <br> ཚོགས་ན་མི་སྐྱེ་དབང་མེད་ཅིང་། ། <br> དེ་མེད་པར་ནི་སྐྱེ་དབང་མེད། ། <br> <br>",
                        "གལ་ཏེ་དབང་ཕྱུག་མི་འདོད་བཞིན། ། <br> བྱེད་ན་གཞན་གྱི་དབང་དུ་ཐལ། ། <br> འདོད་ནའང་འདོད་ལ་རག་ལས་འགྱུར། ། <br> བྱེད་ནའང་དབང་ཕྱུག་ག་ལ་ཡིན། ། <br> <br>",
                        "གང་དག་རྡུལ་ཕྲན་རྟག་སྨྲ་བ། ། <br> དེ་དག་ཀྱང་ནི་སྔར་བཟློག་ཟིན། ། <br> གཙོ་བོ་རྟག་པ་འགྲོ་བ་ཡི། ། <br> རྒྱུ་ཡིན་པར་ནི་གྲངས་ཅན་འདོད། ། <br> <br>",
                        "སྙིང་སྟོབས་རྡུལ་དང་མུན་པ་ཞེས། ། <br> བྱ་བའི་ཡོན་ཏན་མཉམ་གནས་ནི། ། <br> གཙོ་བོ་ཞེས་བྱར་རབ་བརྗོད་དེ། ། <br> མི་མཉམ་འགྲོ་བ་ཡིན་པར་བརྗོད། ། <br> <br>",
                        "གཅིག་ལ་རང་བཞིན་གསུམ་ཉིད་ནི། ། <br> རིགས་མིན་དེས་ན་དེ་ཡོད་མིན། ། <br> དེ་བཞིན་ཡོན་ཏན་ཡོད་མིན་ཏེ། ། <br> དེ་ཡང་སོ་སོར་རྣམ་གསུམ་ཕྱིར། ། <br> <br>",
                        "ཡོན་ཏན་མེད་ན་སྒྲ་སོགས་ཀྱང་། ། <br> ཡོད་ཉིད་ཤིན་ཏུ་རྒྱང་རིང་འགྱུར། ། <br> སེམས་མེད་གོས་ལ་སོགས་པ་ལ། ། <br> བདེ་སོགས་ཡོད་པ་སྲིད་པའང་མིན། ། <br> <br>",
                        "དངོས་རྣམས་དེ་རྒྱུའི་རང་བཞིན་ན། ། <br> དངོས་པོ་རྣམ་དཔྱད་མ་ཟིན་ནམ། ། <br> ཁྱོད་ཀྱི་རྒྱུ་ཡང་བདེ་སོགས་ཉིད། ། <br> དེ་ལས་སྣམ་སོགས་འབྱུང་བའང་མེད། ། <br> <br>",
                        "སྣམ་སོགས་ལས་ནི་བདེ་སོགས་ཡིན། ། <br> དེ་མེད་ཕྱིར་ན་བདེ་སོགས་མེད། ། <br> བདེ་སོགས་རྟག་པ་ཉིད་དུ་ཡང་། ། <br> ནམ་ཡང་དམིགས་པ་ཡོད་མ་ཡིན། ། <br> <br>",
                        "བདེ་སོགས་གསལ་བ་ཡོད་ཉིད་ན། ། <br> མྱོང་བ་ཅི་ཕྱིར་འཛིན་མ་ཡིན། ། <br> དེ་ཉིད་ཕྲ་མོར་གྱུར་ན་དེ། ། <br> རགས་དང་ཕྲ་བའང་ཇི་ལྟར་ཡིན། ། <br> <br>",
                        "རགས་པ་དོར་ནས་ཕྲ་གྱུར་པས། ། <br> ཕྲ་རགས་དེ་དག་མི་རྟག་ཉིད། ། <br> དེ་བཞིན་དངོས་པོ་ཐམས་ཅད་ནི། ། <br> མི་རྟག་ཉིད་དུ་ཅིས་མི་འདོད། ། <br> <br>",
                        "རགས་པ་བདེ་ལས་གཞན་མིན་ན། ། <br> བདེ་བ་གསལ་བ་མི་རྟག་ཉིད། ། <br> གལ་ཏེ་མེད་པ་འགའ་ཡང་ནི། ། <br> སྐྱེ་མིན་མེད་ཕྱིར་ཞེས་འདོད་ན། ། <br> <br>",
                        "གསལ་བ་མེད་པ་སྐྱེ་བར་ནི། ། <br> ཁྱོད་མི་འདོད་ཀྱང་གནས་པ་ཉིད། ། <br> གལ་ཏེ་རྒྱུ་ལ་འབྲས་གནས་ན། ། <br> ཟན་ཟ་མི་གཙང་ཟ་བར་འགྱུར། ། <br> <br>",
                        "རས་ཀྱི་རིན་གྱིས་རས་བལ་གྱི། ། <br> ས་བོན་ཉོས་ལ་བགོ་བར་གྱིས། ། <br> འཇིག་རྟེན་རྨོངས་པས་མ་མཐོང་ན། ། <br> དེ་ཉིད་ཤེས་ཀྱིས་བཞག་དེ་ཉིད། ། <br> <br>",
                        "ཤེས་དེ་འཇིག་རྟེན་ལ་ཡང་ནི། ། <br> ཡོད་པས་ཅི་སྟེ་མཐོང་མ་ཡིན། ། <br> འཇིག་རྟེན་ཚད་མ་ཉིད་མིན་ན། ། <br> གསལ་བ་མཐོང་བའང་བདེན་མ་ཡིན། ། <br> <br>",
                        "གལ་ཏེ་ཚད་མ་ཚད་མིན་ན། ། <br> དེས་གཞལ་བརྫུན་པར་མི་འགྱུར་རམ། ། <br> དེ་ཉིད་དུ་ན་སྟོང་པ་ཉིད། ། <br> སྒོམ་པ་དེ་ཕྱིར་མི་འཐད་འགྱུར། ། <br> <br>",
                        "བརྟགས་པའི་དངོས་ལ་མ་རེག་པར། ། <br> དེ་ཡི་དངོས་མེད་འཛིན་མ་ཡིན། ། <br> དེ་ཕྱིར་བརྫུན་པའི་དངོས་གང་ཡིན། ། <br> དེ་ཡི་དངོས་མེད་གསལ་བར་བརྫུན། ། <br> <br>",
                        "དེས་ན་རྨི་ལམ་བུ་ཤི་ལ། ། <br> དེ་མེད་སྙམ་པའི་རྣམ་རྟོག་ནི། ། <br> དེ་ཡོད་རྣམ་པར་རྟོག་པ་ཡི། ། <br> གེགས་ཡིན་དེ་ཡང་བརྫུན་པ་ཡིན། ། <br> <br>",
                        "དེ་བས་དེ་ལྟར་རྣམ་དཔྱད་པས། ། <br> འགའ་ཡང་རྒྱུ་མེད་ཡོད་མ་ཡིན། ། <br> སོ་སོ་བའམ་འདུས་པ་ཡི། ། <br> རྐྱེན་རྣམས་ལ་ཡང་གནས་མ་ཡིན། ། <br> <br>",
                        "གཞན་ནས་འོངས་པའང་མ་ཡིན་ལ། ། <br> གནས་པ་མ་ཡིན་འགྲོ་མ་ཡིན། ། <br> རྨོངས་པས་བདེན་པར་གང་བྱས་འདི། ། <br> སྒྱུ་མ་ལས་ནི་ཁྱད་ཅི་ཡོད། ། <br> <br>",
                        "སྒྱུ་མས་སྤྲུལ་པ་གང་ཡིན་དང་། ། <br> རྒྱུ་རྣམས་ཀྱིས་ནི་གང་སྤྲུལ་པ། ། <br> དེ་ནི་གང་ནས་འོངས་གྱུར་ཅིང་། ། <br> གང་དུ་འགྲོ་བའང་བརྟག་པར་གྱིས། ། <br> <br>",
                        "གང་ཞིག་གང་ནི་ཉེ་བ་ཡིས། ། <br> མཐོང་གྱུར་དེ་མེད་ན་མིན་པ། ། <br> བཅོས་སུ་གཟུགས་བརྙན་དང་མཚུངས་པ། ། <br> དེ་ལ་བདེན་ཉིད་ཇི་ལྟར་ཡོད། ། <br> <br>",
                        "དངོས་པོ་ཡོད་པར་གྱུར་པ་ལ། ། <br> རྒྱུ་ཡིས་དགོས་པ་ཅི་ཞིག་ཡོད། ། <br> འོན་ཏེ་དེ་ནི་མེད་ན་ཡང་། ། <br> རྒྱུ་ཡིས་དགོས་པ་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "བྱེ་བ་བརྒྱ་ཕྲག་རྒྱུ་ཡིས་ཀྱང་། ། <br> དངོས་པོ་མེད་པ་བསྒྱུར་དུ་མེད། ། <br> གནས་སྐབས་དེ་དངོས་ཇི་ལྟར་ཡིན། ། <br> དངོས་འགྱུར་གཞན་ཡང་གང་ཞིག་ཡིན། ། <br> <br>",
                        "མེད་ཚེ་དངོས་ཡོད་སྲིད་མིན་ན། ། <br> དངོས་པོ་ཡོད་པར་ནམ་ཞིག་འགྱུར། ། <br> དངོས་པོ་སྐྱེས་པར་མ་གྱུར་པར། ། <br> དངོས་མེད་དེ་ནི་འབྲལ་མི་འགྱུར། ། <br> <br>",
                        "དངོས་མེད་དང་ནི་མ་བྲལ་ན། ། <br> དངོས་པོ་ཡོད་པའི་སྐབས་མི་སྲིད། ། <br> དངོས་པོའང་མེད་པར་འགྱུར་མིན་ཏེ། ། <br> རང་བཞིན་གཉིས་སུ་ཐལ་འགྱུར་ཕྱིར། ། <br> <br>",
                        "དེ་ལྟར་འགག་པ་ཡོད་མིན་ཞིང་། ། <br> དངོས་པོའང་ཡོད་མིན་དེ་ཡི་ཕྱིར། ། <br> འགྲོ་བ་འདི་དག་ཐམས་ཅད་ནི། ། <br> རྟག་ཏུ་མ་སྐྱེས་མ་འགགས་ཉིད། ། <br> <br>",
                        "འགྲོ་བ་རྨི་ལམ་ལྟ་བུ་སྟེ། ། <br> རྣམ་པར་དཔྱད་ན་ཆུ་ཤིང་འདྲ། ། <br> མྱ་ངན་འདས་དང་མ་འདས་པའང་། ། <br> དེ་ཉིད་དུ་ན་ཁྱད་པར་མེད། ། <br> <br>",
                        "དེ་ལྟར་སྟོང་པའི་དངོས་རྣམས་ལ། ། <br> ཐོབ་པ་ཅི་ཡོད་ཤོར་ཅི་ཡོད། ། <br> གང་གིས་རིམ་གྲོ་བྱས་པའམ། ། <br> ཡོངས་སུ་བརྙས་པའང་ཅི་ཞིག་ཡོད། ། <br> <br>",
                        "བདེ་བའང་སྡུག་བསྔལ་གང་ལས་ཡིན། ། <br> མི་དགར་ཅི་ཡོད་དགར་ཅི་ཡོད། ། <br> དེ་ཉིད་དུ་ནི་བཙལ་བྱས་ན། ། <br> གང་ཞིག་སྲེད་ཅིང་གང་ལ་སྲེད། ། <br> <br>",
                        "དཔྱད་ན་གསོན་པོའི་འཇིག་རྟེན་འདི། ། <br> གང་ཞིག་འདིར་ནི་འཆི་འགྱུར་ཏེ། ། <br> འབྱུང་འགྱུར་གང་ཡིན་བྱུང་གྱུར་གང་། ། <br> གཉེན་དང་བཤེས་ཀྱང་གང་ཞིག་ཡིན། ། <br> <br>",
                        "ཐམས་ཅད་ནམ་མཁའ་འདྲ་བར་ནི། ། <br> བདག་འདྲས་ཡོངས་སུ་གཟུང་བར་གྱིས། ། <br> བདག་ཉིད་བདེ་བར་འདོད་རྣམས་ནི། ། <br> འཐབ་དང་སྤྲོ་བའི་རྒྱུ་དག་གིས། ། <br> <br>",
                        "རབ་ཏུ་འཁྲུག་དང་དགའ་བར་བྱེད། ། <br> མྱ་ངན་འབད་རྩོལ་རྩོད་པ་དང་། ། <br> ཕན་ཚུན་གཅོད་དང་འབིགས་པ་དང་། ། <br> སྡིག་དག་གིས་ནི་ཚེགས་ཆེན་འཚོ། ། <br> <br>",
                        "བདེ་འགྲོར་ཡང་དང་ཡང་འོངས་ཏེ། ། <br> བདེ་བ་མང་པོ་སྤྱད་སྤྱད་ནས། ། <br> ཤི་ནས་ངན་སོང་སྡུག་བསྔལ་ནི། ། <br> ཡུན་རིང་མི་བཟད་རྣམས་སུ་ལྟུང་། ། <br> <br>",
                        "སྲིད་པ་ན་ནི་གཡང་ས་མང་། ། <br> དེར་ནི་དེ་ཉིད་མིན་འདི་འདྲ། ། <br> དེར་ཡང་ཕན་ཚུན་འགལ་བས་ན། ། <br> སྲིད་ན་དེ་ཉིད་འདི་འདྲ་མེད། ། <br> <br>",
                        "དེ་ཡང་དཔེ་མེད་མི་བཟད་པའི། ། <br> སྡུག་བསྔལ་རྒྱ་མཚོ་མཐའ་ལས་འདས། ། <br> དེར་ནི་དེ་ལྟར་སྟོབས་ཆུང་ཞིང་། ། <br> དེར་ནི་ཚེ་ཡང་ཐུང་བ་ཉིད། ། <br> <br>",
                        "དེར་ཡང་གསོན་དང་ནད་མེད་ཀྱི། ། <br> བྱེད་དང་བཀྲེས་ནའི་ངལ་བ་དང་། ། <br> གཉིད་དང་འཚེ་དང་དེ་བཞིན་དུ། ། <br> བྱིས་དང་འགྲོགས་པ་དོན་མེད་ཀྱིས། ། <br> <br>",
                        "ཚེ་ནི་དོན་མེད་མྱུར་འདའ་ཡི། ། <br> རྣམ་དཔྱོད་ཤིན་ཏུ་རྙེད་པར་དཀའ། ། <br> དེར་ཡང་རྣམ་གཡེང་གོམས་པ་ནི། ། <br> བཟློག་པའི་ཐབས་ནི་ག་ལ་ཡོད། ། <br> <br>",
                        "དེར་ཡང་ངན་སོང་ཆེན་པོར་ནི། ། <br> ལྟུང་ཕྱིར་བདུད་ནི་བརྩོན་པར་བྱེད། ། <br> དེར་ནི་ལོག་པའི་ལམ་མང་ཞིང་། ། <br> ཐེ་ཚོམ་ལས་ཀྱང་བརྒལ་དཀའ་སྟེ། ། <br> <br>",
                        "སླར་ཡང་དལ་བ་རྙེད་དཀའ་ཞིང་། ། <br> སངས་རྒྱས་འབྱུང་རྙེད་ཤིན་ཏུ་དཀའ། ། <br> ཉོན་མོངས་ཆུ་བོ་སྤང་དཀའ་སྟེ། ། <br> ཨེ་མ་སྡུག་བསྔལ་བརྒྱུད་པར་གྱུར། ། <br> <br>",
                        "དེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་ཡང་། ། <br> རང་སྡུག་མི་མཐོང་གང་ཡིན་པ། ། <br> སྡུག་བསྔལ་ཆུ་བོར་གནས་འདི་དག ། <br> ཀྱི་ཧུད་མྱ་ངན་བྱ་བར་འོས། ། <br> <br>",
                        "དཔེར་ན་འགའ་ཞིག་ཡང་ཡང་ཁྲུས། ། <br> བྱས་ཏེ་ཡང་ཡང་མེར་འཇུག་པ། ། <br> དེ་ལྟར་ཤིན་ཏུ་སྡུག་བསྔལ་བར། ། <br> གནས་ཀྱང་བདག་ཉིད་བདེར་རློམ་བཞིན། ། <br> <br>",
                        "དེ་ལྟར་རྒ་དང་འཆི་མེད་པ། ། <br> བཞིན་དུ་སྤྱོད་པས་གནས་རྣམས་ལ། ། <br> དང་པོ་ཉིད་དུ་བསད་བྱས་ནས། ། <br> ངན་སོང་ལྟུང་བ་མི་བཟད་འོང་། ། <br> <br>",
                        "དེ་ལྟར་སྡུག་བསྔལ་མེས་གདུངས་ལ། ། <br> བསོད་ནམས་སྤྲིན་ལས་ལེགས་འཁྲུངས་པའི། ། <br> རང་གི་བདེ་བའི་ཚོགས་ཆར་གྱིས། ། <br> ཞི་བྱེད་པར་བདག་ནམ་ཞིག་འགྱུར། ། <br> <br>",
                        "ནམ་ཞིག་དམིགས་པ་མེད་ཚུལ་དུ། ། <br> གུས་པས་བསོད་ནམས་ཚོགས་བསགས་ཏེ། ། <br> དམིགས་པས་ཕུང་བར་འགྱུར་རྣམས་ལ། ། <br> སྟོང་པ་ཉིད་ནི་སྟོན་པར་འགྱུར། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལེའུ་སྟེ་དགུ་པའོ།། <br>  ། <br> ། <br>"
                    ],
                    [
                        "བདག་གིས་བྱང་ཆུབ་སྤྱོད་པ་ལ། ། <br> འཇུག་པ་རྣམ་པར་བརྩམས་པ་ཡི། ། <br> དགེ་བ་གང་དེས་འགྲོ་བ་ཀུན། ། <br> བྱང་ཆུབ་སྤྱོད་ལ་འཇུག་པར་ཤོག ། <br> <br>",
                        "ཕྱོགས་རྣམས་ཀུན་ན་ལུས་དང་སེམས། ། <br> སྡུག་བསྔལ་ནད་པ་ཇི་སྙེད་པ། ། <br> དེ་དག་བདག་གི་བསོད་ནམས་ཀྱིས། ། <br> བདེ་དགའ་རྒྱ་མཚོ་ཐོབ་པར་ཤོག ། <br> <br>",
                        "དེ་དག་འཁོར་བ་ཇི་སྲིད་དུ། ། <br> ནམ་ཡང་བདེ་ལས་ཉམས་མ་གྱུར། ། <br> འགྲོ་བས་བྱང་ཆུབ་སེམས་དཔའ་ཡི། ། <br> བདེ་བ་རྒྱུན་མི་འཆད་ཐོབ་ཤོག ། <br> <br>",
                        "འཇིག་རྟེན་ཁམས་ན་དམྱལ་བ་དག ། <br> གང་དག་ཇི་སྙེད་ཡོད་པ་རྣམས། ། <br> དེ་དག་ཏུ་ནི་ལུས་ཅན་རྣམས། ། <br> བདེ་ཅན་བདེ་བས་དགའ་བར་ཤོག ། <br> <br>",
                        "གྲང་བས་ཉམ་ཐག་དྲོ་ཐོབ་ཤོག ། <br> བྱང་ཆུབ་སེམས་དཔའི་སྤྲིན་ཆེན་ལས། ། <br> བྱུང་བའི་ཆུ་བོ་མཐའ་ཡས་ཀྱིས། ། <br> ཚ་བས་ཉམ་ཐག་བསིལ་བར་ཤོག ། <br> <br>",
                        "རལ་གྲི་ལོ་མའི་ནགས་ཚལ་ཡང་། ། <br> དེ་ལ་ཙནྡན་ནགས་སྟུག་ཤོག ། <br> ཤལ་མ་རི་ཡི་སྡོང་པོ་ཡང་། ། <br> དཔག་བསམ་ཤིང་དུ་འཁྲུངས་པར་ཤོག ། <br> <br>",
                        "འཐིང་རིལ་ངུར་པ་དག་དང་ངང་པ་དང་། ། <br> བཞད་སོགས་སྐད་སྙན་འབྱིན་པས་མཛེས་གྱུར་ཅིག ། <br> པདྨ་དྲི་བསུང་ཆེ་ལྡན་མཚོ་དག་གིས། ། <br> དམྱལ་བའི་ས་ཕྱོགས་དག་ནི་ཉམས་དགར་ཤོག ། <br> <br>",
                        "སོལ་ཕུང་དེ་དག་རིན་ཆེན་ཕུང་པོར་གྱུར། ། <br> ས་བསྲེགས་ཤེལ་གྱི་ས་གཞི་བསྟར་བར་ཤོག ། <br> བསྡུས་འཇོམས་རི་བོ་རྣམས་ཀྱང་མཆོད་པ་ཡི། ། <br> གཞལ་མེད་ཁང་གྱུར་བདེ་གཤེགས་གང་བར་ཤོག ། <br> <br>",
                        "མདག་མ་རྡོ་བསྲེགས་མཚོན་གྱི་ཆར་པ་དག ། <br> དེང་ནས་བཟུང་སྟེ་མེ་ཏོག་ཆར་པར་གྱུར། ། <br> ཕན་ཚུན་མཚོན་གྱིས་འདེབས་པ་དེ་ཡང་ནི། ། <br> དེང་ནས་རྩེ་ཕྱིར་མེ་ཏོག་འཕེན་པར་ཤོག ། <br> <br>",
                        "ཆུ་བོ་རབ་མེད་མེ་དོང་འདྲ་ནང་བྱིང་བ་དག ། <br> ཤ་ཀུན་ཞིག་གྱུར་རུས་གོང་མེ་ཏོག་ཀུནྡའི་མདོག ། <br> བདག་གི་དགེ་བའི་སྟོབས་ཀྱིས་ལྷ་ཡི་ལུས་ཐོབ་ནས། ། <br> ལྷ་མོ་རྣམས་དང་ལྷན་ཅིག་དལ་གྱིས་འབབ་གནས་ཤོག ། <br> <br>",
                        "ཅི་ཕྱིར་འདིར་ནི་གཤིན་རྗེའི་མི་དང་ཁྲ་དང་བྱ་རྒོད་མི་བཟད་རྣམས་སྐྲག་བྱེད། ། <br> ཀུན་ནས་མུན་བསལ་བདེ་དགའ་བསྐྱེད་པའི་མཐུ་བཟང་འདི་ཀོ་སུ་ཡི་མཐུ་སྙམ་སྟེ། ། <br> གྱེན་དུ་བལྟས་ན་ནམ་མཁའི་དཀྱིལ་ན་ཕྱག་ན་རྡོ་རྗེ་འབར་བ་བཞུགས་མཐོང་ནས། ། <br> རབ་ཏུ་དགའ་བའི་ཤུགས་ཀྱིས་སྡིག་དང་བྲལ་ནས་དེ་དང་ལྷན་ཅིག་འགྲོ་བར་ཤོག ། <br> <br>",
                        "མེ་ཏོག་ཆར་པ་སྤོས་ཆུ་དང་འདྲེས་བབས་པ་ཡིས། ། <br> དམྱལ་བའི་མེ་མདག་ཆིལ་ཆིལ་གསོད་པར་མཐོང་གྱུར་ནས། ། <br> གློ་བུར་བདེ་བས་ཚིམ་པ་འདི་ཅི་བསམ་པ་དང་། ། <br> སེམས་དམྱལ་རྣམས་ཀྱིས་ཕྱག་ན་པདྨ་མཐོང་བར་ཤོག ། <br> <br>",
                        "གྲོགས་དག་འཇིགས་པ་བོར་ལ་རིངས་པར་ཚུར་ཤོག་འུ་བུའི་ཐད་དུ་ནི། ། <br> གང་གི་མཐུ་ཡིས་སྡུག་བསྔལ་ཀུན་བྲལ་དགའ་བའི་ཤུགས་ཕྱིན་ལ། ། <br> འགྲོ་བ་ཀུན་ནས་ཡོངས་སྐྱོབ་བྱང་ཆུབ་སེམས་དང་བརྩེ་བ་སྐྱེས་གྱུར་པ། ། <br> གཞོན་ནུ་ཟུར་ཕུད་ཅན་འབར་འཇིགས་པ་མེད་པར་བྱེད་པ་ཅི་ཞིག་ཕྱིན། ། <br> <br>",
                        "ཁྱོད་ཀྱི་ལྷ་བརྒྱའི་ཅོད་པན་དག་གིས་ཞབས་ཀྱི་པདྨ་ལ་མཆོད་ཅིང་། ། <br> ཐུགས་རྗེའི་རླན་སྤྱན་དབུ་ལ་མེ་ཏོག་དུ་མའི་ཚོགས་ཀྱིས་ཆར་འབབ་པ། ། <br> ཁང་བརྩེགས་ཡིད་འོང་ལྷ་མོ་སྟོང་ཕྲག་བསྟོད་དབྱངས་སྒྲོགས་ལྡན་འདི་ལྟོས་ཞེས། ། <br> འཇམ་དབྱངས་དེ་འདྲ་མཐོང་ནས་ད་ནི་སེམས་དམྱལ་ཅ་ཅོ་འདོན་པར་ཤོག ། <br> <br>",
                        "དེ་ལྟར་བདག་གི་དགེ་རྩས་ཀུན་དུ་བཟང་ལ་སོགས། ། <br> བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་མེད་སྤྲིན་བདེ་བ་དང་། ། <br> བསིལ་ཞིང་དྲི་ཞིམ་དང་ལྡན་ཆར་པ་འབེབས་མཐོང་ནས། ། <br> སེམས་ཅན་དམྱལ་བ་དེ་དག་མངོན་པར་དགའ་གྱུར་ཅིག ། <br> <br>",
                        "དུད་འགྲོ་རྣམས་ནི་གཅིག་ལ་གཅིག ། <br> ཟ་བའི་འཇིགས་དང་བྲལ་བར་ཤོག ། <br> སྒྲ་མི་སྙན་པའི་མི་བཞིན་དུ། ། <br> ཡི་དགས་རྣམས་ནི་བདེ་བར་གྱུར། ། <br> <br>",
                        "འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་གི །ཕྱག་ནས་འབབ་པའི་འོ་རྒྱུན་གྱིས། ། <br> ཡི་དགས་རྣམས་ནི་ཚིམ་བྱས་ཤིང་། ། <br> ཁྲུས་བྱས་རྟག་ཏུ་བསིལ་བར་ཤོག ། <br> <br>",
                        "ལོང་བ་རྣམས་ཀྱིས་མིག་མཐོང་ཞིང་། ། <br> འོན་པས་རྟག་ཏུ་སྒྲ་ཐོས་ཤོག ། <br> ལྷ་མོ་སྒྱུ་འཕྲུལ་ཇི་བཞིན་དུ། ། <br> སྦྲུམ་མའང་གནོད་མེད་བཙའ་བར་ཤོག ། <br> <br>",
                        "གཅེར་བུ་རྣམས་ཀྱིས་གོས་དག་དང་། ། <br> བཀྲེས་པ་རྣམས་ཀྱིས་ཟས་དང་ནི། ། <br> སྐོམ་པ་རྣམས་ཀྱིས་ཆུ་དག་དང་། ། <br> བཏུང་བ་ཞིམ་པོ་ཐོབ་པར་ཤོག ། <br> <br>",
                        "བཀྲེན་པ་རྣམས་ཀྱིས་ནོར་ཐོབ་ཤོག ། <br> མྱ་ངན་ཉམ་ཐག་དགའ་ཐོབ་ཤོག ། <br> ཡི་ཆད་རྣམས་ཀྱང་ཡིད་སོས་ཤིང་། ། <br> བརྟན་པ་ཕུན་སུམ་ཚོགས་པར་ཤོག ། <br> <br>",
                        "སེམས་ཅན་ནད་པ་ཇི་སྙེད་པ། ། <br> མྱུར་དུ་ནད་ལས་ཐར་གྱུར་ཅིག ། <br> འགྲོ་བའི་ནད་ནི་མ་ལུས་པ། ། <br> རྟག་ཏུ་འབྱུང་བ་མེད་པར་ཤོག ། <br> <br>",
                        "སྐྲག་པ་རྣམས་ནི་འཇིགས་མེད་ཤོག ། <br> བཅིངས་པ་རྣམས་ནི་གྲོལ་བར་འགྱུར། ། <br> མཐུ་མེད་རྣམས་ནི་མཐུ་ལྡན་ཞིང་། ། <br> སེམས་ནི་ཕན་ཚུན་མཉེན་གྱུར་ཅིག ། <br> <br>",
                        "འདྲོན་པ་དག་ནི་ཐམས་ཅད་ལ། ། <br> ཕྱོགས་རྣམས་ཐམས་ཅད་བདེ་བར་ཤོག ། <br> གང་གི་དོན་དུ་འགྲོ་བྱེད་པ། ། <br> དེ་འབད་མི་དགོས་གྲུབ་གྱུར་ཅིག ། <br> <br>",
                        "གྲུ་དང་གྲུ་ཆེན་ཞུགས་པ་རྣམས། ། <br> ཡིད་ལ་བསམ་པ་གྲུབ་གྱུར་ཏེ། ། <br> ཆུ་ཡི་ངོགས་སུ་བདེར་ཕྱིན་ནས། ། <br> གཉེན་དང་ལྷན་ཅིག་དགའ་བར་ཤོག ། <br> <br>",
                        "མྱ་ངན་ལམ་གོལ་འཁྱམས་པ་རྣམས། ། <br> འདྲོན་པ་དག་དང་ཕྲད་གྱུར་ནས། ། <br> ཆོམ་རྐུན་སྟག་སོགས་འཇིགས་མེད་པར། ། <br> མི་ངལ་བདེ་བླག་འདོང་བར་ཤོག ། <br> <br>",
                        "དགོན་སོགས་ལམ་མེད་ཉམ་ང་བར། ། <br> བྱིས་པ་རྒན་པོ་མགོན་མེད་པ། ། <br> གཉིད་ལོག་མྱོས་ཤིང་རབ་མྱོས་རྣམས། ། <br> ལྷ་དག་སྲུང་བར་བྱེད་པར་ཤོག ། <br> <br>",
                        "མི་ངལ་ཀུན་ལས་ཐར་བ་དང་། ། <br> དད་དང་ཤེས་རབ་བརྩེ་ལྡན་ཞིང་། ། <br> ཟས་དང་སྤྱོད་པ་ཕུན་ཚོགས་ནས། ། <br> རྟག་ཏུ་ཚེ་རབས་དྲན་གྱུར་ཅིག ། <br> <br>",
                        "ཐམས་ཅད་ནམ་མཁའི་མཛོད་བཞིན་དུ། ། <br> ལོངས་སྤྱོད་ཆད་པ་མེད་པར་ཤོག ། <br> རྩོད་པ་མེད་ཅིང་འཚེ་མེད་པར། ། <br> རང་དབང་དུ་ནི་སྤྱོད་པར་ཤོག ། <br> <br>",
                        "སེམས་ཅན་གཟི་བརྗིད་ཆུང་ངུ་གང་། ། <br> དེ་དག་གཟི་བརྗིད་ཆེན་པོར་ཤོག ། <br> དཀའ་ཐུབ་ཅན་གང་གཟུགས་ངན་པ། ། <br> གཟུགས་བཟང་ཕུན་སུམ་ཚོགས་གྱུར་ཅིག ། <br> <br>",
                        "འཇིག་རྟེན་བུད་མེད་ཇི་སྙེད་པ། ། <br> དེ་དག་སྐྱེས་པ་ཉིད་གྱུར་ཅིག ། <br> མ་རབས་རྣམས་ནི་མཐོ་ཐོབ་ཅིང་། ། <br> ང་རྒྱལ་དག་ཀྱང་བཅོམ་པར་ཤོག ། <br> <br>",
                        "བདག་གི་བསོད་ནམས་འདི་ཡིས་ནི། ། <br> སེམས་ཅན་ཐམས་ཅད་མ་ལུས་པ། ། <br> སྡིག་པ་ཐམས་ཅད་སྤངས་ནས་ནི། ། <br> རྟག་ཏུ་དགེ་བ་བྱེད་པར་ཤོག ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དང་མི་འབྲལ་ཞིང་། ། <br> བྱང་ཆུབ་སྤྱོད་ལ་གཞོལ་བ་དང་། ། <br> སངས་རྒྱས་རྣམས་ཀྱིས་ཡོངས་གཟུང་ཞིང་། ། <br> བདུད་ཀྱི་ལས་རྣམས་སྤང་བར་ཤོག ། <br> <br>",
                        "སེམས་ཅན་དེ་དག་ཐམས་ཅད་ནི། ། <br> ཚེ་ཡང་དཔག་མེད་རིང་བར་ཤོག ། <br> རྟག་ཏུ་བདེ་བར་འཚོ་འགྱུར་ཞིང་། ། <br> འཆི་བའི་སྒྲ་ཡང་གྲག་མ་གྱུར། ། <br> <br>",
                        "དཔག་བསམ་ཤིང་གི་སྐྱེད་མོས་ཚལ། ། <br> སངས་རྒྱས་དང་ནི་སངས་རྒྱས་སྲས། ། <br> ཆོས་སྙན་སྒྲོགས་པས་གང་བ་ཡིས། ། <br> ཕྱོགས་རྣམས་ཐམས་ཅད་གང་བར་ཤོག ། <br> <br>",
                        "ཐམས་ཅད་དུ་ཡང་ས་གཞི་དག ། <br> གསེག་མ་ལ་སོགས་མེད་པ་དང་། ། <br> ལག་མཐིལ་མཉམ་པ་བཻ་ཌཱུརྱའི། ། <br> རང་བཞིན་འཇམ་པོར་གནས་པར་གྱུར། ། <br> <br>",
                        "འཁོར་གྱི་དཀྱིལ་འཁོར་ཡོད་དགུར་ཡང་། ། <br> བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་དག ། <br> རང་གི་ལེགས་པས་ས་སྟེངས་དག ། <br> བརྒྱན་པར་མཛད་པས་བཞུགས་གྱུར་ཅིག ། <br> <br>",
                        "ལུས་ཅན་ཀུན་གྱིས་བྱ་དང་ནི། ། <br> ཤིང་དང་འོད་ཟེར་ཐམས་ཅད་དང་། ། <br> ནམ་མཁའ་ལས་ཀྱང་ཆོས་ཀྱི་སྒྲ། ། <br> རྒྱུན་མི་འཆད་པར་ཐོས་པར་ཤོག ། <br> <br>",
                        "དེ་དག་རྟག་ཏུ་སངས་རྒྱས་དང་། ། <br> སངས་རྒྱས་སྲས་དང་ཕྲད་གྱུར་ཅིག ། <br> མཆོད་པའི་སྤྲིན་ནི་མཐའ་ཡས་པས། ། <br> འགྲོ་བའི་བླ་མ་མཆོད་པར་ཤོག ། <br> <br>",
                        "ལྷ་ཡང་དུས་སུ་ཆར་འབེབས་ཤིང་། ། <br> ལོ་ཏོག་ཕུན་སུམ་ཚོགས་པར་ཤོག ། <br> རྒྱལ་པོ་ཆོས་བཞིན་བྱེད་གྱུར་ཅིག ། <br> འཇིག་རྟེན་དག་ཀྱང་དར་བར་ཤོག ། <br> <br>",
                        "སྨན་རྣམས་མཐུ་དང་ལྡན་པ་དང་། ། <br> གསང་སྔགས་བཟླས་བརྗོད་གྲུབ་པར་ཤོག ། <br> མཁའ་འགྲོ་སྲིན་པོ་ལ་སོགས་པ། ། <br> སྙིང་རྗེའི་སེམས་དང་ལྡན་གྱུར་ཅིག ། <br> <br>",
                        "སེམས་ཅན་འགའ་ཡང་སྡུག་མ་གྱུར། ། <br> འཇིགས་དང་བརྙས་པར་མི་འགྱུར་ཞིང་། ། <br> འགའ་ཡང་ཡིད་མི་བདེ་མ་གྱུར། ། <br> <br>",
                        "གཙུག་ལག་ཁང་རྣམས་ཀློག་པ་དང་། ། <br> ཁ་ཐོན་གྱིས་བརྒྱན་ལེགས་གནས་ཤོག ། <br> རྟག་ཏུ་དགེ་འདུན་མཐུན་པ་དང་། ། <br> དགེ་འདུན་དོན་ཡང་གྲུབ་པར་ཤོག ། <br> <br>",
                        "བསླབ་པ་འདོད་པའི་དགེ་སློང་དག ། <br> དབེན་པ་དག་ཀྱང་ཐོབ་པར་ཤོག ། <br> གཡེང་བ་ཐམས་ཅད་སྤངས་ནས་ནི། ། <br> སེམས་ནི་ལས་རུང་སྒོམ་གྱུར་ཅིག ། <br> <br>",
                        "དགེ་སློང་མ་རྣམས་རྙེད་ལྡན་ཞིང་། ། <br> འཐབ་དང་གནོད་པ་སྤང་བར་ཤོག ། <br> དེ་བཞིན་རབ་ཏུ་བྱུང་བ་ཀུན། ། <br> ཚུལ་ཁྲིམས་ཉམས་པ་མེད་གྱུར་ཅིག ། <br> <br>",
                        "ཚུལ་ཁྲིམས་འཆལ་པས་ཡིད་བྱུང་ནས། ། <br> རྟག་ཏུ་སྡིག་པ་ཟད་བྱེད་ཤོག ། <br> བདེ་འགྲོ་དག་ཀྱང་ཐོབ་གྱུར་ནས། ། <br> དེར་ཡང་བརྟུལ་ཞུགས་མི་ཉམས་ཤོག ། <br> <br>",
                        "མཁས་པ་རྣམས་ནི་བཀུར་བ་དང་། ། <br> བསོད་སྙོམས་དག་ཀྱང་རྙེད་པར་ཤོག ། <br> རྒྱུད་ནི་ཡོངས་སུ་དག་པ་དང་། ། <br> ཕྱོགས་རྣམས་ཀུན་ཏུ་གྲགས་པར་ཤོག ། <br> <br>",
                        "ངན་སོང་སྡུག་བསྔལ་མ་མྱོང་ཞིང་། ། <br> དཀའ་བ་སྤྱད་པ་མེད་པར་ཡང་། ། <br> ལྷ་བས་ལྷག་པའི་ལུས་ཀྱིས་ནི། ། <br> དེ་དག་སངས་རྒྱས་མྱུར་འགྲུབ་ཤོག ། <br> <br>",
                        "སེམས་ཅན་ཀུན་གྱིས་ལན་མང་དུ། ། <br> སངས་རྒྱས་ཐམས་ཅད་མཆོད་བྱེད་ཅིང་། ། <br> སངས་རྒྱས་བདེ་བ་བསམ་ཡས་ཀྱིས། ། <br> རྟག་ཏུ་བདེ་དང་ལྡན་གྱུར་ཅིག ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ནི། ། <br> འགྲོ་དོན་ཐུགས་ལ་དགོངས་འགྲུབ་ཤོག ། <br> མགོན་པོ་ཡིས་ནི་གང་དགོངས་པ། ། <br> སེམས་ཅན་རྣམས་ལ་དེ་འབྱོར་ཤོག ། <br> <br>",
                        "དེ་བཞིན་རང་སངས་རྒྱས་རྣམས་དང་། ། <br> ཉན་ཐོས་རྣམས་ཀྱང་བདེ་གྱུར་ཅིག ། <br> བདག་ཀྱང་འཇམ་དབྱངས་བཀའ་དྲིན་གྱིས། ། <br> ས་རབ་དགའ་བ་ཐོབ་པར་དུ། ། <br> རྟག་ཏུ་ཚེ་རབས་དྲན་པ་དང་། ། <br> རབ་ཏུ་བྱུང་བ་ཐོབ་པར་ཤོག ། <br> <br>",
                        "བདག་ནི་ཁ་ཟས་གྱི་ནས་ཀྱང་། ། <br> ཉམས་དང་ལྡན་ཞིང་འཚོ་བར་ཤོག ། <br> ཚེ་རབས་ཀུན་དུ་དབེན་གནས་པར། ། <br> ཕུན་སུམ་ལྡན་པ་ཐོབ་པར་ཤོག ། <br> <br>",
                        "གང་ཚེ་བལྟ་བར་འདོད་པའམ། ། <br> ཅུང་ཟད་དྲི་བར་འདོད་ན་ཡང་། ། <br> མགོན་པོ་འཇམ་དབྱངས་དེ་ཉིད་ནི། ། <br> གེགས་མེད་པར་ཡང་མཐོང་བར་ཤོག ། <br> <br>",
                        "ཕྱོགས་བཅུའི་ནམ་མཁའི་མཐས་གཏུགས་པའི། ། <br> སེམས་ཅན་ཀུན་དོན་བསྒྲུབ་པའི་ཕྱིར། ། <br> ཇི་ལྟར་འཇམ་དབྱངས་སྤྱོད་མཛད་པ། ། <br> བདག་གི་སྤྱོད་པའང་དེ་འདྲར་ཤོག ། <br> <br>",
                        "ཇི་སྲིད་ནམ་མཁའ་གནས་པ་དང་། ། <br> འགྲོ་བ་ཇི་སྲིད་གནས་གྱུར་པ། ། <br> དེ་སྲིད་བདག་ནི་གནས་གྱུར་ནས། ། <br> འགྲོ་བའི་སྡུག་བསྔལ་སེལ་བར་ཤོག ། <br> <br>",
                        "འགྲོ་བའི་སྡུག་བསྔལ་གང་ཅིའང་རུང་། ། <br> དེ་ཀུན་བདག་ལ་སྨིན་གྱུར་ཅིག ། <br> བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་གྱིས། ། <br> འགྲོ་བ་བདེ་ལ་སྤྱོད་པར་ཤོག ། <br> <br>",
                        "འགྲོ་བའི་སྡུག་བསྔལ་སྨན་གཅིག་པུ། ། <br> བདེ་བ་ཐམས་ཅད་འབྱུང་བའི་གནས། ། <br> བསྟན་པ་རྙེད་དང་བཀུར་སྟི་དང་། ། <br> བཅས་ཏེ་ཡུན་རིང་གནས་གྱུར་ཅིག ། <br> <br>",
                        "གང་གི་དྲིན་གྱིས་དགེ་བློ་འབྱུང་། ། <br> འཇམ་པའི་དབྱངས་ལ་ཕྱག་འཚལ་ལོ། ། <br> གང་གི་དྲིན་གྱིས་བདག་དར་བ། ། <br> དགེ་བའི་བཤེས་ལའང་བདག་ཕྱག་འཚལ། ། <br> <br>",
                        "བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་ལས་བསྔོ་བ་ཞེས་བྱ་བ་སྟེ་ལེའུ་བཅུ་པའོ།། <br>  ། <br> །བྱང་ཆུབ་སེས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་སློབ་དཔོན་ཤནྟ་དེ་བས་མཛད་པ་རྫོགས་སོ།། <br>  ། <br> ། <br>",
                        "རྒྱ་གར་གྱི་མཁན་པོ་སརྦ་ཛྙཱ་དེ་བ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བནྡེ་དཔལ་བརྩེགས་ཀྱིས་ཁ་ཆེའི་དཔེ་ལས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ་ལས། སླད་ཀྱིས་རྒྱ་གར་གྱི་མཁན་པོ་དྷརྨ་ཤྲཱི་བྷ་དྲ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བནྡེ་རིན་ཆེན་བཟང་པོ་དང་། ཤཱཀྱ་བློ་གྲོས་ཀྱིས་ཡུལ་དབུས་ཀྱི་དཔེ་དང་འགྲེལ་པ་དང་མཐུན་པར་བཅོས་ཤིང་བསྒྱུར་ཏེ་གཏན་ལ་ཕབ་པའོ། ། <br> ཡང་དུས་ཕྱིས་རྒྱ་གར་གྱི་མཁན་པོ་སུ་མ་ཏི་ཀཱིརྟི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་དགེ་སློང་བློ་ལྡན་ཤེས་རབ་ཀྱིས་དག་པར་བཅོས་ཤིང་བསྒྱུར་ཏེ་ལེགས་པར་གཏན་ལ་ཕབ་པའོ།། <br>  ། <br> ། <br>"
                    ]
                ],
                "direction": "ltr"
            }
        ]
    }
}