{
    "source": {
        "categories": [
            {
                "name": "Liturgy",
                "enDesc": "Prayers and rituals",
                "enShortDesc": "Prayers and rituals"
            },
            {
                "name": "Prayers",
                "enDesc": "",
                "enShortDesc": ""
            },
            {
                "name": "Prayer for the Future of the Dharma",
                "enDesc": "",
                "enShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "Una oración para el futuro del Dharma[es]",
                "language": "es",
                "versionSource": "source : https://www.lotsawahouse.org/words-of-the-buddha/prayer-future-dharma",
                "content": [
                    [
                        "Ante los budas: Vipaśyin, Śikhin, Viśvabhukra <br> Krakucchanda, Kanakamuni, and Kāśyapa <br> y Śākyamuni Gautama, el dios de dioses <br> ¡ante estos siete budas que son como guerreros nos postramos! <br>",
                        "En el pasado, para el beneficio de los seres <br> soporté todo tipo de adversidades <br> dejé de lado mi propia felicidad. Por estas acciones <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "En el pasado, para el beneficio de los enfermos <br> ofrecí mi vida; <br> ¡que las enseñanzas permanezcan y brillen largo tiempo <br> para proteger a los necesitados y a los pobres! <br>",
                        "Por haber dejado atrás a mis hijos, hijas, parejas <br> riquezas, elefantes y carruajes <br> en busca del tesoro de la iluminación <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por haber hecho ofrendas a los budas, a los pratyekabudas, <br> a los shravakas, hombres y mujeres, <br> así como a los grandes sabios, <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por haber soportado sufrimientos <br> durante millones de eones <br> en busca de instrucciones para alcanzar la iluminación <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por haber tenido una conducta disciplinada <br> haber hecho largos periodos de ascetismo <br> y haber presentado ofrendas a los budas de las diez direcciones <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por el esfuerzo constante que hice en el pasado <br> superando cualquier interrupción de los demás; <br> con el fin de liberar a todos los seres <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por mi práctica constante de paciencia <br> soportando la degeneración de las emociones negativas de los seres <br> y con paciencia todas sus acciones dañinas <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por mi concentración, mi completa liberación y mi absorción sin forma <br> en tantos samadis como granos de arena hay en el río Ganges <br> por la fuerza de mi meditación <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por haber buscado la sabiduría en el pasado <br> practicado de manera austera en los bosques <br> y enseñado incontables shastras a otros <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por haber ofrecido, por amor, mi propia carne y sangre <br> mi vida entera <br> mis brazos y piernas y todas las partes de mi cuerpo <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "Por haber hecho en el pasado, movido por la bondad amorosa <br> que seres dañinos maduraran por completo <br> y haberlos conducido a los tres vehículos <br> ¡que brillen las enseñanzas durante mucho tiempo en el futuro! <br>",
                        "En el pasado, con medios hábiles y sabiduría <br> liberé a los seres de visiones erróneas <br> y los orienté hacia la visión correcta. Por estas acciones <br> ¡que el Dharma florezca y aumente en todos los sentidos! <br>",
                        "Con los cuatro medios para atraer discípulos <br> liberé a los seres del fuego de las emociones <br> eliminando así la negatividad desenfrenada. Por estas acciones <br> ¡que mis seguidores permanezcan por mucho tiempo en el futuro! <br>",
                        "Liberé a tirthikas y a otros <br> de los ríos de las diferentes visiones <br> conduciéndolos a la visión correcta. Por estas acciones <br> ¡que mis seguidores tengan siempre devoción <br> y que brillen las enseñanzas durante mucho tiempo en el futuro! <br>"
                    ]
                ],
                "direction": "ltr"
            },
            {
                "title": "Prière pour l’avenir du Dharma[fr]",
                "language": "fr",
                "versionSource": "source : https://www.lotsawahouse.org/words-of-the-buddha/prayer-future-dharma",
                "content": [
                    [
                        "Ô bouddhas, Vipaśyin, Śikhin, Viśvabhū <br> Krakucchanda, Kanakamuni et Kāśyapa, <br> Et Śākyamuni – Gautama, déité de toutes les déités : <br> Je rends hommage aux sept bouddhas héroïques ! <br>",
                        "Par le passé, pour aider les êtres, <br> J’ai supporté toutes sortes d’épreuves <br> Et renoncé à mon propre bonheur. Grâce à cela, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Dans le passé, pour le bien des malades, <br> J’ai offert ma vie <br> De même, pour la protection des pauvres et des démunis, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Fils, filles, épouses, éléphants, chars <br> Et autres richesses : j’ai renoncé à toutes ces choses <br> Pour le précieux trésor de l’éveil ; grâce à cela, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grâce aux offrandes que j’ai présentées aux bouddhas, pratyekabuddhas, <br> Śrāvakas, hommes et femmes, <br> De même qu’aux grands sages, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grâce aux souffrances que j’ai endurées <br> Pendant des millions d’ères <br> À la recherche d’instructions menant à l’éveil, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grace à ma conduite disciplinée, <br> À mon long ascétisme, <br> Et aux offrandes que j’ai faites aux bouddhas des dix directions, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grâce à la diligence que j’ai déployée dans le passé, <br> Demeurant toujours stable et surmontant les perturbations causées par les autres <br> En vue de libérer tous les êtres, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grâce à ma pratique constante de la patience <br> Et à ma tolérance face aux actes nuisibles des êtres <br> Influencés par la dégénérescence de leurs émotions, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grâce à ma concentration, à mes délivrances parfaites2, à mes absorptions immatérielles, <br> Et à mes samādhis aussi nombreux qu’il y a de grains de sable sur les rives du Gange – <br> Grâce au pouvoir de ma méditation, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Grâce à ma quête de sagesse dans le passé, <br> À mes pratiques ascétiques dans la forêt, <br> Et au fait que j’aie enseigné aux autres d’innombrables śāstras, <br> Puissent les enseignements resplendir longtemps ! <br>",
                        "Par amour, j’ai donné ma chair et mon sang, <br> Mes bras, mes jambes, toutes les parties de mon corps ; <br> J’ai donné ma vie, sans réserve ! Puisse cela faire en sorte <br> Que la voie du Dharma fleurisse et se propage ! <br>",
                        "Dans le passé, plein d’amour, <br> J’ai amené à pleine maturité des êtres auparavant nuisibles, <br> Et je les ai menés aux trois véhicules. Grâce à cela, <br> Puisse le don du Dharma croître et s’épanouir ! <br>",
                        "Par le passé, avec habileté et sagesse, <br> J’ai libéré des êtres de leurs vues néfastes <br> Et les ai établis dans la vue correcte. Grâce à cela, <br> Puisse le Dharma croître sur tous les plans ! <br>",
                        "Avec les quatre façons d’attirer les disciples3, <br> J’ai libéré des êtres du feu des émotions <br> Et vaincu la négativité qui se propageait. Grâce à cela, <br> Puissent mes disciples demeurer longtemps ! <br>",
                        "J’ai libéré des tīrthikas et d’autres êtres <br> Des torrents des différentes vues <br> Et les ai menés à la vue authentique. Grâce à cela, <br> Puissent mes disciples avoir toujours de la dévotion ! <br> Puissent les enseignements resplendir longtemps ! <br>"
                    ]
                ],
                "direction": "ltr"
            },
            {
                "title": "Prayer for the Future of the Dharma",
                "language": "en",
                "versionSource": "source : https://www.lotsawahouse.org/words-of-the-buddha/prayer-future-dharma",
                "content": [
                    [
                        "To the buddhas: Vipaśyin, Śikhin, Viśvabhū, <br> Krakucchanda, Kanakamuni, and Kāśyapa, <br> And Śākyamuni—Gautama, deity of all deities, <br> To the seven warrior-like buddhas, I pay homage! <br>",
                        "In the past, to benefit being, <br> I bore all kinds of hardship, <br> And gave up my own happiness, through this, <br> May the teachings blaze, long into the future! <br>",
                        "In the past, for the sake of the sick, <br> I gave my life away, <br> So, to protect the needy and the poor <br> May the teachings blaze, long into the future! <br>",
                        "By my giving up sons, daughters, and wives, <br> Riches and elephants and chariots, <br> For the sake of the treasure of enlightenment, <br> May the teachings blaze, long into the future! <br>",
                        "Through the offerings I made to the buddhas, pratyekabuddhas, <br> Śrāvakas, male and female, <br> And to the great sages, <br> May the teachings blaze, long into the future! <br>",
                        "Through the sufferings I endured, <br> For many millions of aeons, <br> Seeking instruction for the sake of enlightenment, <br> May the teachings blaze, long into the future! <br>",
                        "Through my conduct of discipline, <br> And age-long asceticism, <br> And my offerings to the buddhas of ten directions, <br> May the teachings blaze, long into the future <br>",
                        "Through my diligence in the past, <br> Constantly stable, and overcoming others’ disruption, <br> So as to liberate all beings, <br> May the teachings blaze, long into the future! <br>",
                        "Through my constant practice of patience, <br> And my tolerance of beings’ harmful acts, <br> Caused by the degeneration of their negative emotions, <br> May the teachings blaze, long into the future! <br>",
                        "Through my concentration, perfect freedoms,2 formless absorptions, <br> And samādhis as many as the grains of sand in the river Ganges, <br> Through the power of my meditation, <br> May the teachings blaze, long into the future! <br>",
                        "Through seeking wisdom in the past, <br> By practising austerities in the forest, <br> And teaching countless śāstras to others, <br> May the teachings blaze, long into the future! <br>",
                        "Through giving, out of love, my flesh and blood, <br> Giving my life away entirely, <br> And giving arms and legs and every part of my body, <br> May the way of the Dharma flourish and expand! <br>",
                        "In the past, with loving kindness, I caused <br> Harmful sentient beings to mature completely, <br> And I led them to the three vehicles; through this <br> May the gift of Dharma thrive and grow! <br>",
                        "In the past, with skilful means and wisdom, <br> I liberated sentient beings from perverse views, <br> And led them to the correct view; through this, <br> May the Dharma increase in every way! <br>",
                        "With the four means of attracting disciples, <br> I released beings from the fire of the emotions, <br> And vanquished rampant negativity; through this, <br> May my followers remain, long into the future! <br>",
                        "I freed tīrthikas and others <br> From the rivers of different views <br> And led them to the correct view; through this <br> May my followers always have devotion! <br> May the teachings blaze, long into the future!” <br>"
                    ]
                ],
                "direction": "ltr"
            }
        ]
    },
    "target": {
        "categories": [
            {
                "name": "ཆོ་ག",
                "heDesc": "ཆོ་ག་དང་འདོན་ཆ།",
                "heShortDesc": "ཆོ་ག་དང་འདོན་ཆ།"
            },
            {
                "name": "སྨོན་ལམ།",
                "heDesc": "",
                "heShortDesc": ""
            },
            {
                "name": "བསྟན་འབར་མ།",
                "heDesc": "",
                "heShortDesc": ""
            }
        ],
        "books": [
            {
                "title": "བསྟན་འབར་མ།",
                "language": "bo",
                "versionSource": "https://www.lotsawahouse.org/words-of-the-buddha/prayer-future-dharma",
                "content": [
                    [
                        "སངས་རྒྱས་རྣམ་གཟིགས་གཙུག་ཏོར་ཐམས་ཅད་སྐྱོབ། ། <br> <br> འཁོར་བ་འཇིག་དང་གསེར་ཐུབ་འོད་སྲུང་དང་། ། <br> <br> ཤཱཀྱ་ཐུབ་པ་གོའུ་ཏཾ་ལྷ་ཡི་ལྷ། ། <br> <br> སངས་རྒྱས་དཔའ་བོ་བདུན་ལ་ཕྱག་འཚལ་ལོ། ། <br> <br>",
                        "སེམས་ཅན་དོན་དུ་བདག་གིས་སྔོན། ། <br> <br> དཀའ་བ་གང་ཞིག་སྤྱད་གྱུར་དང་། ། <br> <br> བདག་གི་བདེ་བ་བཏང་བ་ཡིས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "ངས་སྔོན་ནད་པའི་ཆེད་དག་ཏུ། ། <br> <br> རང་གི་འཚོ་བ་ཡོངས་བཏང་བས། ། <br> <br> སེམས་ཅན་ཕོངས་པ་བསྐྱབ་པའི་ཕྱིར། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བུ་དང་བུ་མོ་ཆུང་མ་དང་། ། <br> <br> ནོར་དང་གླང་ཆེན་ཤིང་རྟ་དང་། ། <br> <br> རིན་ཆེན་བྱང་ཆུབ་ཕྱིར་བཏང་བས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བདག་གིས་སངས་རྒྱས་རང་སངས་རྒྱས། ། <br> <br> ཉན་ཐོས་ཕ་དང་མ་དང་ནི། ། <br> <br> དྲང་སྲོང་དག་ལ་མཆོད་བྱས་པས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བསྐལ་པ་བྱེ་བ་དུ་མར་བདག ། <br> <br> སྡུག་བསྔལ་སྣ་ཚོགས་མྱོང་གྱུར་ཅིང་། ། <br> <br> བྱང་ཆུབ་དོན་དུ་ཐོས་བཙལ་བས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བདག་གིས་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་དང་། ། <br> <br> དཀའ་ཐུབ་ཡུན་རིང་བསྟེན་བྱས་ཤིང་། ། <br> <br> ཕྱོགས་བཅུའི་སངས་རྒྱས་ངས་མཆོད་པས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བདག་སྔོན་བརྩོན་འགྲུས་དང་ལྡན་པས། ། <br> <br> རྟག་ཏུ་བརྟན་ཅིང་ཕ་རོལ་གནོན། ། <br> <br> སེམས་ཅན་ཐམས་ཅད་བསྒྲལ་དོན་དུ། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བཟོད་བརྟུལ་རྟག་ཏུ་བསྟེན་བྱས་ཤིང་། ། <br> <br> སེམས་ཅན་ཉོན་མོངས་སྙིགས་མ་ཡིས། ། <br> <br> སེམས་ཅན་ངན་བྱས་བཟོད་གྱུར་པས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བསམ་གཏན་རྣམ་ཐར་གཟུགས་མེད་དང་། ། <br> <br> ཏིང་འཛིན་གང་གཱའི་བྱེ་སྙེད་པ། ། <br> <br> བསྒོམས་པས་དེ་མཐུས་བདག་གི་ནི། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "ཡེ་ཤེས་དོན་དུ་བདག་གིས་སྔོན། ། <br> <br> དཀའ་ཐུབ་ནགས་དག་བསྟེན་བྱས་ཤིང་། ། <br> <br> བསྟན་བཅོས་དུ་མ་ཉེར་བསྟེན་པས། ། <br> <br> བསྟན་པ་ཡུན་རིང་འབར་གྱུར་ཅིག ། <br> <br>",
                        "བརྩེ་བའི་རྒྱུ་ཡིས་ཤ་ཁྲག་དང་། ། <br> <br> འཚོ་བ་ཡོངས་སུ་བཏང་གྱུར་ཅིང་། ། <br> <br> ཡན་ལག་ཉིང་ལག་བཏང་པ་ཡིས། ། <br> <br> ཆོས་ཚུལ་རྣམ་པར་འཕེལ་གྱུར་ཅིག ། <br> <br>",
                        "བདག་སྔོན་སྡིག་པའི་སེམས་ཅན་རྣམས། ། <br> <br> བྱམས་པས་གསལ་བར་སྨིན་བྱས་ཤིང་། ། <br> <br> ཐེག་པ་གསུམ་ལ་རབ་བཀོད་པས། ། <br> <br> ཆོས་ཀྱི་མཆོད་སྦྱིན་རྒྱས་གྱུར་ཅིག ། <br> <br>",
                        "བདག་སྔོན་ཐབས་ཤེས་གྱུར་པ་ན། <br> སེམས་ཅན་ལྟ་ངན་ལས་བསྒྲལ་ཞིང་། ། <br> <br> ཡང་དག་ལྟ་ལ་བཀོད་བྱས་པས། ། <br> <br> ཆོས་ནི་རྣམ་པར་འཕེལ་གྱུར་ཅིག ། <br> <br>",
                        "བདག་གིས་སེམས་ཅན་བསྡུ་དངོས་བཞིས། ། <br> <br> ཉོན་མོངས་མེ་ལས་ཐར་བྱས་ཤིང་། ། <br> <br> བདག་གིས་འཕེལ་སྡིག་ཕམ་བྱས་པས། ། <br> <br> བདག་འཁོར་ཡུན་རིང་གནས་གྱུར་ཅིག ། <br> <br>",
                        "བདག་གིས་མུ་སྟེགས་ཅན་གཞན་དག ། <br> <br> ལྟ་བའི་ཆུ་ལས་བསྒྲལ་བྱས་ཏེ། ། <br> <br> ཡང་དག་ལྟ་ལ་བཀོད་གྱུར་པས། ། <br> <br> བདག་འཁོར་རྟག་ཏུ་གུས་གྱུར་ཅིག ། <br> <br> ཡུན་རིང་བསྟན་པ་འབར་གྱུར་ཅིག ། <br> <br>"
                    ]
                ],
                "direction": "ltr"
            }
        ]
    }
}